MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
typedef struct stc_ethernet_mac_chrbar_field
{
  __IO uint32_t HRBAR      : 32;
} stc_ethernet_mac_chrbar_field_t;

/******************************************************************************
 * ETHERNET_CONTROL_MODULE
 ******************************************************************************/
/* ETHERNET_CONTROL_MODULE register bit fields */
typedef struct stc_ethernet_control_eth_mode_field
{
  __IO uint32_t IFMODE     : 1;
       uint32_t RESERVED1  : 7;
  __IO uint32_t RST0       : 1;
  __IO uint32_t RST1       : 1;
       uint32_t RESERVED2  : 18;
  __IO uint32_t PPSSEL     : 1;
} stc_ethernet_control_eth_mode_field_t;

typedef struct stc_ethernet_control_eth_clkg_field
{
  __IO uint32_t MACEN      : 2;
} stc_ethernet_control_eth_clkg_field_t;

/******************************************************************************
 * I2S_MODULE
 ******************************************************************************/
/* I2S_MODULE register bit fields */
typedef struct stc_i2s_rxfdat_field
{
  __IO uint32_t RXDATA     : 32;
} stc_i2s_rxfdat_field_t;

typedef struct stc_i2s_txfdat_field
{
  __IO uint32_t TXDATA     : 32;
} stc_i2s_txfdat_field_t;

typedef struct stc_i2s_cntreg_field
{
  __IO uint32_t FSPL       : 1;
  __IO uint32_t FSLN       : 1;
  __IO uint32_t FSPH       : 1;
  __IO uint32_t CPOL       : 1;
  __IO uint32_t SMPL       : 1;
  __IO uint32_t RXDIS      : 1;
  __IO uint32_t TXDIS      : 1;
  __IO uint32_t MLSB       : 1;
  __IO uint32_t FRUN       : 1;
  __IO uint32_t BEXT       : 1;
  __IO uint32_t ECKM       : 1;
  __IO uint32_t RHLL       : 1;
  __IO uint32_t SBFN       : 1;
  __IO uint32_t MSMD       : 1;
  __IO uint32_t MSKB       : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t OVHD       : 10;
  __IO uint32_t CKRT       : 6;
} stc_i2s_cntreg_field_t;

typedef struct stc_i2s_mcr0reg_field
{
  __IO uint32_t S0WDL      : 5;
  __IO uint32_t S0CHL      : 5;
  __IO uint32_t S0CHN      : 5;
       uint32_t RESERVED1  : 1;
  __IO uint32_t S1WDL      : 5;
  __IO uint32_t S1CHL      : 5;
  __IO uint32_t S1CHN      : 5;
} stc_i2s_mcr0reg_field_t;

typedef struct stc_i2s_mcr1reg_field
{
  __IO uint32_t S0CH00     : 1;
  __IO uint32_t S0CH01     : 1;
  __IO uint32_t S0CH02     : 1;
  __IO uint32_t S0CH03     : 1;
  __IO uint32_t S0CH04     : 1;
  __IO uint32_t S0CH05     : 1;
  __IO uint32_t S0CH06     : 1;
  __IO uint32_t S0CH07     : 1;
  __IO uint32_t S0CH08     : 1;
  __IO uint32_t S0CH09     : 1;
  __IO uint32_t S0CH10     : 1;
  __IO uint32_t S0CH11     : 1;
  __IO uint32_t S0CH12     : 1;
  __IO uint32_t S0CH13     : 1;
  __IO uint32_t S0CH14     : 1;
  __IO uint32_t S0CH15     : 1;
  __IO uint32_t S0CH16     : 1;
  __IO uint32_t S0CH17     : 1;
  __IO uint32_t S0CH18     : 1;
  __IO uint32_t S0CH19     : 1;
  __IO uint32_t S0CH20     : 1;
  __IO uint32_t S0CH21     : 1;
  __IO uint32_t S0CH22     : 1;
  __IO uint32_t S0CH23     : 1;
  __IO uint32_t S0CH24     : 1;
  __IO uint32_t S0CH25     : 1;
  __IO uint32_t S0CH26     : 1;
  __IO uint32_t S0CH27     : 1;
  __IO uint32_t S0CH28     : 1;
  __IO uint32_t S0CH29     : 1;
  __IO uint32_t S0CH30     : 1;
  __IO uint32_t S0CH31     : 1;
} stc_i2s_mcr1reg_field_t;

typedef struct stc_i2s_mcr2reg_field
{
  __IO uint32_t S1CH00     : 1;
  __IO uint32_t S1CH01     : 1;
  __IO uint32_t S1CH02     : 1;
  __IO uint32_t S1CH03     : 1;
  __IO uint32_t S1CH04     : 1;
  __IO uint32_t S1CH05     : 1;
  __IO uint32_t S1CH06     : 1;
  __IO uint32_t S1CH07     : 1;
  __IO uint32_t S1CH08     : 1;
  __IO uint32_t S1CH09     : 1;
  __IO uint32_t S1CH10     : 1;
  __IO uint32_t S1CH11     : 1;
  __IO uint32_t S1CH12     : 1;
  __IO uint32_t S1CH13     : 1;
  __IO uint32_t S1CH14     : 1;
  __IO uint32_t S1CH15     : 1;
  __IO uint32_t S1CH16     : 1;
  __IO uint32_t S1CH17     : 1;
  __IO uint32_t S1CH18     : 1;
  __IO uint32_t S1CH19     : 1;
  __IO uint32_t S1CH20     : 1;
  __IO uint32_t S1CH21     : 1;
  __IO uint32_t S1CH22     : 1;
  __IO uint32_t S1CH23     : 1;
  __IO uint32_t S1CH24     : 1;
  __IO uint32_t S1CH25     : 1;
  __IO uint32_t S1CH26     : 1;
  __IO uint32_t S1CH27     : 1;
  __IO uint32_t S1CH28     : 1;
  __IO uint32_t S1CH29     : 1;
  __IO uint32_t S1CH30     : 1;
  __IO uint32_t S1CH31     : 1;
} stc_i2s_mcr2reg_field_t;

typedef struct stc_i2s_oprreg_field
{
  __IO uint32_t START      : 1;
       uint32_t RESERVED1  : 15;
  __IO uint32_t TXENB      : 1;
       uint32_t RESERVED2  : 7;
  __IO uint32_t RXENB      : 1;
} stc_i2s_oprreg_field_t;

typedef struct stc_i2s_srst_field
{
  __IO uint32_t SRST       : 1;
} stc_i2s_srst_field_t;

typedef struct stc_i2s_intcnt_field
{
  __IO uint32_t RFTH       : 4;
  __IO uint32_t RPTMR      : 2;
       uint32_t RESERVED1  : 2;
  __IO uint32_t TFTH       : 4;
       uint32_t RESERVED2  : 4;
  __IO uint32_t RXFIM      : 1;
  __IO uint32_t RXFDM      : 1;
  __IO uint32_t EOPM       : 1;
  __IO uint32_t RXOVM      : 1;
  __IO uint32_t RXUDM      : 1;
  __IO uint32_t RBERM      : 1;
       uint32_t RESERVED3  : 2;
  __IO uint32_t TXFIM      : 1;
  __IO uint32_t TXFDM      : 1;
  __IO uint32_t TXOVM      : 1;
  __IO uint32_t TXUD0M     : 1;
  __IO uint32_t FERRM      : 1;
  __IO uint32_t TBERM      : 1;
  __IO uint32_t TXUD1M     : 1;
} stc_i2s_intcnt_field_t;

typedef struct stc_i2s_status_field
{
  __IO uint32_t RXNUM      : 8;
  __IO uint32_t TXNUM      : 8;
  __IO uint32_t RXFI       : 1;
  __IO uint32_t TXFI       : 1;
  __IO uint32_t BSY        : 1;
  __IO uint32_t EOPI       : 1;
       uint32_t RESERVED1  : 4;
  __IO uint32_t RXOVR      : 1;
  __IO uint32_t RXUDR      : 1;
  __IO uint32_t TXOVR      : 1;
  __IO uint32_t TXUDR0     : 1;
  __IO uint32_t TXUDR1     : 1;
  __IO uint32_t FERR       : 1;
  __IO uint32_t RBERR      : 1;
  __IO uint32_t TBERR      : 1;
} stc_i2s_status_field_t;

typedef struct stc_i2s_dmaact_field
{
  __IO uint32_t RDMACT     : 1;
       uint32_t RESERVED1  : 7;
  __IO uint32_t RL1E0      : 1;
       uint32_t RESERVED2  : 7;
  __IO uint32_t TDMACT     : 1;
       uint32_t RESERVED3  : 7;
  __IO uint32_t TL1E0      : 1;
} stc_i2s_dmaact_field_t;

typedef struct stc_i2s_tstreg_field
{
  __IO uint32_t LBMD       : 1;
} stc_i2s_tstreg_field_t;

