MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
/******************************************************************************
 * SDIF_MODULE
 ******************************************************************************/
/* SDIF_MODULE register bit fields */
typedef struct stc_sdif_sbsize_field
{
  __IO uint16_t TRSFBLCKSZ : 12;
  __IO uint16_t HSDMABUFBD : 3;
       uint16_t RESERVED1  : 1;
} stc_sdif_sbsize_field_t;

typedef struct stc_sdif_strsfmd_field
{
  __IO uint16_t DMAEN      : 1;
  __IO uint16_t BLCKCNTEN  : 1;
  __IO uint16_t AUTOCMDEN  : 2;
  __IO uint16_t DTTRSFDIR  : 1;
  __IO uint16_t BLCKCNTSEL : 1;
} stc_sdif_strsfmd_field_t;

typedef struct stc_sdif_scmmd_field
{
  __IO uint16_t RESPTYPE   : 2;
       uint16_t RESERVED1  : 1;
  __IO uint16_t CMDCRCCHKE : 1;
  __IO uint16_t CMDIDXCHKE : 1;
  __IO uint16_t DATPRESSEL : 1;
  __IO uint16_t CMDTYPE    : 2;
  __IO uint16_t CMDINDEX   : 6;
} stc_sdif_scmmd_field_t;

typedef struct stc_sdif_sprstat_field
{
  __IO uint32_t CMDINH     : 1;
  __IO uint32_t CMDDATINH : 1;
  __IO uint32_t DATLNACT   : 1;
  __IO uint32_t RETUNEREQ  : 1;
       uint32_t RESERVED1  : 4;
  __IO uint32_t WRTRSFACT  : 1;
  __IO uint32_t RDTRSFACT  : 1;
  __IO uint32_t BUFWREN    : 1;
  __IO uint32_t BUFRDEN    : 1;
       uint32_t RESERVED2  : 4;
  __IO uint32_t CARDINS    : 1;
  __IO uint32_t CARDSTB    : 1;
  __IO uint32_t CARDDET    : 1;
  __IO uint32_t WPPINLVL   : 1;
  __IO uint32_t LNSGNLVL   : 4;
  __IO uint32_t CMDLNSGN   : 1;
       uint32_t RESERVED3  : 7;
} stc_sdif_sprstat_field_t;

typedef struct stc_sdif_shctl1_field
{
  __IO uint8_t LEDCTRL     : 1;
  __IO uint8_t DATAWIDTH   : 1;
  __IO uint8_t HIGHSPDEN   : 1;
  __IO uint8_t DMASEL      : 2;
  __IO uint8_t EXTDTWIDTH  : 1;
  __IO uint8_t CDTSTLVL    : 1;
  __IO uint8_t CDSGNSEL    : 1;
} stc_sdif_shctl1_field_t;

typedef struct stc_sdif_spwrctl_field
{
  __IO uint8_t SDBUSPWR    : 1;
  __IO uint8_t SDBUSVLSEL  : 3;
       uint8_t RESERVED1   : 4;
} stc_sdif_spwrctl_field_t;

typedef struct stc_sdif_sblkgpctl_field
{
  __IO uint8_t BLCKGSTPREQ : 1;
  __IO uint8_t CONTREQ     : 1;
  __IO uint8_t RDWAITCTL   : 1;
  __IO uint8_t BLCKGAPINT  : 1;
       uint8_t RESERVED1   : 4;
} stc_sdif_sblkgpctl_field_t;

typedef struct stc_sdif_swkupctl_field
{
  __IO uint8_t WKUPEVNTEN0 : 1;
  __IO uint8_t WKUPEVNTEN1 : 1;
  __IO uint8_t WKUPEVNTEN2 : 1;
       uint8_t RESERVED1   : 5;
} stc_sdif_swkupctl_field_t;

typedef struct stc_sdif_sclkctl_field
{
  __IO uint16_t INTLCLCKEN : 1;
  __IO uint16_t INTLCLCKST : 1;
  __IO uint16_t SDCLCKEN   : 1;
       uint16_t RESERVED1  : 2;
  __IO uint16_t CLCKGENSEL : 1;
  __IO uint16_t UPSDCLKSEL : 2;
  __IO uint16_t SDCLKSEL   : 8;
} stc_sdif_sclkctl_field_t;

typedef struct stc_sdif_stoctl_field
{
  __IO uint8_t DTTMOUTVAL : 4;
       uint8_t RESERVED1  : 4;
} stc_sdif_stoctl_field_t;

typedef struct stc_sdif_ssrst_field
{
  __IO uint8_t SWRSTALL   : 1;
  __IO uint8_t SWRSTCMDLN : 1;
  __IO uint8_t SWRSTDATLN : 1;
       uint8_t RESERVED1  : 5;
} stc_sdif_ssrst_field_t;

typedef struct stc_sdif_snintst_field
{
  __IO uint16_t CMDCMPLT  : 1;
  __IO uint16_t TRSFCMPLT : 1;
  __IO uint16_t BLCKGEVNT : 1;
  __IO uint16_t DMAINT    : 1;
  __IO uint16_t BUFWRRDY  : 1;
  __IO uint16_t BUFRDRDY  : 1;
  __IO uint16_t CARDINS   : 1;
  __IO uint16_t CARDRMV   : 1;
  __IO uint16_t CARDINT   : 1;
  __IO uint16_t INT_A     : 1;
  __IO uint16_t INT_B     : 1;
  __IO uint16_t INT_C     : 1;
  __IO uint16_t RETUNEEVT : 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t ERRORINT  : 1;
} stc_sdif_snintst_field_t;

typedef struct stc_sdif_seintst_field
{
  __IO uint16_t CMDTOERR  : 1;
  __IO uint16_t CMDCRCERR : 1;
  __IO uint16_t CMDEBERR  : 1;
  __IO uint16_t CMDIDXERR : 1;
  __IO uint16_t DTTOERR   : 1;
  __IO uint16_t DTEBERR   : 1;
  __IO uint16_t DTCRCERR  : 1;
  __IO uint16_t CRTLMTERR : 1;
  __IO uint16_t ACMD12ERR : 1;
  __IO uint16_t ADMAERR   : 1;
  __IO uint16_t TUNINGERR : 1;
       uint16_t RESERVED1 : 1;
  __IO uint16_t BTACKERR  : 1;
  __IO uint16_t ACMD19ERR : 1;
  __IO uint16_t AHBMSTERR : 1;
       uint16_t RESERVED2 : 1;
} stc_sdif_seintst_field_t;

typedef struct stc_sdif_snintste_field
{
  __IO uint16_t CMDCMPLTS : 1;
  __IO uint16_t TRSFCMPLTS: 1;
  __IO uint16_t BLCKGEVNTS: 1;
  __IO uint16_t DMAINTS   : 1;
  __IO uint16_t BUFWRRDYS : 1;
  __IO uint16_t BUFRDRDYS : 1;
  __IO uint16_t CARDINSS  : 1;
  __IO uint16_t CARDRMVS  : 1;
  __IO uint16_t CARDINTS  : 1;
  __IO uint16_t INT_AS    : 1;
  __IO uint16_t INT_BS    : 1;
  __IO uint16_t INT_CS    : 1;
  __IO uint16_t RETUNEEVTS: 1;
       uint16_t RESERVED1 : 3;
} stc_sdif_snintste_field_t;

typedef struct stc_sdif_seintste_field
{
  __IO uint16_t CMDTOERRS : 1;
  __IO uint16_t CMDCRCERRS: 1;
  __IO uint16_t CMDEBERRS : 1;
  __IO uint16_t CMDIDXERRS: 1;
  __IO uint16_t DTTOERRS  : 1;
  __IO uint16_t DTEBERRS  : 1;
  __IO uint16_t DTCRCERRS : 1;
  __IO uint16_t CRTLMTERRS: 1;
  __IO uint16_t ACMD12ERRS: 1;
  __IO uint16_t ADMAERRS  : 1;
  __IO uint16_t TUNINGERRS: 1;
       uint16_t RESERVED1 : 1;
  __IO uint16_t BTACKERRS : 1;
  __IO uint16_t ACMD19ERRS: 1;
  __IO uint16_t AHBMSTERRS: 1;
       uint16_t RESERVED2 : 1;
} stc_sdif_seintste_field_t;

typedef struct stc_sdif_snintsge_field
{
  __IO uint16_t CMDCMPLTG : 1;
  __IO uint16_t TRSFCMPLTG: 1;
  __IO uint16_t BLCKGEVNTG: 1;
  __IO uint16_t DMAINTG   : 1;
  __IO uint16_t BUFWRRDYG : 1;
  __IO uint16_t BUFRDRDYG : 1;
  __IO uint16_t CARDINSG  : 1;
  __IO uint16_t CARDRMVG  : 1;
  __IO uint16_t CARDINTG  : 1;
  __IO uint16_t INT_AG    : 1;
  __IO uint16_t INT_BG    : 1;
  __IO uint16_t INT_CG    : 1;
  __IO uint16_t RETUNEEVTG: 1;
       uint16_t RESERVED1 : 3;
} stc_sdif_snintsge_field_t;

typedef struct stc_sdif_seintsge_field
{
  __IO uint16_t CMDTOERRG : 1;
  __IO uint16_t CMDCRCERRG: 1;
  __IO uint16_t CMDEBERRG : 1;
  __IO uint16_t CMDIDXERRG: 1;
  __IO uint16_t DTTOERRG  : 1;
  __IO uint16_t DTEBERRG  : 1;
  __IO uint16_t DTCRCERRG : 1;
  __IO uint16_t CRTLMTERRG: 1;
  __IO uint16_t ACMD12ERRG: 1;
  __IO uint16_t ADMAERRG  : 1;
  __IO uint16_t TUNINGERRG: 1;
       uint16_t RESERVED1 : 1;
  __IO uint16_t BTACKERRG : 1;
  __IO uint16_t ACMD19ERRG: 1;
  __IO uint16_t AHBMSTERRG: 1;
       uint16_t RESERVED2 : 1;
} stc_sdif_seintsge_field_t;

