MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
/* Dual timer 1/2 registers */
#define bFM4_DTIM_TIMER1CONTROL_ONESHOT        *((volatile unsigned int*)(0x422A0100UL))
#define bFM4_DTIM_TIMER1CONTROL_TIMERSIZE      *((volatile unsigned int*)(0x422A0104UL))
#define bFM4_DTIM_TIMER1CONTROL_TIMERPRE0      *((volatile unsigned int*)(0x422A0108UL))
#define bFM4_DTIM_TIMER1CONTROL_TIMERPRE1      *((volatile unsigned int*)(0x422A010CUL))
#define bFM4_DTIM_TIMER1CONTROL_INTENABLE      *((volatile unsigned int*)(0x422A0114UL))
#define bFM4_DTIM_TIMER1CONTROL_TIMERMODE      *((volatile unsigned int*)(0x422A0118UL))
#define bFM4_DTIM_TIMER1CONTROL_TIMEREN        *((volatile unsigned int*)(0x422A011CUL))
#define bFM4_DTIM_TIMER1RIS_TIMERXRIS          *((volatile unsigned int*)(0x422A0200UL))
#define bFM4_DTIM_TIMER1MIS_TIMERXRIS          *((volatile unsigned int*)(0x422A0280UL))
#define bFM4_DTIM_TIMER2CONTROL_ONESHOT        *((volatile unsigned int*)(0x422A0500UL))
#define bFM4_DTIM_TIMER2CONTROL_TIMERSIZE      *((volatile unsigned int*)(0x422A0504UL))
#define bFM4_DTIM_TIMER2CONTROL_TIMERPRE0      *((volatile unsigned int*)(0x422A0508UL))
#define bFM4_DTIM_TIMER2CONTROL_TIMERPRE1      *((volatile unsigned int*)(0x422A050CUL))
#define bFM4_DTIM_TIMER2CONTROL_INTENABLE      *((volatile unsigned int*)(0x422A0514UL))
#define bFM4_DTIM_TIMER2CONTROL_TIMERMODE      *((volatile unsigned int*)(0x422A0518UL))
#define bFM4_DTIM_TIMER2CONTROL_TIMEREN        *((volatile unsigned int*)(0x422A051CUL))
#define bFM4_DTIM_TIMER2RIS_TIMERXRIS          *((volatile unsigned int*)(0x422A0600UL))
#define bFM4_DTIM_TIMER2MIS_TIMERXRIS          *((volatile unsigned int*)(0x422A0680UL))

/* Multifunction Timer unit 0 Free Running Timer registers */
#define bFM4_MFT0_FRT_TCSA0_CLK0               *((volatile unsigned char*)(0x42402900UL))
#define bFM4_MFT0_FRT_TCSA0_CLK1               *((volatile unsigned char*)(0x42402904UL))
#define bFM4_MFT0_FRT_TCSA0_CLK2               *((volatile unsigned char*)(0x42402908UL))
#define bFM4_MFT0_FRT_TCSA0_CLK3               *((volatile unsigned char*)(0x4240290CUL))
#define bFM4_MFT0_FRT_TCSA0_SCLR               *((volatile unsigned char*)(0x42402910UL))
#define bFM4_MFT0_FRT_TCSA0_MODE               *((volatile unsigned char*)(0x42402914UL))
#define bFM4_MFT0_FRT_TCSA0_STOP               *((volatile unsigned char*)(0x42402918UL))
#define bFM4_MFT0_FRT_TCSA0_BFE                *((volatile unsigned char*)(0x4240291CUL))
#define bFM4_MFT0_FRT_TCSA0_ICRE               *((volatile unsigned char*)(0x42402920UL))
#define bFM4_MFT0_FRT_TCSA0_ICLR               *((volatile unsigned char*)(0x42402924UL))
#define bFM4_MFT0_FRT_TCSA0_IRQZE              *((volatile unsigned char*)(0x42402934UL))
#define bFM4_MFT0_FRT_TCSA0_IRQZF              *((volatile unsigned char*)(0x42402938UL))
#define bFM4_MFT0_FRT_TCSA0_ECKE               *((volatile unsigned char*)(0x4240293CUL))
#define bFM4_MFT0_FRT_TCSC0_MSZI0              *((volatile unsigned char*)(0x42402940UL))
#define bFM4_MFT0_FRT_TCSC0_MSZI1              *((volatile unsigned char*)(0x42402944UL))
#define bFM4_MFT0_FRT_TCSC0_MSZI2              *((volatile unsigned char*)(0x42402948UL))
#define bFM4_MFT0_FRT_TCSC0_MSZI3              *((volatile unsigned char*)(0x4240294CUL))
#define bFM4_MFT0_FRT_TCSC0_MSPI0              *((volatile unsigned char*)(0x42402950UL))
#define bFM4_MFT0_FRT_TCSC0_MSPI1              *((volatile unsigned char*)(0x42402954UL))
#define bFM4_MFT0_FRT_TCSC0_MSPI2              *((volatile unsigned char*)(0x42402958UL))
#define bFM4_MFT0_FRT_TCSC0_MSPI3              *((volatile unsigned char*)(0x4240295CUL))
#define bFM4_MFT0_FRT_TCSC0_MSZC0              *((volatile unsigned char*)(0x42402960UL))
#define bFM4_MFT0_FRT_TCSC0_MSZC1              *((volatile unsigned char*)(0x42402964UL))
#define bFM4_MFT0_FRT_TCSC0_MSZC2              *((volatile unsigned char*)(0x42402968UL))
#define bFM4_MFT0_FRT_TCSC0_MSZC3              *((volatile unsigned char*)(0x4240296CUL))
#define bFM4_MFT0_FRT_TCSC0_MSPC0              *((volatile unsigned char*)(0x42402970UL))
#define bFM4_MFT0_FRT_TCSC0_MSPC1              *((volatile unsigned char*)(0x42402974UL))
#define bFM4_MFT0_FRT_TCSC0_MSPC2              *((volatile unsigned char*)(0x42402978UL))
#define bFM4_MFT0_FRT_TCSC0_MSPC3              *((volatile unsigned char*)(0x4240297CUL))
#define bFM4_MFT0_FRT_TCSA1_CLK0               *((volatile unsigned char*)(0x42402A80UL))
#define bFM4_MFT0_FRT_TCSA1_CLK1               *((volatile unsigned char*)(0x42402A84UL))
#define bFM4_MFT0_FRT_TCSA1_CLK2               *((volatile unsigned char*)(0x42402A88UL))
#define bFM4_MFT0_FRT_TCSA1_CLK3               *((volatile unsigned char*)(0x42402A8CUL))
#define bFM4_MFT0_FRT_TCSA1_SCLR               *((volatile unsigned char*)(0x42402A90UL))
#define bFM4_MFT0_FRT_TCSA1_MODE               *((volatile unsigned char*)(0x42402A94UL))
#define bFM4_MFT0_FRT_TCSA1_STOP               *((volatile unsigned char*)(0x42402A98UL))
#define bFM4_MFT0_FRT_TCSA1_BFE                *((volatile unsigned char*)(0x42402A9CUL))
#define bFM4_MFT0_FRT_TCSA1_ICRE               *((volatile unsigned char*)(0x42402AA0UL))
#define bFM4_MFT0_FRT_TCSA1_ICLR               *((volatile unsigned char*)(0x42402AA4UL))
#define bFM4_MFT0_FRT_TCSA1_IRQZE              *((volatile unsigned char*)(0x42402AB4UL))
#define bFM4_MFT0_FRT_TCSA1_IRQZF              *((volatile unsigned char*)(0x42402AB8UL))
#define bFM4_MFT0_FRT_TCSA1_ECKE               *((volatile unsigned char*)(0x42402ABCUL))
#define bFM4_MFT0_FRT_TCSC1_MSZI0              *((volatile unsigned char*)(0x42402AC0UL))
#define bFM4_MFT0_FRT_TCSC1_MSZI1              *((volatile unsigned char*)(0x42402AC4UL))
#define bFM4_MFT0_FRT_TCSC1_MSZI2              *((volatile unsigned char*)(0x42402AC8UL))
#define bFM4_MFT0_FRT_TCSC1_MSZI3              *((volatile unsigned char*)(0x42402ACCUL))
#define bFM4_MFT0_FRT_TCSC1_MSPI0              *((volatile unsigned char*)(0x42402AD0UL))
#define bFM4_MFT0_FRT_TCSC1_MSPI1              *((volatile unsigned char*)(0x42402AD4UL))
#define bFM4_MFT0_FRT_TCSC1_MSPI2              *((volatile unsigned char*)(0x42402AD8UL))
#define bFM4_MFT0_FRT_TCSC1_MSPI3              *((volatile unsigned char*)(0x42402ADCUL))
#define bFM4_MFT0_FRT_TCSC1_MSZC0              *((volatile unsigned char*)(0x42402AE0UL))
#define bFM4_MFT0_FRT_TCSC1_MSZC1              *((volatile unsigned char*)(0x42402AE4UL))
#define bFM4_MFT0_FRT_TCSC1_MSZC2              *((volatile unsigned char*)(0x42402AE8UL))
#define bFM4_MFT0_FRT_TCSC1_MSZC3              *((volatile unsigned char*)(0x42402AECUL))
#define bFM4_MFT0_FRT_TCSC1_MSPC0              *((volatile unsigned char*)(0x42402AF0UL))
#define bFM4_MFT0_FRT_TCSC1_MSPC1              *((volatile unsigned char*)(0x42402AF4UL))
#define bFM4_MFT0_FRT_TCSC1_MSPC2              *((volatile unsigned char*)(0x42402AF8UL))
#define bFM4_MFT0_FRT_TCSC1_MSPC3              *((volatile unsigned char*)(0x42402AFCUL))
#define bFM4_MFT0_FRT_TCSA2_CLK0               *((volatile unsigned char*)(0x42402C00UL))
#define bFM4_MFT0_FRT_TCSA2_CLK1               *((volatile unsigned char*)(0x42402C04UL))
#define bFM4_MFT0_FRT_TCSA2_CLK2               *((volatile unsigned char*)(0x42402C08UL))
#define bFM4_MFT0_FRT_TCSA2_CLK3               *((volatile unsigned char*)(0x42402C0CUL))
#define bFM4_MFT0_FRT_TCSA2_SCLR               *((volatile unsigned char*)(0x42402C10UL))
#define bFM4_MFT0_FRT_TCSA2_MODE               *((volatile unsigned char*)(0x42402C14UL))
#define bFM4_MFT0_FRT_TCSA2_STOP               *((volatile unsigned char*)(0x42402C18UL))
#define bFM4_MFT0_FRT_TCSA2_BFE                *((volatile unsigned char*)(0x42402C1CUL))
#define bFM4_MFT0_FRT_TCSA2_ICRE               *((volatile unsigned char*)(0x42402C20UL))
#define bFM4_MFT0_FRT_TCSA2_ICLR               *((volatile unsigned char*)(0x42402C24UL))
#define bFM4_MFT0_FRT_TCSA2_IRQZE              *((volatile unsigned char*)(0x42402C34UL))
#define bFM4_MFT0_FRT_TCSA2_IRQZF              *((volatile unsigned char*)(0x42402C38UL))
#define bFM4_MFT0_FRT_TCSA2_ECKE               *((volatile unsigned char*)(0x42402C3CUL))
#define bFM4_MFT0_FRT_TCSC2_MSZI0              *((volatile unsigned char*)(0x42402C40UL))
#define bFM4_MFT0_FRT_TCSC2_MSZI1              *((volatile unsigned char*)(0x42402C44UL))
#define bFM4_MFT0_FRT_TCSC2_MSZI2              *((volatile unsigned char*)(0x42402C48UL))
#define bFM4_MFT0_FRT_TCSC2_MSZI3              *((volatile unsigned char*)(0x42402C4CUL))
#define bFM4_MFT0_FRT_TCSC2_MSPI0              *((volatile unsigned char*)(0x42402C50UL))
#define bFM4_MFT0_FRT_TCSC2_MSPI1              *((volatile unsigned char*)(0x42402C54UL))
#define bFM4_MFT0_FRT_TCSC2_MSPI2              *((volatile unsigned char*)(0x42402C58UL))
#define bFM4_MFT0_FRT_TCSC2_MSPI3              *((volatile unsigned char*)(0x42402C5CUL))
#define bFM4_MFT0_FRT_TCSC2_MSZC0              *((volatile unsigned char*)(0x42402C60UL))
#define bFM4_MFT0_FRT_TCSC2_MSZC1              *((volatile unsigned char*)(0x42402C64UL))
#define bFM4_MFT0_FRT_TCSC2_MSZC2              *((volatile unsigned char*)(0x42402C68UL))
#define bFM4_MFT0_FRT_TCSC2_MSZC3              *((volatile unsigned char*)(0x42402C6CUL))
#define bFM4_MFT0_FRT_TCSC2_MSPC0              *((volatile unsigned char*)(0x42402C70UL))
#define bFM4_MFT0_FRT_TCSC2_MSPC1              *((volatile unsigned char*)(0x42402C74UL))
#define bFM4_MFT0_FRT_TCSC2_MSPC2              *((volatile unsigned char*)(0x42402C78UL))
#define bFM4_MFT0_FRT_TCSC2_MSPC3              *((volatile unsigned char*)(0x42402C7CUL))
#define bFM4_MFT0_FRT_TCAL_STOP00              *((volatile unsigned char*)(0x42402C80UL))
#define bFM4_MFT0_FRT_TCAL_STOP01              *((volatile unsigned char*)(0x42402C84UL))
#define bFM4_MFT0_FRT_TCAL_STOP02              *((volatile unsigned char*)(0x42402C88UL))
#define bFM4_MFT0_FRT_TCAL_STOP10              *((volatile unsigned char*)(0x42402C8CUL))
#define bFM4_MFT0_FRT_TCAL_STOP11              *((volatile unsigned char*)(0x42402C90UL))
#define bFM4_MFT0_FRT_TCAL_STOP12              *((volatile unsigned char*)(0x42402C94UL))
#define bFM4_MFT0_FRT_TCAL_STOP20              *((volatile unsigned char*)(0x42402C98UL))
#define bFM4_MFT0_FRT_TCAL_STOP21              *((volatile unsigned char*)(0x42402C9CUL))
#define bFM4_MFT0_FRT_TCAL_STOP22              *((volatile unsigned char*)(0x42402CA0UL))
#define bFM4_MFT0_FRT_TCAL_SCLR00              *((volatile unsigned char*)(0x42402CC0UL))
#define bFM4_MFT0_FRT_TCAL_SCLR01              *((volatile unsigned char*)(0x42402CC4UL))
#define bFM4_MFT0_FRT_TCAL_SCLR02              *((volatile unsigned char*)(0x42402CC8UL))
#define bFM4_MFT0_FRT_TCAL_SCLR10              *((volatile unsigned char*)(0x42402CCCUL))
#define bFM4_MFT0_FRT_TCAL_SCLR11              *((volatile unsigned char*)(0x42402CD0UL))
#define bFM4_MFT0_FRT_TCAL_SCLR12              *((volatile unsigned char*)(0x42402CD4UL))
#define bFM4_MFT0_FRT_TCAL_SCLR20              *((volatile unsigned char*)(0x42402CD8UL))
#define bFM4_MFT0_FRT_TCAL_SCLR21              *((volatile unsigned char*)(0x42402CDCUL))
#define bFM4_MFT0_FRT_TCAL_SCLR22              *((volatile unsigned char*)(0x42402CE0UL))
#define bFM4_MFT0_FRT_TCSD_OFMD1               *((volatile unsigned char*)(0x42403D80UL))
#define bFM4_MFT0_FRT_TCSD_OFMD2               *((volatile unsigned char*)(0x42403D84UL))

/* Multifunction Timer unit 0 Output Compare Unit registers */
#define bFM4_MFT0_OCU_OCSA10_CST0              *((volatile unsigned char*)(0x42402300UL))
#define bFM4_MFT0_OCU_OCSA10_CST1              *((volatile unsigned char*)(0x42402304UL))
#define bFM4_MFT0_OCU_OCSA10_IOE0              *((volatile unsigned char*)(0x42402310UL))
#define bFM4_MFT0_OCU_OCSA10_IOE1              *((volatile unsigned char*)(0x42402314UL))
#define bFM4_MFT0_OCU_OCSA10_IOP0              *((volatile unsigned char*)(0x42402318UL))
#define bFM4_MFT0_OCU_OCSA10_IOP1              *((volatile unsigned char*)(0x4240231CUL))
#define bFM4_MFT0_OCU_OCSB10_OTD0              *((volatile unsigned char*)(0x42402320UL))
#define bFM4_MFT0_OCU_OCSB10_OTD1              *((volatile unsigned char*)(0x42402324UL))
#define bFM4_MFT0_OCU_OCSB10_CMOD              *((volatile unsigned char*)(0x42402330UL))
#define bFM4_MFT0_OCU_OCSB10_FM4               *((volatile unsigned char*)(0x4240233CUL))
#define bFM4_MFT0_OCU_OCSD10_OCCP0BUFE0        *((volatile unsigned char*)(0x42402340UL))
#define bFM4_MFT0_OCU_OCSD10_OCCP0BUFE1        *((volatile unsigned char*)(0x42402344UL))
#define bFM4_MFT0_OCU_OCSD10_OCCP1BUFE0        *((volatile unsigned char*)(0x42402348UL))
#define bFM4_MFT0_OCU_OCSD10_OCCP1BUFE1        *((volatile unsigned char*)(0x4240234CUL))
#define bFM4_MFT0_OCU_OCSD10_OCSE0BUFE0        *((volatile unsigned char*)(0x42402350UL))
#define bFM4_MFT0_OCU_OCSD10_OCSE0BUFE1        *((volatile unsigned char*)(0x42402354UL))
#define bFM4_MFT0_OCU_OCSD10_OCSE1BUFE0        *((volatile unsigned char*)(0x42402358UL))
#define bFM4_MFT0_OCU_OCSD10_OCSE1BUFE1        *((volatile unsigned char*)(0x4240235CUL))
#define bFM4_MFT0_OCU_OCSD10_OPBM0             *((volatile unsigned char*)(0x42402360UL))
#define bFM4_MFT0_OCU_OCSD10_OPBM1             *((volatile unsigned char*)(0x42402364UL))
#define bFM4_MFT0_OCU_OCSD10_OEBM0             *((volatile unsigned char*)(0x42402368UL))
#define bFM4_MFT0_OCU_OCSD10_OEBM1             *((volatile unsigned char*)(0x4240236CUL))
#define bFM4_MFT0_OCU_OCSD10_OFEX0             *((volatile unsigned char*)(0x42402370UL))
#define bFM4_MFT0_OCU_OCSD10_OFEX1             *((volatile unsigned char*)(0x42402374UL))
#define bFM4_MFT0_OCU_OCSA32_CST0              *((volatile unsigned char*)(0x42402380UL))
#define bFM4_MFT0_OCU_OCSA32_CST1              *((volatile unsigned char*)(0x42402384UL))
#define bFM4_MFT0_OCU_OCSA32_IOE0              *((volatile unsigned char*)(0x42402390UL))
#define bFM4_MFT0_OCU_OCSA32_IOE1              *((volatile unsigned char*)(0x42402394UL))
#define bFM4_MFT0_OCU_OCSA32_IOP0              *((volatile unsigned char*)(0x42402398UL))
#define bFM4_MFT0_OCU_OCSA32_IOP1              *((volatile unsigned char*)(0x4240239CUL))
#define bFM4_MFT0_OCU_OCSB32_OTD0              *((volatile unsigned char*)(0x424023A0UL))
#define bFM4_MFT0_OCU_OCSB32_OTD1              *((volatile unsigned char*)(0x424023A4UL))
#define bFM4_MFT0_OCU_OCSB32_CMOD              *((volatile unsigned char*)(0x424023B0UL))
#define bFM4_MFT0_OCU_OCSB32_FM4               *((volatile unsigned char*)(0x424023BCUL))
#define bFM4_MFT0_OCU_OCSD32_OCCP2BUFE0        *((volatile unsigned char*)(0x424023C0UL))
#define bFM4_MFT0_OCU_OCSD32_OCCP2BUFE1        *((volatile unsigned char*)(0x424023C4UL))
#define bFM4_MFT0_OCU_OCSD32_OCCP3BUFE0        *((volatile unsigned char*)(0x424023C8UL))
#define bFM4_MFT0_OCU_OCSD32_OCCP3BUFE1        *((volatile unsigned char*)(0x424023CCUL))
#define bFM4_MFT0_OCU_OCSD32_OCSE2BUFE0        *((volatile unsigned char*)(0x424023D0UL))
#define bFM4_MFT0_OCU_OCSD32_OCSE2BUFE1        *((volatile unsigned char*)(0x424023D4UL))
#define bFM4_MFT0_OCU_OCSD32_OCSE3BUFE0        *((volatile unsigned char*)(0x424023D8UL))
#define bFM4_MFT0_OCU_OCSD32_OCSE3BUFE1        *((volatile unsigned char*)(0x424023DCUL))
#define bFM4_MFT0_OCU_OCSD32_OPBM2             *((volatile unsigned char*)(0x424023E0UL))
#define bFM4_MFT0_OCU_OCSD32_OPBM3             *((volatile unsigned char*)(0x424023E4UL))
#define bFM4_MFT0_OCU_OCSD32_OEBM2             *((volatile unsigned char*)(0x424023E8UL))
#define bFM4_MFT0_OCU_OCSD32_OEBM3             *((volatile unsigned char*)(0x424023ECUL))
#define bFM4_MFT0_OCU_OCSD32_OFEX2             *((volatile unsigned char*)(0x424023F0UL))
#define bFM4_MFT0_OCU_OCSD32_OFEX3             *((volatile unsigned char*)(0x424023F4UL))
#define bFM4_MFT0_OCU_OCSA54_CST0              *((volatile unsigned char*)(0x42402400UL))
#define bFM4_MFT0_OCU_OCSA54_CST1              *((volatile unsigned char*)(0x42402404UL))
#define bFM4_MFT0_OCU_OCSA54_IOE0              *((volatile unsigned char*)(0x42402410UL))
#define bFM4_MFT0_OCU_OCSA54_IOE1              *((volatile unsigned char*)(0x42402414UL))
#define bFM4_MFT0_OCU_OCSA54_IOP0              *((volatile unsigned char*)(0x42402418UL))
#define bFM4_MFT0_OCU_OCSA54_IOP1              *((volatile unsigned char*)(0x4240241CUL))
#define bFM4_MFT0_OCU_OCSB54_OTD0              *((volatile unsigned char*)(0x42402420UL))
#define bFM4_MFT0_OCU_OCSB54_OTD1              *((volatile unsigned char*)(0x42402424UL))
#define bFM4_MFT0_OCU_OCSB54_CMOD              *((volatile unsigned char*)(0x42402430UL))
#define bFM4_MFT0_OCU_OCSB54_FM4               *((volatile unsigned char*)(0x4240243CUL))
#define bFM4_MFT0_OCU_OCSD54_OCCP4BUFE0        *((volatile unsigned char*)(0x42402440UL))
#define bFM4_MFT0_OCU_OCSD54_OCCP4BUFE1        *((volatile unsigned char*)(0x42402444UL))
#define bFM4_MFT0_OCU_OCSD54_OCCP5BUFE0        *((volatile unsigned char*)(0x42402448UL))
#define bFM4_MFT0_OCU_OCSD54_OCCP5BUFE1        *((volatile unsigned char*)(0x4240244CUL))
#define bFM4_MFT0_OCU_OCSD54_OCSE4BUFE0        *((volatile unsigned char*)(0x42402450UL))
#define bFM4_MFT0_OCU_OCSD54_OCSE4BUFE1        *((volatile unsigned char*)(0x42402454UL))
#define bFM4_MFT0_OCU_OCSD54_OCSE5BUFE0        *((volatile unsigned char*)(0x42402458UL))
#define bFM4_MFT0_OCU_OCSD54_OCSE5BUFE1        *((volatile unsigned char*)(0x4240245CUL))
#define bFM4_MFT0_OCU_OCSD54_OPBM4             *((volatile unsigned char*)(0x42402460UL))
#define bFM4_MFT0_OCU_OCSD54_OPBM5             *((volatile unsigned char*)(0x42402464UL))
#define bFM4_MFT0_OCU_OCSD54_OEBM4             *((volatile unsigned char*)(0x42402468UL))
#define bFM4_MFT0_OCU_OCSD54_OEBM5             *((volatile unsigned char*)(0x4240246CUL))
#define bFM4_MFT0_OCU_OCSD54_OFEX4             *((volatile unsigned char*)(0x42402470UL))
#define bFM4_MFT0_OCU_OCSD54_OFEX5             *((volatile unsigned char*)(0x42402474UL))
#define bFM4_MFT0_OCU_OCSC_MOD0                *((volatile unsigned char*)(0x424024A0UL))
#define bFM4_MFT0_OCU_OCSC_MOD1                *((volatile unsigned char*)(0x424024A4UL))
#define bFM4_MFT0_OCU_OCSC_MOD2                *((volatile unsigned char*)(0x424024A8UL))
#define bFM4_MFT0_OCU_OCSC_MOD3                *((volatile unsigned char*)(0x424024ACUL))
#define bFM4_MFT0_OCU_OCSC_MOD4                *((volatile unsigned char*)(0x424024B0UL))
#define bFM4_MFT0_OCU_OCSC_MOD5                *((volatile unsigned char*)(0x424024B4UL))
#define bFM4_MFT0_OCU_OCFS10_FSO00             *((volatile unsigned char*)(0x42402D00UL))
#define bFM4_MFT0_OCU_OCFS10_FSO01             *((volatile unsigned char*)(0x42402D04UL))
#define bFM4_MFT0_OCU_OCFS10_FSO02             *((volatile unsigned char*)(0x42402D08UL))
#define bFM4_MFT0_OCU_OCFS10_FSO03             *((volatile unsigned char*)(0x42402D0CUL))
#define bFM4_MFT0_OCU_OCFS10_FSO10             *((volatile unsigned char*)(0x42402D10UL))
#define bFM4_MFT0_OCU_OCFS10_FSO11             *((volatile unsigned char*)(0x42402D14UL))
#define bFM4_MFT0_OCU_OCFS10_FSO12             *((volatile unsigned char*)(0x42402D18UL))
#define bFM4_MFT0_OCU_OCFS10_FSO13             *((volatile unsigned char*)(0x42402D1CUL))
#define bFM4_MFT0_OCU_OCFS32_FSO00             *((volatile unsigned char*)(0x42402D20UL))
#define bFM4_MFT0_OCU_OCFS32_FSO01             *((volatile unsigned char*)(0x42402D24UL))
#define bFM4_MFT0_OCU_OCFS32_FSO02             *((volatile unsigned char*)(0x42402D28UL))
#define bFM4_MFT0_OCU_OCFS32_FSO03             *((volatile unsigned char*)(0x42402D2CUL))
#define bFM4_MFT0_OCU_OCFS32_FSO10             *((volatile unsigned char*)(0x42402D30UL))
#define bFM4_MFT0_OCU_OCFS32_FSO11             *((volatile unsigned char*)(0x42402D34UL))
#define bFM4_MFT0_OCU_OCFS32_FSO12             *((volatile unsigned char*)(0x42402D38UL))
#define bFM4_MFT0_OCU_OCFS32_FSO13             *((volatile unsigned char*)(0x42402D3CUL))
#define bFM4_MFT0_OCU_OCFS54_FSO00             *((volatile unsigned char*)(0x42402D40UL))
#define bFM4_MFT0_OCU_OCFS54_FSO01             *((volatile unsigned char*)(0x42402D44UL))
#define bFM4_MFT0_OCU_OCFS54_FSO02             *((volatile unsigned char*)(0x42402D48UL))
#define bFM4_MFT0_OCU_OCFS54_FSO03             *((volatile unsigned char*)(0x42402D4CUL))
#define bFM4_MFT0_OCU_OCFS54_FSO10             *((volatile unsigned char*)(0x42402D50UL))
#define bFM4_MFT0_OCU_OCFS54_FSO11             *((volatile unsigned char*)(0x42402D54UL))
#define bFM4_MFT0_OCU_OCFS54_FSO12             *((volatile unsigned char*)(0x42402D58UL))
#define bFM4_MFT0_OCU_OCFS54_FSO13             *((volatile unsigned char*)(0x42402D5CUL))

