MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
/* Multifunction Timer unit 1 Input Capture Unit registers */
#define bFM4_MFT1_ICU_ICFS10_FSI00             *((volatile unsigned char*)(0x42422D80UL))
#define bFM4_MFT1_ICU_ICFS10_FSI01             *((volatile unsigned char*)(0x42422D84UL))
#define bFM4_MFT1_ICU_ICFS10_FSI02             *((volatile unsigned char*)(0x42422D88UL))
#define bFM4_MFT1_ICU_ICFS10_FSI03             *((volatile unsigned char*)(0x42422D8CUL))
#define bFM4_MFT1_ICU_ICFS10_FSI10             *((volatile unsigned char*)(0x42422D90UL))
#define bFM4_MFT1_ICU_ICFS10_FSI11             *((volatile unsigned char*)(0x42422D94UL))
#define bFM4_MFT1_ICU_ICFS10_FSI12             *((volatile unsigned char*)(0x42422D98UL))
#define bFM4_MFT1_ICU_ICFS10_FSI13             *((volatile unsigned char*)(0x42422D9CUL))
#define bFM4_MFT1_ICU_ICFS32_FSI00             *((volatile unsigned char*)(0x42422DA0UL))
#define bFM4_MFT1_ICU_ICFS32_FSI01             *((volatile unsigned char*)(0x42422DA4UL))
#define bFM4_MFT1_ICU_ICFS32_FSI02             *((volatile unsigned char*)(0x42422DA8UL))
#define bFM4_MFT1_ICU_ICFS32_FSI03             *((volatile unsigned char*)(0x42422DACUL))
#define bFM4_MFT1_ICU_ICFS32_FSI10             *((volatile unsigned char*)(0x42422DB0UL))
#define bFM4_MFT1_ICU_ICFS32_FSI11             *((volatile unsigned char*)(0x42422DB4UL))
#define bFM4_MFT1_ICU_ICFS32_FSI12             *((volatile unsigned char*)(0x42422DB8UL))
#define bFM4_MFT1_ICU_ICFS32_FSI13             *((volatile unsigned char*)(0x42422DBCUL))
#define bFM4_MFT1_ICU_ICSA10_EG00              *((volatile unsigned char*)(0x42423080UL))
#define bFM4_MFT1_ICU_ICSA10_EG01              *((volatile unsigned char*)(0x42423084UL))
#define bFM4_MFT1_ICU_ICSA10_EG10              *((volatile unsigned char*)(0x42423088UL))
#define bFM4_MFT1_ICU_ICSA10_EG11              *((volatile unsigned char*)(0x4242308CUL))
#define bFM4_MFT1_ICU_ICSA10_ICE0              *((volatile unsigned char*)(0x42423090UL))
#define bFM4_MFT1_ICU_ICSA10_ICE1              *((volatile unsigned char*)(0x42423094UL))
#define bFM4_MFT1_ICU_ICSA10_ICP0              *((volatile unsigned char*)(0x42423098UL))
#define bFM4_MFT1_ICU_ICSA10_ICP1              *((volatile unsigned char*)(0x4242309CUL))
#define bFM4_MFT1_ICU_ICSB10_IEI0              *((volatile unsigned char*)(0x424230A0UL))
#define bFM4_MFT1_ICU_ICSB10_IEI1              *((volatile unsigned char*)(0x424230A4UL))
#define bFM4_MFT1_ICU_ICSA32_EG00              *((volatile unsigned char*)(0x42423100UL))
#define bFM4_MFT1_ICU_ICSA32_EG01              *((volatile unsigned char*)(0x42423104UL))
#define bFM4_MFT1_ICU_ICSA32_EG10              *((volatile unsigned char*)(0x42423108UL))
#define bFM4_MFT1_ICU_ICSA32_EG11              *((volatile unsigned char*)(0x4242310CUL))
#define bFM4_MFT1_ICU_ICSA32_ICE0              *((volatile unsigned char*)(0x42423110UL))
#define bFM4_MFT1_ICU_ICSA32_ICE1              *((volatile unsigned char*)(0x42423114UL))
#define bFM4_MFT1_ICU_ICSA32_ICP0              *((volatile unsigned char*)(0x42423118UL))
#define bFM4_MFT1_ICU_ICSA32_ICP1              *((volatile unsigned char*)(0x4242311CUL))
#define bFM4_MFT1_ICU_ICSB32_IEI0              *((volatile unsigned char*)(0x42423120UL))
#define bFM4_MFT1_ICU_ICSB32_IEI1              *((volatile unsigned char*)(0x42423124UL))

/* Multifunction Timer unit 1 ADC Start Compare Unit registers */
#define bFM4_MFT1_ADCMP_ACSC0_BUFE0            *((volatile unsigned char*)(0x42423A80UL))
#define bFM4_MFT1_ADCMP_ACSC0_BUFE1            *((volatile unsigned char*)(0x42423A84UL))
#define bFM4_MFT1_ADCMP_ACSC0_ADSEL0           *((volatile unsigned char*)(0x42423A88UL))
#define bFM4_MFT1_ADCMP_ACSC0_ADSEL1           *((volatile unsigned char*)(0x42423A8CUL))
#define bFM4_MFT1_ADCMP_ACSC0_ADSEL2           *((volatile unsigned char*)(0x42423A90UL))
#define bFM4_MFT1_ADCMP_ACSC0_APBM             *((volatile unsigned char*)(0x42423A94UL))
#define bFM4_MFT1_ADCMP_ACSD0_AMOD             *((volatile unsigned char*)(0x42423AA0UL))
#define bFM4_MFT1_ADCMP_ACSD0_OCUS             *((volatile unsigned char*)(0x42423AA4UL))
#define bFM4_MFT1_ADCMP_ACSD0_DE               *((volatile unsigned char*)(0x42423AB0UL))
#define bFM4_MFT1_ADCMP_ACSD0_PE               *((volatile unsigned char*)(0x42423AB4UL))
#define bFM4_MFT1_ADCMP_ACSD0_UE               *((volatile unsigned char*)(0x42423AB8UL))
#define bFM4_MFT1_ADCMP_ACSD0_ZE               *((volatile unsigned char*)(0x42423ABCUL))
#define bFM4_MFT1_ADCMP_ACMC0_AMC0             *((volatile unsigned char*)(0x42423AC0UL))
#define bFM4_MFT1_ADCMP_ACMC0_AMC1             *((volatile unsigned char*)(0x42423AC4UL))
#define bFM4_MFT1_ADCMP_ACMC0_AMC2             *((volatile unsigned char*)(0x42423AC8UL))
#define bFM4_MFT1_ADCMP_ACMC0_AMC3             *((volatile unsigned char*)(0x42423ACCUL))
#define bFM4_MFT1_ADCMP_ACMC0_MZCE             *((volatile unsigned char*)(0x42423AD8UL))
#define bFM4_MFT1_ADCMP_ACMC0_MPCE             *((volatile unsigned char*)(0x42423ADCUL))
#define bFM4_MFT1_ADCMP_ACSC1_BUFE0            *((volatile unsigned char*)(0x42423B00UL))
#define bFM4_MFT1_ADCMP_ACSC1_BUFE1            *((volatile unsigned char*)(0x42423B04UL))
#define bFM4_MFT1_ADCMP_ACSC1_ADSEL0           *((volatile unsigned char*)(0x42423B08UL))
#define bFM4_MFT1_ADCMP_ACSC1_ADSEL1           *((volatile unsigned char*)(0x42423B0CUL))
#define bFM4_MFT1_ADCMP_ACSC1_ADSEL2           *((volatile unsigned char*)(0x42423B10UL))
#define bFM4_MFT1_ADCMP_ACSC1_APBM             *((volatile unsigned char*)(0x42423B14UL))
#define bFM4_MFT1_ADCMP_ACSD1_AMOD             *((volatile unsigned char*)(0x42423B20UL))
#define bFM4_MFT1_ADCMP_ACSD1_OCUS             *((volatile unsigned char*)(0x42423B24UL))
#define bFM4_MFT1_ADCMP_ACSD1_DE               *((volatile unsigned char*)(0x42423B30UL))
#define bFM4_MFT1_ADCMP_ACSD1_PE               *((volatile unsigned char*)(0x42423B34UL))
#define bFM4_MFT1_ADCMP_ACSD1_UE               *((volatile unsigned char*)(0x42423B38UL))
#define bFM4_MFT1_ADCMP_ACSD1_ZE               *((volatile unsigned char*)(0x42423B3CUL))
#define bFM4_MFT1_ADCMP_ACMC1_AMC0             *((volatile unsigned char*)(0x42423B40UL))
#define bFM4_MFT1_ADCMP_ACMC1_AMC1             *((volatile unsigned char*)(0x42423B44UL))
#define bFM4_MFT1_ADCMP_ACMC1_AMC2             *((volatile unsigned char*)(0x42423B48UL))
#define bFM4_MFT1_ADCMP_ACMC1_AMC3             *((volatile unsigned char*)(0x42423B4CUL))
#define bFM4_MFT1_ADCMP_ACMC1_MZCE             *((volatile unsigned char*)(0x42423B58UL))
#define bFM4_MFT1_ADCMP_ACMC1_MPCE             *((volatile unsigned char*)(0x42423B5CUL))
#define bFM4_MFT1_ADCMP_ACSC2_BUFE0            *((volatile unsigned char*)(0x42423B80UL))
#define bFM4_MFT1_ADCMP_ACSC2_BUFE1            *((volatile unsigned char*)(0x42423B84UL))
#define bFM4_MFT1_ADCMP_ACSC2_ADSEL0           *((volatile unsigned char*)(0x42423B88UL))
#define bFM4_MFT1_ADCMP_ACSC2_ADSEL1           *((volatile unsigned char*)(0x42423B8CUL))
#define bFM4_MFT1_ADCMP_ACSC2_ADSEL2           *((volatile unsigned char*)(0x42423B90UL))
#define bFM4_MFT1_ADCMP_ACSC2_APBM             *((volatile unsigned char*)(0x42423B94UL))
#define bFM4_MFT1_ADCMP_ACSD2_AMOD             *((volatile unsigned char*)(0x42423BA0UL))
#define bFM4_MFT1_ADCMP_ACSD2_OCUS             *((volatile unsigned char*)(0x42423BA4UL))
#define bFM4_MFT1_ADCMP_ACSD2_DE               *((volatile unsigned char*)(0x42423BB0UL))
#define bFM4_MFT1_ADCMP_ACSD2_PE               *((volatile unsigned char*)(0x42423BB4UL))
#define bFM4_MFT1_ADCMP_ACSD2_UE               *((volatile unsigned char*)(0x42423BB8UL))
#define bFM4_MFT1_ADCMP_ACSD2_ZE               *((volatile unsigned char*)(0x42423BBCUL))
#define bFM4_MFT1_ADCMP_ACMC2_AMC0             *((volatile unsigned char*)(0x42423BC0UL))
#define bFM4_MFT1_ADCMP_ACMC2_AMC1             *((volatile unsigned char*)(0x42423BC4UL))
#define bFM4_MFT1_ADCMP_ACMC2_AMC2             *((volatile unsigned char*)(0x42423BC8UL))
#define bFM4_MFT1_ADCMP_ACMC2_AMC3             *((volatile unsigned char*)(0x42423BCCUL))
#define bFM4_MFT1_ADCMP_ACMC2_MZCE             *((volatile unsigned char*)(0x42423BD8UL))
#define bFM4_MFT1_ADCMP_ACMC2_MPCE             *((volatile unsigned char*)(0x42423BDCUL))
#define bFM4_MFT1_ADCMP_ACSC3_BUFE0            *((volatile unsigned char*)(0x42423C00UL))
#define bFM4_MFT1_ADCMP_ACSC3_BUFE1            *((volatile unsigned char*)(0x42423C04UL))
#define bFM4_MFT1_ADCMP_ACSC3_ADSEL0           *((volatile unsigned char*)(0x42423C08UL))
#define bFM4_MFT1_ADCMP_ACSC3_ADSEL1           *((volatile unsigned char*)(0x42423C0CUL))
#define bFM4_MFT1_ADCMP_ACSC3_ADSEL2           *((volatile unsigned char*)(0x42423C10UL))
#define bFM4_MFT1_ADCMP_ACSC3_APBM             *((volatile unsigned char*)(0x42423C14UL))
#define bFM4_MFT1_ADCMP_ACSD3_AMOD             *((volatile unsigned char*)(0x42423C20UL))
#define bFM4_MFT1_ADCMP_ACSD3_OCUS             *((volatile unsigned char*)(0x42423C24UL))
#define bFM4_MFT1_ADCMP_ACSD3_DE               *((volatile unsigned char*)(0x42423C30UL))
#define bFM4_MFT1_ADCMP_ACSD3_PE               *((volatile unsigned char*)(0x42423C34UL))
#define bFM4_MFT1_ADCMP_ACSD3_UE               *((volatile unsigned char*)(0x42423C38UL))
#define bFM4_MFT1_ADCMP_ACSD3_ZE               *((volatile unsigned char*)(0x42423C3CUL))
#define bFM4_MFT1_ADCMP_ACMC3_AMC0             *((volatile unsigned char*)(0x42423C40UL))
#define bFM4_MFT1_ADCMP_ACMC3_AMC1             *((volatile unsigned char*)(0x42423C44UL))
#define bFM4_MFT1_ADCMP_ACMC3_AMC2             *((volatile unsigned char*)(0x42423C48UL))
#define bFM4_MFT1_ADCMP_ACMC3_AMC3             *((volatile unsigned char*)(0x42423C4CUL))
#define bFM4_MFT1_ADCMP_ACMC3_MZCE             *((volatile unsigned char*)(0x42423C58UL))
#define bFM4_MFT1_ADCMP_ACMC3_MPCE             *((volatile unsigned char*)(0x42423C5CUL))
#define bFM4_MFT1_ADCMP_ACSC4_BUFE0            *((volatile unsigned char*)(0x42423C80UL))
#define bFM4_MFT1_ADCMP_ACSC4_BUFE1            *((volatile unsigned char*)(0x42423C84UL))
#define bFM4_MFT1_ADCMP_ACSC4_ADSEL0           *((volatile unsigned char*)(0x42423C88UL))
#define bFM4_MFT1_ADCMP_ACSC4_ADSEL1           *((volatile unsigned char*)(0x42423C8CUL))
#define bFM4_MFT1_ADCMP_ACSC4_ADSEL2           *((volatile unsigned char*)(0x42423C90UL))
#define bFM4_MFT1_ADCMP_ACSC4_APBM             *((volatile unsigned char*)(0x42423C94UL))
#define bFM4_MFT1_ADCMP_ACSD4_AMOD             *((volatile unsigned char*)(0x42423CA0UL))
#define bFM4_MFT1_ADCMP_ACSD4_OCUS             *((volatile unsigned char*)(0x42423CA4UL))
#define bFM4_MFT1_ADCMP_ACSD4_DE               *((volatile unsigned char*)(0x42423CB0UL))
#define bFM4_MFT1_ADCMP_ACSD4_PE               *((volatile unsigned char*)(0x42423CB4UL))
#define bFM4_MFT1_ADCMP_ACSD4_UE               *((volatile unsigned char*)(0x42423CB8UL))
#define bFM4_MFT1_ADCMP_ACSD4_ZE               *((volatile unsigned char*)(0x42423CBCUL))
#define bFM4_MFT1_ADCMP_ACMC4_AMC0             *((volatile unsigned char*)(0x42423CC0UL))
#define bFM4_MFT1_ADCMP_ACMC4_AMC1             *((volatile unsigned char*)(0x42423CC4UL))
#define bFM4_MFT1_ADCMP_ACMC4_AMC2             *((volatile unsigned char*)(0x42423CC8UL))
#define bFM4_MFT1_ADCMP_ACMC4_AMC3             *((volatile unsigned char*)(0x42423CCCUL))
#define bFM4_MFT1_ADCMP_ACMC4_MZCE             *((volatile unsigned char*)(0x42423CD8UL))
#define bFM4_MFT1_ADCMP_ACMC4_MPCE             *((volatile unsigned char*)(0x42423CDCUL))
#define bFM4_MFT1_ADCMP_ACSC5_BUFE0            *((volatile unsigned char*)(0x42423D00UL))
#define bFM4_MFT1_ADCMP_ACSC5_BUFE1            *((volatile unsigned char*)(0x42423D04UL))
#define bFM4_MFT1_ADCMP_ACSC5_ADSEL0           *((volatile unsigned char*)(0x42423D08UL))
#define bFM4_MFT1_ADCMP_ACSC5_ADSEL1           *((volatile unsigned char*)(0x42423D0CUL))
#define bFM4_MFT1_ADCMP_ACSC5_ADSEL2           *((volatile unsigned char*)(0x42423D10UL))
#define bFM4_MFT1_ADCMP_ACSC5_APBM             *((volatile unsigned char*)(0x42423D14UL))
#define bFM4_MFT1_ADCMP_ACSD5_AMOD             *((volatile unsigned char*)(0x42423D20UL))
#define bFM4_MFT1_ADCMP_ACSD5_OCUS             *((volatile unsigned char*)(0x42423D24UL))
#define bFM4_MFT1_ADCMP_ACSD5_DE               *((volatile unsigned char*)(0x42423D30UL))
#define bFM4_MFT1_ADCMP_ACSD5_PE               *((volatile unsigned char*)(0x42423D34UL))
#define bFM4_MFT1_ADCMP_ACSD5_UE               *((volatile unsigned char*)(0x42423D38UL))
#define bFM4_MFT1_ADCMP_ACSD5_ZE               *((volatile unsigned char*)(0x42423D3CUL))
#define bFM4_MFT1_ADCMP_ACMC5_AMC0             *((volatile unsigned char*)(0x42423D40UL))
#define bFM4_MFT1_ADCMP_ACMC5_AMC1             *((volatile unsigned char*)(0x42423D44UL))
#define bFM4_MFT1_ADCMP_ACMC5_AMC2             *((volatile unsigned char*)(0x42423D48UL))
#define bFM4_MFT1_ADCMP_ACMC5_AMC3             *((volatile unsigned char*)(0x42423D4CUL))
#define bFM4_MFT1_ADCMP_ACMC5_MZCE             *((volatile unsigned char*)(0x42423D58UL))
#define bFM4_MFT1_ADCMP_ACMC5_MPCE             *((volatile unsigned char*)(0x42423D5CUL))

/* Multifunction Timer unit 2 Free Running Timer registers */
#define bFM4_MFT2_FRT_TCSA0_CLK0               *((volatile unsigned char*)(0x42442900UL))
#define bFM4_MFT2_FRT_TCSA0_CLK1               *((volatile unsigned char*)(0x42442904UL))
#define bFM4_MFT2_FRT_TCSA0_CLK2               *((volatile unsigned char*)(0x42442908UL))
#define bFM4_MFT2_FRT_TCSA0_CLK3               *((volatile unsigned char*)(0x4244290CUL))
#define bFM4_MFT2_FRT_TCSA0_SCLR               *((volatile unsigned char*)(0x42442910UL))
#define bFM4_MFT2_FRT_TCSA0_MODE               *((volatile unsigned char*)(0x42442914UL))
#define bFM4_MFT2_FRT_TCSA0_STOP               *((volatile unsigned char*)(0x42442918UL))
#define bFM4_MFT2_FRT_TCSA0_BFE                *((volatile unsigned char*)(0x4244291CUL))
#define bFM4_MFT2_FRT_TCSA0_ICRE               *((volatile unsigned char*)(0x42442920UL))
#define bFM4_MFT2_FRT_TCSA0_ICLR               *((volatile unsigned char*)(0x42442924UL))
#define bFM4_MFT2_FRT_TCSA0_IRQZE              *((volatile unsigned char*)(0x42442934UL))
#define bFM4_MFT2_FRT_TCSA0_IRQZF              *((volatile unsigned char*)(0x42442938UL))
#define bFM4_MFT2_FRT_TCSA0_ECKE               *((volatile unsigned char*)(0x4244293CUL))
#define bFM4_MFT2_FRT_TCSC0_MSZI0              *((volatile unsigned char*)(0x42442940UL))
#define bFM4_MFT2_FRT_TCSC0_MSZI1              *((volatile unsigned char*)(0x42442944UL))
#define bFM4_MFT2_FRT_TCSC0_MSZI2              *((volatile unsigned char*)(0x42442948UL))
#define bFM4_MFT2_FRT_TCSC0_MSZI3              *((volatile unsigned char*)(0x4244294CUL))
#define bFM4_MFT2_FRT_TCSC0_MSPI0              *((volatile unsigned char*)(0x42442950UL))
#define bFM4_MFT2_FRT_TCSC0_MSPI1              *((volatile unsigned char*)(0x42442954UL))
#define bFM4_MFT2_FRT_TCSC0_MSPI2              *((volatile unsigned char*)(0x42442958UL))
#define bFM4_MFT2_FRT_TCSC0_MSPI3              *((volatile unsigned char*)(0x4244295CUL))
#define bFM4_MFT2_FRT_TCSC0_MSZC0              *((volatile unsigned char*)(0x42442960UL))
#define bFM4_MFT2_FRT_TCSC0_MSZC1              *((volatile unsigned char*)(0x42442964UL))
#define bFM4_MFT2_FRT_TCSC0_MSZC2              *((volatile unsigned char*)(0x42442968UL))
#define bFM4_MFT2_FRT_TCSC0_MSZC3              *((volatile unsigned char*)(0x4244296CUL))
#define bFM4_MFT2_FRT_TCSC0_MSPC0              *((volatile unsigned char*)(0x42442970UL))
#define bFM4_MFT2_FRT_TCSC0_MSPC1              *((volatile unsigned char*)(0x42442974UL))
#define bFM4_MFT2_FRT_TCSC0_MSPC2              *((volatile unsigned char*)(0x42442978UL))
#define bFM4_MFT2_FRT_TCSC0_MSPC3              *((volatile unsigned char*)(0x4244297CUL))
#define bFM4_MFT2_FRT_TCSA1_CLK0               *((volatile unsigned char*)(0x42442A80UL))
#define bFM4_MFT2_FRT_TCSA1_CLK1               *((volatile unsigned char*)(0x42442A84UL))
#define bFM4_MFT2_FRT_TCSA1_CLK2               *((volatile unsigned char*)(0x42442A88UL))
#define bFM4_MFT2_FRT_TCSA1_CLK3               *((volatile unsigned char*)(0x42442A8CUL))
#define bFM4_MFT2_FRT_TCSA1_SCLR               *((volatile unsigned char*)(0x42442A90UL))
#define bFM4_MFT2_FRT_TCSA1_MODE               *((volatile unsigned char*)(0x42442A94UL))
#define bFM4_MFT2_FRT_TCSA1_STOP               *((volatile unsigned char*)(0x42442A98UL))
#define bFM4_MFT2_FRT_TCSA1_BFE                *((volatile unsigned char*)(0x42442A9CUL))
#define bFM4_MFT2_FRT_TCSA1_ICRE               *((volatile unsigned char*)(0x42442AA0UL))
#define bFM4_MFT2_FRT_TCSA1_ICLR               *((volatile unsigned char*)(0x42442AA4UL))
#define bFM4_MFT2_FRT_TCSA1_IRQZE              *((volatile unsigned char*)(0x42442AB4UL))
#define bFM4_MFT2_FRT_TCSA1_IRQZF              *((volatile unsigned char*)(0x42442AB8UL))
#define bFM4_MFT2_FRT_TCSA1_ECKE               *((volatile unsigned char*)(0x42442ABCUL))
#define bFM4_MFT2_FRT_TCSC1_MSZI0              *((volatile unsigned char*)(0x42442AC0UL))
#define bFM4_MFT2_FRT_TCSC1_MSZI1              *((volatile unsigned char*)(0x42442AC4UL))
#define bFM4_MFT2_FRT_TCSC1_MSZI2              *((volatile unsigned char*)(0x42442AC8UL))
#define bFM4_MFT2_FRT_TCSC1_MSZI3              *((volatile unsigned char*)(0x42442ACCUL))
#define bFM4_MFT2_FRT_TCSC1_MSPI0              *((volatile unsigned char*)(0x42442AD0UL))
#define bFM4_MFT2_FRT_TCSC1_MSPI1              *((volatile unsigned char*)(0x42442AD4UL))
#define bFM4_MFT2_FRT_TCSC1_MSPI2              *((volatile unsigned char*)(0x42442AD8UL))
#define bFM4_MFT2_FRT_TCSC1_MSPI3              *((volatile unsigned char*)(0x42442ADCUL))
#define bFM4_MFT2_FRT_TCSC1_MSZC0              *((volatile unsigned char*)(0x42442AE0UL))
#define bFM4_MFT2_FRT_TCSC1_MSZC1              *((volatile unsigned char*)(0x42442AE4UL))
#define bFM4_MFT2_FRT_TCSC1_MSZC2              *((volatile unsigned char*)(0x42442AE8UL))
#define bFM4_MFT2_FRT_TCSC1_MSZC3              *((volatile unsigned char*)(0x42442AECUL))
#define bFM4_MFT2_FRT_TCSC1_MSPC0              *((volatile unsigned char*)(0x42442AF0UL))
#define bFM4_MFT2_FRT_TCSC1_MSPC1              *((volatile unsigned char*)(0x42442AF4UL))
#define bFM4_MFT2_FRT_TCSC1_MSPC2              *((volatile unsigned char*)(0x42442AF8UL))
#define bFM4_MFT2_FRT_TCSC1_MSPC3              *((volatile unsigned char*)(0x42442AFCUL))
#define bFM4_MFT2_FRT_TCSA2_CLK0               *((volatile unsigned char*)(0x42442C00UL))
#define bFM4_MFT2_FRT_TCSA2_CLK1               *((volatile unsigned char*)(0x42442C04UL))
#define bFM4_MFT2_FRT_TCSA2_CLK2               *((volatile unsigned char*)(0x42442C08UL))
#define bFM4_MFT2_FRT_TCSA2_CLK3               *((volatile unsigned char*)(0x42442C0CUL))
#define bFM4_MFT2_FRT_TCSA2_SCLR               *((volatile unsigned char*)(0x42442C10UL))
#define bFM4_MFT2_FRT_TCSA2_MODE               *((volatile unsigned char*)(0x42442C14UL))
#define bFM4_MFT2_FRT_TCSA2_STOP               *((volatile unsigned char*)(0x42442C18UL))
#define bFM4_MFT2_FRT_TCSA2_BFE                *((volatile unsigned char*)(0x42442C1CUL))
#define bFM4_MFT2_FRT_TCSA2_ICRE               *((volatile unsigned char*)(0x42442C20UL))
#define bFM4_MFT2_FRT_TCSA2_ICLR               *((volatile unsigned char*)(0x42442C24UL))
#define bFM4_MFT2_FRT_TCSA2_IRQZE              *((volatile unsigned char*)(0x42442C34UL))
#define bFM4_MFT2_FRT_TCSA2_IRQZF              *((volatile unsigned char*)(0x42442C38UL))
#define bFM4_MFT2_FRT_TCSA2_ECKE               *((volatile unsigned char*)(0x42442C3CUL))
#define bFM4_MFT2_FRT_TCSC2_MSZI0              *((volatile unsigned char*)(0x42442C40UL))
#define bFM4_MFT2_FRT_TCSC2_MSZI1              *((volatile unsigned char*)(0x42442C44UL))
#define bFM4_MFT2_FRT_TCSC2_MSZI2              *((volatile unsigned char*)(0x42442C48UL))
#define bFM4_MFT2_FRT_TCSC2_MSZI3              *((volatile unsigned char*)(0x42442C4CUL))
#define bFM4_MFT2_FRT_TCSC2_MSPI0              *((volatile unsigned char*)(0x42442C50UL))
#define bFM4_MFT2_FRT_TCSC2_MSPI1              *((volatile unsigned char*)(0x42442C54UL))
#define bFM4_MFT2_FRT_TCSC2_MSPI2              *((volatile unsigned char*)(0x42442C58UL))
#define bFM4_MFT2_FRT_TCSC2_MSPI3              *((volatile unsigned char*)(0x42442C5CUL))
#define bFM4_MFT2_FRT_TCSC2_MSZC0              *((volatile unsigned char*)(0x42442C60UL))
#define bFM4_MFT2_FRT_TCSC2_MSZC1              *((volatile unsigned char*)(0x42442C64UL))
#define bFM4_MFT2_FRT_TCSC2_MSZC2              *((volatile unsigned char*)(0x42442C68UL))
#define bFM4_MFT2_FRT_TCSC2_MSZC3              *((volatile unsigned char*)(0x42442C6CUL))
#define bFM4_MFT2_FRT_TCSC2_MSPC0              *((volatile unsigned char*)(0x42442C70UL))
#define bFM4_MFT2_FRT_TCSC2_MSPC1              *((volatile unsigned char*)(0x42442C74UL))
#define bFM4_MFT2_FRT_TCSC2_MSPC2              *((volatile unsigned char*)(0x42442C78UL))
#define bFM4_MFT2_FRT_TCSC2_MSPC3              *((volatile unsigned char*)(0x42442C7CUL))
#define bFM4_MFT2_FRT_TCAL_STOP00              *((volatile unsigned char*)(0x42442C80UL))
#define bFM4_MFT2_FRT_TCAL_STOP01              *((volatile unsigned char*)(0x42442C84UL))
#define bFM4_MFT2_FRT_TCAL_STOP02              *((volatile unsigned char*)(0x42442C88UL))
#define bFM4_MFT2_FRT_TCAL_STOP10              *((volatile unsigned char*)(0x42442C8CUL))
#define bFM4_MFT2_FRT_TCAL_STOP11              *((volatile unsigned char*)(0x42442C90UL))
#define bFM4_MFT2_FRT_TCAL_STOP12              *((volatile unsigned char*)(0x42442C94UL))
#define bFM4_MFT2_FRT_TCAL_STOP20              *((volatile unsigned char*)(0x42442C98UL))
#define bFM4_MFT2_FRT_TCAL_STOP21              *((volatile unsigned char*)(0x42442C9CUL))
#define bFM4_MFT2_FRT_TCAL_STOP22              *((volatile unsigned char*)(0x42442CA0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR00              *((volatile unsigned char*)(0x42442CC0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR01              *((volatile unsigned char*)(0x42442CC4UL))
#define bFM4_MFT2_FRT_TCAL_SCLR02              *((volatile unsigned char*)(0x42442CC8UL))
#define bFM4_MFT2_FRT_TCAL_SCLR10              *((volatile unsigned char*)(0x42442CCCUL))
#define bFM4_MFT2_FRT_TCAL_SCLR11              *((volatile unsigned char*)(0x42442CD0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR12              *((volatile unsigned char*)(0x42442CD4UL))
#define bFM4_MFT2_FRT_TCAL_SCLR20              *((volatile unsigned char*)(0x42442CD8UL))
#define bFM4_MFT2_FRT_TCAL_SCLR21              *((volatile unsigned char*)(0x42442CDCUL))
#define bFM4_MFT2_FRT_TCAL_SCLR22              *((volatile unsigned char*)(0x42442CE0UL))
#define bFM4_MFT2_FRT_TCSD_OFMD1               *((volatile unsigned char*)(0x42443D80UL))
#define bFM4_MFT2_FRT_TCSD_OFMD2               *((volatile unsigned char*)(0x42443D84UL))

