MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
#define bFM4_GPIO_PDSR4_P9                     *((volatile unsigned char*)(0x42DEEA24UL))
#define bFM4_GPIO_PDSR4_PA                     *((volatile unsigned char*)(0x42DEEA28UL))
#define bFM4_GPIO_PDSR4_PB                     *((volatile unsigned char*)(0x42DEEA2CUL))
#define bFM4_GPIO_PDSR4_PC                     *((volatile unsigned char*)(0x42DEEA30UL))
#define bFM4_GPIO_PDSR4_PD                     *((volatile unsigned char*)(0x42DEEA34UL))
#define bFM4_GPIO_PDSR4_PE                     *((volatile unsigned char*)(0x42DEEA38UL))
#define bFM4_GPIO_PDSR5_P0                     *((volatile unsigned char*)(0x42DEEA80UL))
#define bFM4_GPIO_PDSR5_P1                     *((volatile unsigned char*)(0x42DEEA84UL))
#define bFM4_GPIO_PDSR5_P2                     *((volatile unsigned char*)(0x42DEEA88UL))
#define bFM4_GPIO_PDSR5_P3                     *((volatile unsigned char*)(0x42DEEA8CUL))
#define bFM4_GPIO_PDSR5_P4                     *((volatile unsigned char*)(0x42DEEA90UL))
#define bFM4_GPIO_PDSR5_P5                     *((volatile unsigned char*)(0x42DEEA94UL))
#define bFM4_GPIO_PDSR5_P6                     *((volatile unsigned char*)(0x42DEEA98UL))
#define bFM4_GPIO_PDSR5_P7                     *((volatile unsigned char*)(0x42DEEA9CUL))
#define bFM4_GPIO_PDSR5_P8                     *((volatile unsigned char*)(0x42DEEAA0UL))
#define bFM4_GPIO_PDSR5_P9                     *((volatile unsigned char*)(0x42DEEAA4UL))
#define bFM4_GPIO_PDSR5_PA                     *((volatile unsigned char*)(0x42DEEAA8UL))
#define bFM4_GPIO_PDSR5_PB                     *((volatile unsigned char*)(0x42DEEAACUL))
#define bFM4_GPIO_PDSR5_PC                     *((volatile unsigned char*)(0x42DEEAB0UL))
#define bFM4_GPIO_PDSR5_PD                     *((volatile unsigned char*)(0x42DEEAB4UL))
#define bFM4_GPIO_PDSR5_PE                     *((volatile unsigned char*)(0x42DEEAB8UL))
#define bFM4_GPIO_PDSR5_PF                     *((volatile unsigned char*)(0x42DEEABCUL))
#define bFM4_GPIO_PDSR6_P0                     *((volatile unsigned char*)(0x42DEEB00UL))
#define bFM4_GPIO_PDSR6_P1                     *((volatile unsigned char*)(0x42DEEB04UL))
#define bFM4_GPIO_PDSR6_P2                     *((volatile unsigned char*)(0x42DEEB08UL))
#define bFM4_GPIO_PDSR6_P3                     *((volatile unsigned char*)(0x42DEEB0CUL))
#define bFM4_GPIO_PDSR6_P4                     *((volatile unsigned char*)(0x42DEEB10UL))
#define bFM4_GPIO_PDSR6_P5                     *((volatile unsigned char*)(0x42DEEB14UL))
#define bFM4_GPIO_PDSR6_P6                     *((volatile unsigned char*)(0x42DEEB18UL))
#define bFM4_GPIO_PDSR6_P7                     *((volatile unsigned char*)(0x42DEEB1CUL))
#define bFM4_GPIO_PDSR6_P8                     *((volatile unsigned char*)(0x42DEEB20UL))
#define bFM4_GPIO_PDSR6_P9                     *((volatile unsigned char*)(0x42DEEB24UL))
#define bFM4_GPIO_PDSR6_PA                     *((volatile unsigned char*)(0x42DEEB28UL))
#define bFM4_GPIO_PDSR6_PB                     *((volatile unsigned char*)(0x42DEEB2CUL))
#define bFM4_GPIO_PDSR6_PC                     *((volatile unsigned char*)(0x42DEEB30UL))
#define bFM4_GPIO_PDSR6_PD                     *((volatile unsigned char*)(0x42DEEB34UL))
#define bFM4_GPIO_PDSR6_PE                     *((volatile unsigned char*)(0x42DEEB38UL))
#define bFM4_GPIO_PDSR7_P0                     *((volatile unsigned char*)(0x42DEEB80UL))
#define bFM4_GPIO_PDSR7_P1                     *((volatile unsigned char*)(0x42DEEB84UL))
#define bFM4_GPIO_PDSR7_P2                     *((volatile unsigned char*)(0x42DEEB88UL))
#define bFM4_GPIO_PDSR7_P3                     *((volatile unsigned char*)(0x42DEEB8CUL))
#define bFM4_GPIO_PDSR7_P4                     *((volatile unsigned char*)(0x42DEEB90UL))
#define bFM4_GPIO_PDSR7_P5                     *((volatile unsigned char*)(0x42DEEB94UL))
#define bFM4_GPIO_PDSR7_P6                     *((volatile unsigned char*)(0x42DEEB98UL))
#define bFM4_GPIO_PDSR7_P7                     *((volatile unsigned char*)(0x42DEEB9CUL))
#define bFM4_GPIO_PDSR7_P8                     *((volatile unsigned char*)(0x42DEEBA0UL))
#define bFM4_GPIO_PDSR7_P9                     *((volatile unsigned char*)(0x42DEEBA4UL))
#define bFM4_GPIO_PDSR7_PA                     *((volatile unsigned char*)(0x42DEEBA8UL))
#define bFM4_GPIO_PDSR7_PB                     *((volatile unsigned char*)(0x42DEEBACUL))
#define bFM4_GPIO_PDSR7_PC                     *((volatile unsigned char*)(0x42DEEBB0UL))
#define bFM4_GPIO_PDSR7_PD                     *((volatile unsigned char*)(0x42DEEBB4UL))
#define bFM4_GPIO_PDSR7_PE                     *((volatile unsigned char*)(0x42DEEBB8UL))
#define bFM4_GPIO_PDSR8_P0                     *((volatile unsigned char*)(0x42DEEC00UL))
#define bFM4_GPIO_PDSR8_P1                     *((volatile unsigned char*)(0x42DEEC04UL))
#define bFM4_GPIO_PDSR8_P2                     *((volatile unsigned char*)(0x42DEEC08UL))
#define bFM4_GPIO_PDSR8_P3                     *((volatile unsigned char*)(0x42DEEC0CUL))
#define bFM4_GPIO_PDSR9_P0                     *((volatile unsigned char*)(0x42DEEC80UL))
#define bFM4_GPIO_PDSR9_P1                     *((volatile unsigned char*)(0x42DEEC84UL))
#define bFM4_GPIO_PDSR9_P2                     *((volatile unsigned char*)(0x42DEEC88UL))
#define bFM4_GPIO_PDSR9_P3                     *((volatile unsigned char*)(0x42DEEC8CUL))
#define bFM4_GPIO_PDSR9_P4                     *((volatile unsigned char*)(0x42DEEC90UL))
#define bFM4_GPIO_PDSR9_P5                     *((volatile unsigned char*)(0x42DEEC94UL))
#define bFM4_GPIO_PDSR9_P6                     *((volatile unsigned char*)(0x42DEEC98UL))
#define bFM4_GPIO_PDSR9_P7                     *((volatile unsigned char*)(0x42DEEC9CUL))
#define bFM4_GPIO_PDSRA_P0                     *((volatile unsigned char*)(0x42DEED00UL))
#define bFM4_GPIO_PDSRA_P1                     *((volatile unsigned char*)(0x42DEED04UL))
#define bFM4_GPIO_PDSRA_P2                     *((volatile unsigned char*)(0x42DEED08UL))
#define bFM4_GPIO_PDSRA_P3                     *((volatile unsigned char*)(0x42DEED0CUL))
#define bFM4_GPIO_PDSRA_P4                     *((volatile unsigned char*)(0x42DEED10UL))
#define bFM4_GPIO_PDSRA_P5                     *((volatile unsigned char*)(0x42DEED14UL))
#define bFM4_GPIO_PDSRA_P6                     *((volatile unsigned char*)(0x42DEED18UL))
#define bFM4_GPIO_PDSRA_P7                     *((volatile unsigned char*)(0x42DEED1CUL))
#define bFM4_GPIO_PDSRA_P8                     *((volatile unsigned char*)(0x42DEED20UL))
#define bFM4_GPIO_PDSRA_P9                     *((volatile unsigned char*)(0x42DEED24UL))
#define bFM4_GPIO_PDSRA_PA                     *((volatile unsigned char*)(0x42DEED28UL))
#define bFM4_GPIO_PDSRA_PB                     *((volatile unsigned char*)(0x42DEED2CUL))
#define bFM4_GPIO_PDSRA_PC                     *((volatile unsigned char*)(0x42DEED30UL))
#define bFM4_GPIO_PDSRA_PD                     *((volatile unsigned char*)(0x42DEED34UL))
#define bFM4_GPIO_PDSRA_PE                     *((volatile unsigned char*)(0x42DEED38UL))
#define bFM4_GPIO_PDSRA_PF                     *((volatile unsigned char*)(0x42DEED3CUL))
#define bFM4_GPIO_PDSRB_P0                     *((volatile unsigned char*)(0x42DEED80UL))
#define bFM4_GPIO_PDSRB_P1                     *((volatile unsigned char*)(0x42DEED84UL))
#define bFM4_GPIO_PDSRB_P2                     *((volatile unsigned char*)(0x42DEED88UL))
#define bFM4_GPIO_PDSRB_P3                     *((volatile unsigned char*)(0x42DEED8CUL))
#define bFM4_GPIO_PDSRB_P4                     *((volatile unsigned char*)(0x42DEED90UL))
#define bFM4_GPIO_PDSRB_P5                     *((volatile unsigned char*)(0x42DEED94UL))
#define bFM4_GPIO_PDSRB_P6                     *((volatile unsigned char*)(0x42DEED98UL))
#define bFM4_GPIO_PDSRB_P7                     *((volatile unsigned char*)(0x42DEED9CUL))
#define bFM4_GPIO_PDSRB_P8                     *((volatile unsigned char*)(0x42DEEDA0UL))
#define bFM4_GPIO_PDSRB_P9                     *((volatile unsigned char*)(0x42DEEDA4UL))
#define bFM4_GPIO_PDSRB_PA                     *((volatile unsigned char*)(0x42DEEDA8UL))
#define bFM4_GPIO_PDSRB_PB                     *((volatile unsigned char*)(0x42DEEDACUL))
#define bFM4_GPIO_PDSRB_PC                     *((volatile unsigned char*)(0x42DEEDB0UL))
#define bFM4_GPIO_PDSRB_PD                     *((volatile unsigned char*)(0x42DEEDB4UL))
#define bFM4_GPIO_PDSRB_PE                     *((volatile unsigned char*)(0x42DEEDB8UL))
#define bFM4_GPIO_PDSRB_PF                     *((volatile unsigned char*)(0x42DEEDBCUL))
#define bFM4_GPIO_PDSRC_P0                     *((volatile unsigned char*)(0x42DEEE00UL))
#define bFM4_GPIO_PDSRC_P1                     *((volatile unsigned char*)(0x42DEEE04UL))
#define bFM4_GPIO_PDSRC_P2                     *((volatile unsigned char*)(0x42DEEE08UL))
#define bFM4_GPIO_PDSRC_P3                     *((volatile unsigned char*)(0x42DEEE0CUL))
#define bFM4_GPIO_PDSRC_P4                     *((volatile unsigned char*)(0x42DEEE10UL))
#define bFM4_GPIO_PDSRC_P5                     *((volatile unsigned char*)(0x42DEEE14UL))
#define bFM4_GPIO_PDSRC_P6                     *((volatile unsigned char*)(0x42DEEE18UL))
#define bFM4_GPIO_PDSRC_P7                     *((volatile unsigned char*)(0x42DEEE1CUL))
#define bFM4_GPIO_PDSRC_P8                     *((volatile unsigned char*)(0x42DEEE20UL))
#define bFM4_GPIO_PDSRC_P9                     *((volatile unsigned char*)(0x42DEEE24UL))
#define bFM4_GPIO_PDSRC_PA                     *((volatile unsigned char*)(0x42DEEE28UL))
#define bFM4_GPIO_PDSRC_PB                     *((volatile unsigned char*)(0x42DEEE2CUL))
#define bFM4_GPIO_PDSRC_PC                     *((volatile unsigned char*)(0x42DEEE30UL))
#define bFM4_GPIO_PDSRC_PD                     *((volatile unsigned char*)(0x42DEEE34UL))
#define bFM4_GPIO_PDSRC_PE                     *((volatile unsigned char*)(0x42DEEE38UL))
#define bFM4_GPIO_PDSRC_PF                     *((volatile unsigned char*)(0x42DEEE3CUL))
#define bFM4_GPIO_PDSRD_P0                     *((volatile unsigned char*)(0x42DEEE80UL))
#define bFM4_GPIO_PDSRD_P1                     *((volatile unsigned char*)(0x42DEEE84UL))
#define bFM4_GPIO_PDSRD_P2                     *((volatile unsigned char*)(0x42DEEE88UL))
#define bFM4_GPIO_PDSRE_P0                     *((volatile unsigned char*)(0x42DEEF00UL))
#define bFM4_GPIO_PDSRE_P2                     *((volatile unsigned char*)(0x42DEEF08UL))
#define bFM4_GPIO_PDSRE_P3                     *((volatile unsigned char*)(0x42DEEF0CUL))
#define bFM4_GPIO_PDSRF_P0                     *((volatile unsigned char*)(0x42DEEF80UL))
#define bFM4_GPIO_PDSRF_P1                     *((volatile unsigned char*)(0x42DEEF84UL))
#define bFM4_GPIO_PDSRF_P2                     *((volatile unsigned char*)(0x42DEEF88UL))
#define bFM4_GPIO_PDSRF_P3                     *((volatile unsigned char*)(0x42DEEF8CUL))
#define bFM4_GPIO_PDSRF_P4                     *((volatile unsigned char*)(0x42DEEF90UL))
#define bFM4_GPIO_PDSRF_P5                     *((volatile unsigned char*)(0x42DEEF94UL))
#define bFM4_GPIO_PDSRF_P6                     *((volatile unsigned char*)(0x42DEEF98UL))
#define bFM4_GPIO_PDSRF_P7                     *((volatile unsigned char*)(0x42DEEF9CUL))
#define bFM4_GPIO_PDSRF_P8                     *((volatile unsigned char*)(0x42DEEFA0UL))
#define bFM4_GPIO_PDSRF_P9                     *((volatile unsigned char*)(0x42DEEFA4UL))
#define bFM4_GPIO_PDSRF_PA                     *((volatile unsigned char*)(0x42DEEFA8UL))
#define bFM4_GPIO_PDSRF_PB                     *((volatile unsigned char*)(0x42DEEFACUL))
#define bFM4_GPIO_PDSRF_PC                     *((volatile unsigned char*)(0x42DEEFB0UL))

/* Low voltage detection registers */
#define bFM4_LVD_LVD_CTL_SVHI0                 *((volatile unsigned char*)(0x426A0008UL))
#define bFM4_LVD_LVD_CTL_SVHI1                 *((volatile unsigned char*)(0x426A000CUL))
#define bFM4_LVD_LVD_CTL_SVHI2                 *((volatile unsigned char*)(0x426A0010UL))
#define bFM4_LVD_LVD_CTL_SVHI3                 *((volatile unsigned char*)(0x426A0014UL))
#define bFM4_LVD_LVD_CTL_SVHI4                 *((volatile unsigned char*)(0x426A0018UL))
#define bFM4_LVD_LVD_CTL_LVDIE                 *((volatile unsigned char*)(0x426A001CUL))
#define bFM4_LVD_LVD_STR_LVDIR                 *((volatile unsigned char*)(0x426A009CUL))
#define bFM4_LVD_LVD_CLR_LVDCL                 *((volatile unsigned char*)(0x426A011CUL))
#define bFM4_LVD_LVD_STR2_LVDIRDY              *((volatile unsigned char*)(0x426A021CUL))

/* DS mode registers */
#define bFM4_DS_RCK_CTL_CECCKE                 *((volatile unsigned char*)(0x426A2084UL))
#define bFM4_DS_PMD_CTL_RTCE                   *((volatile unsigned char*)(0x426B0000UL))
#define bFM4_DS_WRFSR_WINITX                   *((volatile unsigned char*)(0x426B0080UL))
#define bFM4_DS_WRFSR_WLVDH                    *((volatile unsigned char*)(0x426B0084UL))
#define bFM4_DS_WIFSR_WRTCI                    *((volatile unsigned char*)(0x426B0100UL))
#define bFM4_DS_WIFSR_WLVDI                    *((volatile unsigned char*)(0x426B0104UL))
#define bFM4_DS_WIFSR_WUI0                     *((volatile unsigned char*)(0x426B0108UL))
#define bFM4_DS_WIFSR_WUI1                     *((volatile unsigned char*)(0x426B010CUL))
#define bFM4_DS_WIFSR_WUI2                     *((volatile unsigned char*)(0x426B0110UL))
#define bFM4_DS_WIFSR_WUI3                     *((volatile unsigned char*)(0x426B0114UL))
#define bFM4_DS_WIFSR_WUI4                     *((volatile unsigned char*)(0x426B0118UL))
#define bFM4_DS_WIFSR_WUI5                     *((volatile unsigned char*)(0x426B011CUL))
#define bFM4_DS_WIER_WRTCE                     *((volatile unsigned char*)(0x426B0180UL))
#define bFM4_DS_WIER_WLVDE                     *((volatile unsigned char*)(0x426B0184UL))
#define bFM4_DS_WIER_WUI1E                     *((volatile unsigned char*)(0x426B018CUL))
#define bFM4_DS_WIER_WUI2E                     *((volatile unsigned char*)(0x426B0190UL))
#define bFM4_DS_WIER_WUI3E                     *((volatile unsigned char*)(0x426B0194UL))
#define bFM4_DS_WIER_WUI4E                     *((volatile unsigned char*)(0x426B0198UL))
#define bFM4_DS_WIER_WUI5E                     *((volatile unsigned char*)(0x426B019CUL))
#define bFM4_DS_WILVR_WUI1LV                   *((volatile unsigned char*)(0x426B0200UL))
#define bFM4_DS_WILVR_WUI2LV                   *((volatile unsigned char*)(0x426B0204UL))
#define bFM4_DS_WILVR_WUI3LV                   *((volatile unsigned char*)(0x426B0208UL))
#define bFM4_DS_WILVR_WUI4LV                   *((volatile unsigned char*)(0x426B020CUL))
#define bFM4_DS_WILVR_WUI5LV                   *((volatile unsigned char*)(0x426B0210UL))
#define bFM4_DS_DSRAMR_SRAMR0                  *((volatile unsigned char*)(0x426B0280UL))
#define bFM4_DS_DSRAMR_SRAMR1                  *((volatile unsigned char*)(0x426B0284UL))



/* MFS UART channel 0 registers */
#define bFM4_MFS0_UART_SMR_SOE                 *((volatile unsigned char*)(0x42700000UL))
#define bFM4_MFS0_UART_SMR_BDS                 *((volatile unsigned char*)(0x42700008UL))
#define bFM4_MFS0_UART_SMR_SBL                 *((volatile unsigned char*)(0x4270000CUL))
#define bFM4_MFS0_UART_SMR_WUCR                *((volatile unsigned char*)(0x42700010UL))
#define bFM4_MFS0_UART_SMR_MD0                 *((volatile unsigned char*)(0x42700014UL))
#define bFM4_MFS0_UART_SMR_MD1                 *((volatile unsigned char*)(0x42700018UL))
#define bFM4_MFS0_UART_SMR_MD2                 *((volatile unsigned char*)(0x4270001CUL))
#define bFM4_MFS0_UART_SCR_TXE                 *((volatile unsigned char*)(0x42700020UL))
#define bFM4_MFS0_UART_SCR_RXE                 *((volatile unsigned char*)(0x42700024UL))
#define bFM4_MFS0_UART_SCR_TBIE                *((volatile unsigned char*)(0x42700028UL))
#define bFM4_MFS0_UART_SCR_TIE                 *((volatile unsigned char*)(0x4270002CUL))
#define bFM4_MFS0_UART_SCR_RIE                 *((volatile unsigned char*)(0x42700030UL))
#define bFM4_MFS0_UART_SCR_UPCL                *((volatile unsigned char*)(0x4270003CUL))
#define bFM4_MFS0_UART_ESCR_L0                 *((volatile unsigned char*)(0x42700080UL))
#define bFM4_MFS0_UART_ESCR_L1                 *((volatile unsigned char*)(0x42700084UL))
#define bFM4_MFS0_UART_ESCR_L2                 *((volatile unsigned char*)(0x42700088UL))
#define bFM4_MFS0_UART_ESCR_P                  *((volatile unsigned char*)(0x4270008CUL))
#define bFM4_MFS0_UART_ESCR_PEN                *((volatile unsigned char*)(0x42700090UL))
#define bFM4_MFS0_UART_ESCR_INV                *((volatile unsigned char*)(0x42700094UL))
#define bFM4_MFS0_UART_ESCR_ESBL               *((volatile unsigned char*)(0x42700098UL))
#define bFM4_MFS0_UART_ESCR_FLWEN              *((volatile unsigned char*)(0x4270009CUL))
#define bFM4_MFS0_UART_SSR_TBI                 *((volatile unsigned char*)(0x427000A0UL))
#define bFM4_MFS0_UART_SSR_TDRE                *((volatile unsigned char*)(0x427000A4UL))
#define bFM4_MFS0_UART_SSR_RDRF                *((volatile unsigned char*)(0x427000A8UL))
#define bFM4_MFS0_UART_SSR_ORE                 *((volatile unsigned char*)(0x427000ACUL))
#define bFM4_MFS0_UART_SSR_FRE                 *((volatile unsigned char*)(0x427000B0UL))
#define bFM4_MFS0_UART_SSR_PE                  *((volatile unsigned char*)(0x427000B4UL))
#define bFM4_MFS0_UART_SSR_REC                 *((volatile unsigned char*)(0x427000BCUL))
#define bFM4_MFS0_UART_BGR_EXT                 *((volatile unsigned char*)(0x427001BCUL))
#define bFM4_MFS0_UART_BGR1_EXT                *((volatile unsigned char*)(0x427001BCUL))
#define bFM4_MFS0_UART_FCR_FE1                 *((volatile unsigned char*)(0x42700280UL))
#define bFM4_MFS0_UART_FCR_FE2                 *((volatile unsigned char*)(0x42700284UL))
#define bFM4_MFS0_UART_FCR_FCL1                *((volatile unsigned char*)(0x42700288UL))
#define bFM4_MFS0_UART_FCR_FCL2                *((volatile unsigned char*)(0x4270028CUL))
#define bFM4_MFS0_UART_FCR_FSET                *((volatile unsigned char*)(0x42700290UL))
#define bFM4_MFS0_UART_FCR_FLD                 *((volatile unsigned char*)(0x42700294UL))
#define bFM4_MFS0_UART_FCR_FLST                *((volatile unsigned char*)(0x42700298UL))
#define bFM4_MFS0_UART_FCR_FSEL                *((volatile unsigned char*)(0x427002A0UL))
#define bFM4_MFS0_UART_FCR_FTIE                *((volatile unsigned char*)(0x427002A4UL))
#define bFM4_MFS0_UART_FCR_FDRQ                *((volatile unsigned char*)(0x427002A8UL))
#define bFM4_MFS0_UART_FCR_FRIIE               *((volatile unsigned char*)(0x427002ACUL))
#define bFM4_MFS0_UART_FCR_FLSTE               *((volatile unsigned char*)(0x427002B0UL))
#define bFM4_MFS0_UART_FCR0_FE1                *((volatile unsigned char*)(0x42700280UL))
#define bFM4_MFS0_UART_FCR0_FE2                *((volatile unsigned char*)(0x42700284UL))
#define bFM4_MFS0_UART_FCR0_FCL1               *((volatile unsigned char*)(0x42700288UL))
#define bFM4_MFS0_UART_FCR0_FCL2               *((volatile unsigned char*)(0x4270028CUL))
#define bFM4_MFS0_UART_FCR0_FSET               *((volatile unsigned char*)(0x42700290UL))
#define bFM4_MFS0_UART_FCR0_FLD                *((volatile unsigned char*)(0x42700294UL))
#define bFM4_MFS0_UART_FCR0_FLST               *((volatile unsigned char*)(0x42700298UL))
#define bFM4_MFS0_UART_FCR1_FSEL               *((volatile unsigned char*)(0x427002A0UL))
#define bFM4_MFS0_UART_FCR1_FTIE               *((volatile unsigned char*)(0x427002A4UL))
#define bFM4_MFS0_UART_FCR1_FDRQ               *((volatile unsigned char*)(0x427002A8UL))
#define bFM4_MFS0_UART_FCR1_FRIIE              *((volatile unsigned char*)(0x427002ACUL))
#define bFM4_MFS0_UART_FCR1_FLSTE              *((volatile unsigned char*)(0x427002B0UL))
#define bFM4_MFS0_UART_FBYTE_FD0               *((volatile unsigned char*)(0x42700300UL))
#define bFM4_MFS0_UART_FBYTE_FD1               *((volatile unsigned char*)(0x42700304UL))
#define bFM4_MFS0_UART_FBYTE_FD2               *((volatile unsigned char*)(0x42700308UL))
#define bFM4_MFS0_UART_FBYTE_FD3               *((volatile unsigned char*)(0x4270030CUL))
#define bFM4_MFS0_UART_FBYTE_FD4               *((volatile unsigned char*)(0x42700310UL))
#define bFM4_MFS0_UART_FBYTE_FD5               *((volatile unsigned char*)(0x42700314UL))
#define bFM4_MFS0_UART_FBYTE_FD6               *((volatile unsigned char*)(0x42700318UL))
#define bFM4_MFS0_UART_FBYTE_FD7               *((volatile unsigned char*)(0x4270031CUL))
#define bFM4_MFS0_UART_FBYTE_FD8               *((volatile unsigned char*)(0x42700320UL))
#define bFM4_MFS0_UART_FBYTE_FD9               *((volatile unsigned char*)(0x42700324UL))
#define bFM4_MFS0_UART_FBYTE_FD10              *((volatile unsigned char*)(0x42700328UL))
#define bFM4_MFS0_UART_FBYTE_FD11              *((volatile unsigned char*)(0x4270032CUL))
#define bFM4_MFS0_UART_FBYTE_FD12              *((volatile unsigned char*)(0x42700330UL))
#define bFM4_MFS0_UART_FBYTE_FD13              *((volatile unsigned char*)(0x42700334UL))
#define bFM4_MFS0_UART_FBYTE_FD14              *((volatile unsigned char*)(0x42700338UL))
#define bFM4_MFS0_UART_FBYTE_FD15              *((volatile unsigned char*)(0x4270033CUL))
#define bFM4_MFS0_UART_FBYTE1_FD0              *((volatile unsigned char*)(0x42700300UL))
#define bFM4_MFS0_UART_FBYTE1_FD1              *((volatile unsigned char*)(0x42700304UL))
#define bFM4_MFS0_UART_FBYTE1_FD2              *((volatile unsigned char*)(0x42700308UL))
#define bFM4_MFS0_UART_FBYTE1_FD3              *((volatile unsigned char*)(0x4270030CUL))
#define bFM4_MFS0_UART_FBYTE1_FD4              *((volatile unsigned char*)(0x42700310UL))
#define bFM4_MFS0_UART_FBYTE1_FD5              *((volatile unsigned char*)(0x42700314UL))
#define bFM4_MFS0_UART_FBYTE1_FD6              *((volatile unsigned char*)(0x42700318UL))
#define bFM4_MFS0_UART_FBYTE1_FD7              *((volatile unsigned char*)(0x4270031CUL))
#define bFM4_MFS0_UART_FBYTE2_FD8              *((volatile unsigned char*)(0x42700320UL))
#define bFM4_MFS0_UART_FBYTE2_FD9              *((volatile unsigned char*)(0x42700324UL))
#define bFM4_MFS0_UART_FBYTE2_FD10             *((volatile unsigned char*)(0x42700328UL))
#define bFM4_MFS0_UART_FBYTE2_FD11             *((volatile unsigned char*)(0x4270032CUL))
#define bFM4_MFS0_UART_FBYTE2_FD12             *((volatile unsigned char*)(0x42700330UL))
#define bFM4_MFS0_UART_FBYTE2_FD13             *((volatile unsigned char*)(0x42700334UL))
#define bFM4_MFS0_UART_FBYTE2_FD14             *((volatile unsigned char*)(0x42700338UL))
#define bFM4_MFS0_UART_FBYTE2_FD15             *((volatile unsigned char*)(0x4270033CUL))

