MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
/* MFS CSIO channel 1 registers */
#define bFM4_MFS1_CSIO_SMR_SOE                 *((volatile unsigned char*)(0x42702000UL))
#define bFM4_MFS1_CSIO_SMR_SCKE                *((volatile unsigned char*)(0x42702004UL))
#define bFM4_MFS1_CSIO_SMR_BDS                 *((volatile unsigned char*)(0x42702008UL))
#define bFM4_MFS1_CSIO_SMR_SCINV               *((volatile unsigned char*)(0x4270200CUL))
#define bFM4_MFS1_CSIO_SMR_MD0                 *((volatile unsigned char*)(0x42702014UL))
#define bFM4_MFS1_CSIO_SMR_MD1                 *((volatile unsigned char*)(0x42702018UL))
#define bFM4_MFS1_CSIO_SMR_MD2                 *((volatile unsigned char*)(0x4270201CUL))
#define bFM4_MFS1_CSIO_SCR_TXE                 *((volatile unsigned char*)(0x42702020UL))
#define bFM4_MFS1_CSIO_SCR_RXE                 *((volatile unsigned char*)(0x42702024UL))
#define bFM4_MFS1_CSIO_SCR_TBIE                *((volatile unsigned char*)(0x42702028UL))
#define bFM4_MFS1_CSIO_SCR_TIE                 *((volatile unsigned char*)(0x4270202CUL))
#define bFM4_MFS1_CSIO_SCR_RIE                 *((volatile unsigned char*)(0x42702030UL))
#define bFM4_MFS1_CSIO_SCR_SPI                 *((volatile unsigned char*)(0x42702034UL))
#define bFM4_MFS1_CSIO_SCR_MS                  *((volatile unsigned char*)(0x42702038UL))
#define bFM4_MFS1_CSIO_SCR_UPCL                *((volatile unsigned char*)(0x4270203CUL))
#define bFM4_MFS1_CSIO_ESCR_L0                 *((volatile unsigned char*)(0x42702080UL))
#define bFM4_MFS1_CSIO_ESCR_L1                 *((volatile unsigned char*)(0x42702084UL))
#define bFM4_MFS1_CSIO_ESCR_L2                 *((volatile unsigned char*)(0x42702088UL))
#define bFM4_MFS1_CSIO_ESCR_WT0                *((volatile unsigned char*)(0x4270208CUL))
#define bFM4_MFS1_CSIO_ESCR_WT1                *((volatile unsigned char*)(0x42702090UL))
#define bFM4_MFS1_CSIO_ESCR_CSFE               *((volatile unsigned char*)(0x42702094UL))
#define bFM4_MFS1_CSIO_ESCR_L3                 *((volatile unsigned char*)(0x42702098UL))
#define bFM4_MFS1_CSIO_ESCR_SOP                *((volatile unsigned char*)(0x4270209CUL))
#define bFM4_MFS1_CSIO_SSR_TBI                 *((volatile unsigned char*)(0x427020A0UL))
#define bFM4_MFS1_CSIO_SSR_TDRE                *((volatile unsigned char*)(0x427020A4UL))
#define bFM4_MFS1_CSIO_SSR_RDRF                *((volatile unsigned char*)(0x427020A8UL))
#define bFM4_MFS1_CSIO_SSR_ORE                 *((volatile unsigned char*)(0x427020ACUL))
#define bFM4_MFS1_CSIO_SSR_AWC                 *((volatile unsigned char*)(0x427020B0UL))
#define bFM4_MFS1_CSIO_SSR_REC                 *((volatile unsigned char*)(0x427020BCUL))
#define bFM4_MFS1_CSIO_FCR_FE1                 *((volatile unsigned char*)(0x42702280UL))
#define bFM4_MFS1_CSIO_FCR_FE2                 *((volatile unsigned char*)(0x42702284UL))
#define bFM4_MFS1_CSIO_FCR_FCL1                *((volatile unsigned char*)(0x42702288UL))
#define bFM4_MFS1_CSIO_FCR_FCL2                *((volatile unsigned char*)(0x4270228CUL))
#define bFM4_MFS1_CSIO_FCR_FSET                *((volatile unsigned char*)(0x42702290UL))
#define bFM4_MFS1_CSIO_FCR_FLD                 *((volatile unsigned char*)(0x42702294UL))
#define bFM4_MFS1_CSIO_FCR_FLST                *((volatile unsigned char*)(0x42702298UL))
#define bFM4_MFS1_CSIO_FCR_FSEL                *((volatile unsigned char*)(0x427022A0UL))
#define bFM4_MFS1_CSIO_FCR_FTIE                *((volatile unsigned char*)(0x427022A4UL))
#define bFM4_MFS1_CSIO_FCR_FDRQ                *((volatile unsigned char*)(0x427022A8UL))
#define bFM4_MFS1_CSIO_FCR_FRIIE               *((volatile unsigned char*)(0x427022ACUL))
#define bFM4_MFS1_CSIO_FCR_FLSTE               *((volatile unsigned char*)(0x427022B0UL))
#define bFM4_MFS1_CSIO_FCR0_FE1                *((volatile unsigned char*)(0x42702280UL))
#define bFM4_MFS1_CSIO_FCR0_FE2                *((volatile unsigned char*)(0x42702284UL))
#define bFM4_MFS1_CSIO_FCR0_FCL1               *((volatile unsigned char*)(0x42702288UL))
#define bFM4_MFS1_CSIO_FCR0_FCL2               *((volatile unsigned char*)(0x4270228CUL))
#define bFM4_MFS1_CSIO_FCR0_FSET               *((volatile unsigned char*)(0x42702290UL))
#define bFM4_MFS1_CSIO_FCR0_FLD                *((volatile unsigned char*)(0x42702294UL))
#define bFM4_MFS1_CSIO_FCR0_FLST               *((volatile unsigned char*)(0x42702298UL))
#define bFM4_MFS1_CSIO_FCR1_FSEL               *((volatile unsigned char*)(0x427022A0UL))
#define bFM4_MFS1_CSIO_FCR1_FTIE               *((volatile unsigned char*)(0x427022A4UL))
#define bFM4_MFS1_CSIO_FCR1_FDRQ               *((volatile unsigned char*)(0x427022A8UL))
#define bFM4_MFS1_CSIO_FCR1_FRIIE              *((volatile unsigned char*)(0x427022ACUL))
#define bFM4_MFS1_CSIO_FCR1_FLSTE              *((volatile unsigned char*)(0x427022B0UL))
#define bFM4_MFS1_CSIO_FBYTE_FD0               *((volatile unsigned char*)(0x42702300UL))
#define bFM4_MFS1_CSIO_FBYTE_FD1               *((volatile unsigned char*)(0x42702304UL))
#define bFM4_MFS1_CSIO_FBYTE_FD2               *((volatile unsigned char*)(0x42702308UL))
#define bFM4_MFS1_CSIO_FBYTE_FD3               *((volatile unsigned char*)(0x4270230CUL))
#define bFM4_MFS1_CSIO_FBYTE_FD4               *((volatile unsigned char*)(0x42702310UL))
#define bFM4_MFS1_CSIO_FBYTE_FD5               *((volatile unsigned char*)(0x42702314UL))
#define bFM4_MFS1_CSIO_FBYTE_FD6               *((volatile unsigned char*)(0x42702318UL))
#define bFM4_MFS1_CSIO_FBYTE_FD7               *((volatile unsigned char*)(0x4270231CUL))
#define bFM4_MFS1_CSIO_FBYTE_FD8               *((volatile unsigned char*)(0x42702320UL))
#define bFM4_MFS1_CSIO_FBYTE_FD9               *((volatile unsigned char*)(0x42702324UL))
#define bFM4_MFS1_CSIO_FBYTE_FD10              *((volatile unsigned char*)(0x42702328UL))
#define bFM4_MFS1_CSIO_FBYTE_FD11              *((volatile unsigned char*)(0x4270232CUL))
#define bFM4_MFS1_CSIO_FBYTE_FD12              *((volatile unsigned char*)(0x42702330UL))
#define bFM4_MFS1_CSIO_FBYTE_FD13              *((volatile unsigned char*)(0x42702334UL))
#define bFM4_MFS1_CSIO_FBYTE_FD14              *((volatile unsigned char*)(0x42702338UL))
#define bFM4_MFS1_CSIO_FBYTE_FD15              *((volatile unsigned char*)(0x4270233CUL))
#define bFM4_MFS1_CSIO_FBYTE1_FD0              *((volatile unsigned char*)(0x42702300UL))
#define bFM4_MFS1_CSIO_FBYTE1_FD1              *((volatile unsigned char*)(0x42702304UL))
#define bFM4_MFS1_CSIO_FBYTE1_FD2              *((volatile unsigned char*)(0x42702308UL))
#define bFM4_MFS1_CSIO_FBYTE1_FD3              *((volatile unsigned char*)(0x4270230CUL))
#define bFM4_MFS1_CSIO_FBYTE1_FD4              *((volatile unsigned char*)(0x42702310UL))
#define bFM4_MFS1_CSIO_FBYTE1_FD5              *((volatile unsigned char*)(0x42702314UL))
#define bFM4_MFS1_CSIO_FBYTE1_FD6              *((volatile unsigned char*)(0x42702318UL))
#define bFM4_MFS1_CSIO_FBYTE1_FD7              *((volatile unsigned char*)(0x4270231CUL))
#define bFM4_MFS1_CSIO_FBYTE2_FD8              *((volatile unsigned char*)(0x42702320UL))
#define bFM4_MFS1_CSIO_FBYTE2_FD9              *((volatile unsigned char*)(0x42702324UL))
#define bFM4_MFS1_CSIO_FBYTE2_FD10             *((volatile unsigned char*)(0x42702328UL))
#define bFM4_MFS1_CSIO_FBYTE2_FD11             *((volatile unsigned char*)(0x4270232CUL))
#define bFM4_MFS1_CSIO_FBYTE2_FD12             *((volatile unsigned char*)(0x42702330UL))
#define bFM4_MFS1_CSIO_FBYTE2_FD13             *((volatile unsigned char*)(0x42702334UL))
#define bFM4_MFS1_CSIO_FBYTE2_FD14             *((volatile unsigned char*)(0x42702338UL))
#define bFM4_MFS1_CSIO_FBYTE2_FD15             *((volatile unsigned char*)(0x4270233CUL))
#define bFM4_MFS1_CSIO_SCSTR10_CSHD0           *((volatile unsigned char*)(0x42702380UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSHD1           *((volatile unsigned char*)(0x42702384UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSHD2           *((volatile unsigned char*)(0x42702388UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSHD3           *((volatile unsigned char*)(0x4270238CUL))
#define bFM4_MFS1_CSIO_SCSTR10_CSHD4           *((volatile unsigned char*)(0x42702390UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSHD5           *((volatile unsigned char*)(0x42702394UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSHD6           *((volatile unsigned char*)(0x42702398UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSHD7           *((volatile unsigned char*)(0x4270239CUL))
#define bFM4_MFS1_CSIO_SCSTR10_CSSU0           *((volatile unsigned char*)(0x427023A0UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSSU1           *((volatile unsigned char*)(0x427023A4UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSSU2           *((volatile unsigned char*)(0x427023A8UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSSU3           *((volatile unsigned char*)(0x427023ACUL))
#define bFM4_MFS1_CSIO_SCSTR10_CSSU4           *((volatile unsigned char*)(0x427023B0UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSSU5           *((volatile unsigned char*)(0x427023B4UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSSU6           *((volatile unsigned char*)(0x427023B8UL))
#define bFM4_MFS1_CSIO_SCSTR10_CSSU7           *((volatile unsigned char*)(0x427023BCUL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS0           *((volatile unsigned char*)(0x42702400UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS1           *((volatile unsigned char*)(0x42702404UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS2           *((volatile unsigned char*)(0x42702408UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS3           *((volatile unsigned char*)(0x4270240CUL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS4           *((volatile unsigned char*)(0x42702410UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS5           *((volatile unsigned char*)(0x42702414UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS6           *((volatile unsigned char*)(0x42702418UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS7           *((volatile unsigned char*)(0x4270241CUL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS8           *((volatile unsigned char*)(0x42702420UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS9           *((volatile unsigned char*)(0x42702424UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS10          *((volatile unsigned char*)(0x42702428UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS11          *((volatile unsigned char*)(0x4270242CUL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS12          *((volatile unsigned char*)(0x42702430UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS13          *((volatile unsigned char*)(0x42702434UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS14          *((volatile unsigned char*)(0x42702438UL))
#define bFM4_MFS1_CSIO_SCSTR32_CSDS15          *((volatile unsigned char*)(0x4270243CUL))
#define bFM4_MFS1_CSIO_SACSR_TMRE              *((volatile unsigned char*)(0x42702480UL))
#define bFM4_MFS1_CSIO_SACSR_TDIV0             *((volatile unsigned char*)(0x42702484UL))
#define bFM4_MFS1_CSIO_SACSR_TDIV1             *((volatile unsigned char*)(0x42702488UL))
#define bFM4_MFS1_CSIO_SACSR_TDIV2             *((volatile unsigned char*)(0x4270248CUL))
#define bFM4_MFS1_CSIO_SACSR_TDIV3             *((volatile unsigned char*)(0x42702490UL))
#define bFM4_MFS1_CSIO_SACSR_TSYNE             *((volatile unsigned char*)(0x42702498UL))
#define bFM4_MFS1_CSIO_SACSR_TINTE             *((volatile unsigned char*)(0x4270249CUL))
#define bFM4_MFS1_CSIO_SACSR_TINT              *((volatile unsigned char*)(0x427024A0UL))
#define bFM4_MFS1_CSIO_SACSR_CSE               *((volatile unsigned char*)(0x427024ACUL))
#define bFM4_MFS1_CSIO_SACSR_CSEIE             *((volatile unsigned char*)(0x427024B0UL))
#define bFM4_MFS1_CSIO_SACSR_TBEEN             *((volatile unsigned char*)(0x427024B4UL))
#define bFM4_MFS1_CSIO_STMR_TM0                *((volatile unsigned char*)(0x42702500UL))
#define bFM4_MFS1_CSIO_STMR_TM1                *((volatile unsigned char*)(0x42702504UL))
#define bFM4_MFS1_CSIO_STMR_TM2                *((volatile unsigned char*)(0x42702508UL))
#define bFM4_MFS1_CSIO_STMR_TM3                *((volatile unsigned char*)(0x4270250CUL))
#define bFM4_MFS1_CSIO_STMR_TM4                *((volatile unsigned char*)(0x42702510UL))
#define bFM4_MFS1_CSIO_STMR_TM5                *((volatile unsigned char*)(0x42702514UL))
#define bFM4_MFS1_CSIO_STMR_TM6                *((volatile unsigned char*)(0x42702518UL))
#define bFM4_MFS1_CSIO_STMR_TM7                *((volatile unsigned char*)(0x4270251CUL))
#define bFM4_MFS1_CSIO_STMR_TM8                *((volatile unsigned char*)(0x42702520UL))
#define bFM4_MFS1_CSIO_STMR_TM9                *((volatile unsigned char*)(0x42702524UL))
#define bFM4_MFS1_CSIO_STMR_TM10               *((volatile unsigned char*)(0x42702528UL))
#define bFM4_MFS1_CSIO_STMR_TM11               *((volatile unsigned char*)(0x4270252CUL))
#define bFM4_MFS1_CSIO_STMR_TM12               *((volatile unsigned char*)(0x42702530UL))
#define bFM4_MFS1_CSIO_STMR_TM13               *((volatile unsigned char*)(0x42702534UL))
#define bFM4_MFS1_CSIO_STMR_TM14               *((volatile unsigned char*)(0x42702538UL))
#define bFM4_MFS1_CSIO_STMR_TM15               *((volatile unsigned char*)(0x4270253CUL))
#define bFM4_MFS1_CSIO_STMCR_TC0               *((volatile unsigned char*)(0x42702580UL))
#define bFM4_MFS1_CSIO_STMCR_TC1               *((volatile unsigned char*)(0x42702584UL))
#define bFM4_MFS1_CSIO_STMCR_TC2               *((volatile unsigned char*)(0x42702588UL))
#define bFM4_MFS1_CSIO_STMCR_TC3               *((volatile unsigned char*)(0x4270258CUL))
#define bFM4_MFS1_CSIO_STMCR_TC4               *((volatile unsigned char*)(0x42702590UL))
#define bFM4_MFS1_CSIO_STMCR_TC5               *((volatile unsigned char*)(0x42702594UL))
#define bFM4_MFS1_CSIO_STMCR_TC6               *((volatile unsigned char*)(0x42702598UL))
#define bFM4_MFS1_CSIO_STMCR_TC7               *((volatile unsigned char*)(0x4270259CUL))
#define bFM4_MFS1_CSIO_STMCR_TC8               *((volatile unsigned char*)(0x427025A0UL))
#define bFM4_MFS1_CSIO_STMCR_TC9               *((volatile unsigned char*)(0x427025A4UL))
#define bFM4_MFS1_CSIO_STMCR_TC10              *((volatile unsigned char*)(0x427025A8UL))
#define bFM4_MFS1_CSIO_STMCR_TC11              *((volatile unsigned char*)(0x427025ACUL))
#define bFM4_MFS1_CSIO_STMCR_TC12              *((volatile unsigned char*)(0x427025B0UL))
#define bFM4_MFS1_CSIO_STMCR_TC13              *((volatile unsigned char*)(0x427025B4UL))
#define bFM4_MFS1_CSIO_STMCR_TC14              *((volatile unsigned char*)(0x427025B8UL))
#define bFM4_MFS1_CSIO_STMCR_TC15              *((volatile unsigned char*)(0x427025BCUL))
#define bFM4_MFS1_CSIO_SCSCR_CSOE              *((volatile unsigned char*)(0x42702600UL))
#define bFM4_MFS1_CSIO_SCSCR_CSEN0             *((volatile unsigned char*)(0x42702604UL))
#define bFM4_MFS1_CSIO_SCSCR_CSEN1             *((volatile unsigned char*)(0x42702608UL))
#define bFM4_MFS1_CSIO_SCSCR_CSEN2             *((volatile unsigned char*)(0x4270260CUL))
#define bFM4_MFS1_CSIO_SCSCR_CSEN3             *((volatile unsigned char*)(0x42702610UL))
#define bFM4_MFS1_CSIO_SCSCR_CSLVL             *((volatile unsigned char*)(0x42702614UL))
#define bFM4_MFS1_CSIO_SCSCR_CDIV0             *((volatile unsigned char*)(0x42702618UL))
#define bFM4_MFS1_CSIO_SCSCR_CDIV1             *((volatile unsigned char*)(0x4270261CUL))
#define bFM4_MFS1_CSIO_SCSCR_CDIV2             *((volatile unsigned char*)(0x42702620UL))
#define bFM4_MFS1_CSIO_SCSCR_SCAM              *((volatile unsigned char*)(0x42702624UL))
#define bFM4_MFS1_CSIO_SCSCR_SCD0              *((volatile unsigned char*)(0x42702628UL))
#define bFM4_MFS1_CSIO_SCSCR_SCD1              *((volatile unsigned char*)(0x4270262CUL))
#define bFM4_MFS1_CSIO_SCSCR_SED0              *((volatile unsigned char*)(0x42702630UL))
#define bFM4_MFS1_CSIO_SCSCR_SED1              *((volatile unsigned char*)(0x42702634UL))
#define bFM4_MFS1_CSIO_SCSCR_SST0              *((volatile unsigned char*)(0x42702638UL))
#define bFM4_MFS1_CSIO_SCSCR_SST1              *((volatile unsigned char*)(0x4270263CUL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1L0            *((volatile unsigned char*)(0x42702680UL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1L1            *((volatile unsigned char*)(0x42702684UL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1L2            *((volatile unsigned char*)(0x42702688UL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1L3            *((volatile unsigned char*)(0x4270268CUL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1L4            *((volatile unsigned char*)(0x42702690UL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1SPI           *((volatile unsigned char*)(0x42702694UL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1SCINV         *((volatile unsigned char*)(0x42702698UL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1CSLVL         *((volatile unsigned char*)(0x4270269CUL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2L0            *((volatile unsigned char*)(0x427026A0UL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2L1            *((volatile unsigned char*)(0x427026A4UL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2L2            *((volatile unsigned char*)(0x427026A8UL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2L3            *((volatile unsigned char*)(0x427026ACUL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2L4            *((volatile unsigned char*)(0x427026B0UL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2SPI           *((volatile unsigned char*)(0x427026B4UL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2SCINV         *((volatile unsigned char*)(0x427026B8UL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2CSLVL         *((volatile unsigned char*)(0x427026BCUL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3L0            *((volatile unsigned char*)(0x42702700UL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3L1            *((volatile unsigned char*)(0x42702704UL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3L2            *((volatile unsigned char*)(0x42702708UL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3L3            *((volatile unsigned char*)(0x4270270CUL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3L4            *((volatile unsigned char*)(0x42702710UL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3SPI           *((volatile unsigned char*)(0x42702714UL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3SCINV         *((volatile unsigned char*)(0x42702718UL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3CSLVL         *((volatile unsigned char*)(0x4270271CUL))

