MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
/* MFS CSIO channel 2 registers */
#define bFM4_MFS2_CSIO_SMR_SOE                 *((volatile unsigned char*)(0x42704000UL))
#define bFM4_MFS2_CSIO_SMR_SCKE                *((volatile unsigned char*)(0x42704004UL))
#define bFM4_MFS2_CSIO_SMR_BDS                 *((volatile unsigned char*)(0x42704008UL))
#define bFM4_MFS2_CSIO_SMR_SCINV               *((volatile unsigned char*)(0x4270400CUL))
#define bFM4_MFS2_CSIO_SMR_MD0                 *((volatile unsigned char*)(0x42704014UL))
#define bFM4_MFS2_CSIO_SMR_MD1                 *((volatile unsigned char*)(0x42704018UL))
#define bFM4_MFS2_CSIO_SMR_MD2                 *((volatile unsigned char*)(0x4270401CUL))
#define bFM4_MFS2_CSIO_SCR_TXE                 *((volatile unsigned char*)(0x42704020UL))
#define bFM4_MFS2_CSIO_SCR_RXE                 *((volatile unsigned char*)(0x42704024UL))
#define bFM4_MFS2_CSIO_SCR_TBIE                *((volatile unsigned char*)(0x42704028UL))
#define bFM4_MFS2_CSIO_SCR_TIE                 *((volatile unsigned char*)(0x4270402CUL))
#define bFM4_MFS2_CSIO_SCR_RIE                 *((volatile unsigned char*)(0x42704030UL))
#define bFM4_MFS2_CSIO_SCR_SPI                 *((volatile unsigned char*)(0x42704034UL))
#define bFM4_MFS2_CSIO_SCR_MS                  *((volatile unsigned char*)(0x42704038UL))
#define bFM4_MFS2_CSIO_SCR_UPCL                *((volatile unsigned char*)(0x4270403CUL))
#define bFM4_MFS2_CSIO_ESCR_L0                 *((volatile unsigned char*)(0x42704080UL))
#define bFM4_MFS2_CSIO_ESCR_L1                 *((volatile unsigned char*)(0x42704084UL))
#define bFM4_MFS2_CSIO_ESCR_L2                 *((volatile unsigned char*)(0x42704088UL))
#define bFM4_MFS2_CSIO_ESCR_WT0                *((volatile unsigned char*)(0x4270408CUL))
#define bFM4_MFS2_CSIO_ESCR_WT1                *((volatile unsigned char*)(0x42704090UL))
#define bFM4_MFS2_CSIO_ESCR_CSFE               *((volatile unsigned char*)(0x42704094UL))
#define bFM4_MFS2_CSIO_ESCR_L3                 *((volatile unsigned char*)(0x42704098UL))
#define bFM4_MFS2_CSIO_ESCR_SOP                *((volatile unsigned char*)(0x4270409CUL))
#define bFM4_MFS2_CSIO_SSR_TBI                 *((volatile unsigned char*)(0x427040A0UL))
#define bFM4_MFS2_CSIO_SSR_TDRE                *((volatile unsigned char*)(0x427040A4UL))
#define bFM4_MFS2_CSIO_SSR_RDRF                *((volatile unsigned char*)(0x427040A8UL))
#define bFM4_MFS2_CSIO_SSR_ORE                 *((volatile unsigned char*)(0x427040ACUL))
#define bFM4_MFS2_CSIO_SSR_AWC                 *((volatile unsigned char*)(0x427040B0UL))
#define bFM4_MFS2_CSIO_SSR_REC                 *((volatile unsigned char*)(0x427040BCUL))
#define bFM4_MFS2_CSIO_FCR_FE1                 *((volatile unsigned char*)(0x42704280UL))
#define bFM4_MFS2_CSIO_FCR_FE2                 *((volatile unsigned char*)(0x42704284UL))
#define bFM4_MFS2_CSIO_FCR_FCL1                *((volatile unsigned char*)(0x42704288UL))
#define bFM4_MFS2_CSIO_FCR_FCL2                *((volatile unsigned char*)(0x4270428CUL))
#define bFM4_MFS2_CSIO_FCR_FSET                *((volatile unsigned char*)(0x42704290UL))
#define bFM4_MFS2_CSIO_FCR_FLD                 *((volatile unsigned char*)(0x42704294UL))
#define bFM4_MFS2_CSIO_FCR_FLST                *((volatile unsigned char*)(0x42704298UL))
#define bFM4_MFS2_CSIO_FCR_FSEL                *((volatile unsigned char*)(0x427042A0UL))
#define bFM4_MFS2_CSIO_FCR_FTIE                *((volatile unsigned char*)(0x427042A4UL))
#define bFM4_MFS2_CSIO_FCR_FDRQ                *((volatile unsigned char*)(0x427042A8UL))
#define bFM4_MFS2_CSIO_FCR_FRIIE               *((volatile unsigned char*)(0x427042ACUL))
#define bFM4_MFS2_CSIO_FCR_FLSTE               *((volatile unsigned char*)(0x427042B0UL))
#define bFM4_MFS2_CSIO_FCR0_FE1                *((volatile unsigned char*)(0x42704280UL))
#define bFM4_MFS2_CSIO_FCR0_FE2                *((volatile unsigned char*)(0x42704284UL))
#define bFM4_MFS2_CSIO_FCR0_FCL1               *((volatile unsigned char*)(0x42704288UL))
#define bFM4_MFS2_CSIO_FCR0_FCL2               *((volatile unsigned char*)(0x4270428CUL))
#define bFM4_MFS2_CSIO_FCR0_FSET               *((volatile unsigned char*)(0x42704290UL))
#define bFM4_MFS2_CSIO_FCR0_FLD                *((volatile unsigned char*)(0x42704294UL))
#define bFM4_MFS2_CSIO_FCR0_FLST               *((volatile unsigned char*)(0x42704298UL))
#define bFM4_MFS2_CSIO_FCR1_FSEL               *((volatile unsigned char*)(0x427042A0UL))
#define bFM4_MFS2_CSIO_FCR1_FTIE               *((volatile unsigned char*)(0x427042A4UL))
#define bFM4_MFS2_CSIO_FCR1_FDRQ               *((volatile unsigned char*)(0x427042A8UL))
#define bFM4_MFS2_CSIO_FCR1_FRIIE              *((volatile unsigned char*)(0x427042ACUL))
#define bFM4_MFS2_CSIO_FCR1_FLSTE              *((volatile unsigned char*)(0x427042B0UL))
#define bFM4_MFS2_CSIO_FBYTE_FD0               *((volatile unsigned char*)(0x42704300UL))
#define bFM4_MFS2_CSIO_FBYTE_FD1               *((volatile unsigned char*)(0x42704304UL))
#define bFM4_MFS2_CSIO_FBYTE_FD2               *((volatile unsigned char*)(0x42704308UL))
#define bFM4_MFS2_CSIO_FBYTE_FD3               *((volatile unsigned char*)(0x4270430CUL))
#define bFM4_MFS2_CSIO_FBYTE_FD4               *((volatile unsigned char*)(0x42704310UL))
#define bFM4_MFS2_CSIO_FBYTE_FD5               *((volatile unsigned char*)(0x42704314UL))
#define bFM4_MFS2_CSIO_FBYTE_FD6               *((volatile unsigned char*)(0x42704318UL))
#define bFM4_MFS2_CSIO_FBYTE_FD7               *((volatile unsigned char*)(0x4270431CUL))
#define bFM4_MFS2_CSIO_FBYTE_FD8               *((volatile unsigned char*)(0x42704320UL))
#define bFM4_MFS2_CSIO_FBYTE_FD9               *((volatile unsigned char*)(0x42704324UL))
#define bFM4_MFS2_CSIO_FBYTE_FD10              *((volatile unsigned char*)(0x42704328UL))
#define bFM4_MFS2_CSIO_FBYTE_FD11              *((volatile unsigned char*)(0x4270432CUL))
#define bFM4_MFS2_CSIO_FBYTE_FD12              *((volatile unsigned char*)(0x42704330UL))
#define bFM4_MFS2_CSIO_FBYTE_FD13              *((volatile unsigned char*)(0x42704334UL))
#define bFM4_MFS2_CSIO_FBYTE_FD14              *((volatile unsigned char*)(0x42704338UL))
#define bFM4_MFS2_CSIO_FBYTE_FD15              *((volatile unsigned char*)(0x4270433CUL))
#define bFM4_MFS2_CSIO_FBYTE1_FD0              *((volatile unsigned char*)(0x42704300UL))
#define bFM4_MFS2_CSIO_FBYTE1_FD1              *((volatile unsigned char*)(0x42704304UL))
#define bFM4_MFS2_CSIO_FBYTE1_FD2              *((volatile unsigned char*)(0x42704308UL))
#define bFM4_MFS2_CSIO_FBYTE1_FD3              *((volatile unsigned char*)(0x4270430CUL))
#define bFM4_MFS2_CSIO_FBYTE1_FD4              *((volatile unsigned char*)(0x42704310UL))
#define bFM4_MFS2_CSIO_FBYTE1_FD5              *((volatile unsigned char*)(0x42704314UL))
#define bFM4_MFS2_CSIO_FBYTE1_FD6              *((volatile unsigned char*)(0x42704318UL))
#define bFM4_MFS2_CSIO_FBYTE1_FD7              *((volatile unsigned char*)(0x4270431CUL))
#define bFM4_MFS2_CSIO_FBYTE2_FD8              *((volatile unsigned char*)(0x42704320UL))
#define bFM4_MFS2_CSIO_FBYTE2_FD9              *((volatile unsigned char*)(0x42704324UL))
#define bFM4_MFS2_CSIO_FBYTE2_FD10             *((volatile unsigned char*)(0x42704328UL))
#define bFM4_MFS2_CSIO_FBYTE2_FD11             *((volatile unsigned char*)(0x4270432CUL))
#define bFM4_MFS2_CSIO_FBYTE2_FD12             *((volatile unsigned char*)(0x42704330UL))
#define bFM4_MFS2_CSIO_FBYTE2_FD13             *((volatile unsigned char*)(0x42704334UL))
#define bFM4_MFS2_CSIO_FBYTE2_FD14             *((volatile unsigned char*)(0x42704338UL))
#define bFM4_MFS2_CSIO_FBYTE2_FD15             *((volatile unsigned char*)(0x4270433CUL))
#define bFM4_MFS2_CSIO_SCSTR10_CSHD0           *((volatile unsigned char*)(0x42704380UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSHD1           *((volatile unsigned char*)(0x42704384UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSHD2           *((volatile unsigned char*)(0x42704388UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSHD3           *((volatile unsigned char*)(0x4270438CUL))
#define bFM4_MFS2_CSIO_SCSTR10_CSHD4           *((volatile unsigned char*)(0x42704390UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSHD5           *((volatile unsigned char*)(0x42704394UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSHD6           *((volatile unsigned char*)(0x42704398UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSHD7           *((volatile unsigned char*)(0x4270439CUL))
#define bFM4_MFS2_CSIO_SCSTR10_CSSU0           *((volatile unsigned char*)(0x427043A0UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSSU1           *((volatile unsigned char*)(0x427043A4UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSSU2           *((volatile unsigned char*)(0x427043A8UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSSU3           *((volatile unsigned char*)(0x427043ACUL))
#define bFM4_MFS2_CSIO_SCSTR10_CSSU4           *((volatile unsigned char*)(0x427043B0UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSSU5           *((volatile unsigned char*)(0x427043B4UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSSU6           *((volatile unsigned char*)(0x427043B8UL))
#define bFM4_MFS2_CSIO_SCSTR10_CSSU7           *((volatile unsigned char*)(0x427043BCUL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS0           *((volatile unsigned char*)(0x42704400UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS1           *((volatile unsigned char*)(0x42704404UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS2           *((volatile unsigned char*)(0x42704408UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS3           *((volatile unsigned char*)(0x4270440CUL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS4           *((volatile unsigned char*)(0x42704410UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS5           *((volatile unsigned char*)(0x42704414UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS6           *((volatile unsigned char*)(0x42704418UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS7           *((volatile unsigned char*)(0x4270441CUL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS8           *((volatile unsigned char*)(0x42704420UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS9           *((volatile unsigned char*)(0x42704424UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS10          *((volatile unsigned char*)(0x42704428UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS11          *((volatile unsigned char*)(0x4270442CUL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS12          *((volatile unsigned char*)(0x42704430UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS13          *((volatile unsigned char*)(0x42704434UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS14          *((volatile unsigned char*)(0x42704438UL))
#define bFM4_MFS2_CSIO_SCSTR32_CSDS15          *((volatile unsigned char*)(0x4270443CUL))
#define bFM4_MFS2_CSIO_SACSR_TMRE              *((volatile unsigned char*)(0x42704480UL))
#define bFM4_MFS2_CSIO_SACSR_TDIV0             *((volatile unsigned char*)(0x42704484UL))
#define bFM4_MFS2_CSIO_SACSR_TDIV1             *((volatile unsigned char*)(0x42704488UL))
#define bFM4_MFS2_CSIO_SACSR_TDIV2             *((volatile unsigned char*)(0x4270448CUL))
#define bFM4_MFS2_CSIO_SACSR_TDIV3             *((volatile unsigned char*)(0x42704490UL))
#define bFM4_MFS2_CSIO_SACSR_TSYNE             *((volatile unsigned char*)(0x42704498UL))
#define bFM4_MFS2_CSIO_SACSR_TINTE             *((volatile unsigned char*)(0x4270449CUL))
#define bFM4_MFS2_CSIO_SACSR_TINT              *((volatile unsigned char*)(0x427044A0UL))
#define bFM4_MFS2_CSIO_SACSR_CSE               *((volatile unsigned char*)(0x427044ACUL))
#define bFM4_MFS2_CSIO_SACSR_CSEIE             *((volatile unsigned char*)(0x427044B0UL))
#define bFM4_MFS2_CSIO_SACSR_TBEEN             *((volatile unsigned char*)(0x427044B4UL))
#define bFM4_MFS2_CSIO_STMR_TM0                *((volatile unsigned char*)(0x42704500UL))
#define bFM4_MFS2_CSIO_STMR_TM1                *((volatile unsigned char*)(0x42704504UL))
#define bFM4_MFS2_CSIO_STMR_TM2                *((volatile unsigned char*)(0x42704508UL))
#define bFM4_MFS2_CSIO_STMR_TM3                *((volatile unsigned char*)(0x4270450CUL))
#define bFM4_MFS2_CSIO_STMR_TM4                *((volatile unsigned char*)(0x42704510UL))
#define bFM4_MFS2_CSIO_STMR_TM5                *((volatile unsigned char*)(0x42704514UL))
#define bFM4_MFS2_CSIO_STMR_TM6                *((volatile unsigned char*)(0x42704518UL))
#define bFM4_MFS2_CSIO_STMR_TM7                *((volatile unsigned char*)(0x4270451CUL))
#define bFM4_MFS2_CSIO_STMR_TM8                *((volatile unsigned char*)(0x42704520UL))
#define bFM4_MFS2_CSIO_STMR_TM9                *((volatile unsigned char*)(0x42704524UL))
#define bFM4_MFS2_CSIO_STMR_TM10               *((volatile unsigned char*)(0x42704528UL))
#define bFM4_MFS2_CSIO_STMR_TM11               *((volatile unsigned char*)(0x4270452CUL))
#define bFM4_MFS2_CSIO_STMR_TM12               *((volatile unsigned char*)(0x42704530UL))
#define bFM4_MFS2_CSIO_STMR_TM13               *((volatile unsigned char*)(0x42704534UL))
#define bFM4_MFS2_CSIO_STMR_TM14               *((volatile unsigned char*)(0x42704538UL))
#define bFM4_MFS2_CSIO_STMR_TM15               *((volatile unsigned char*)(0x4270453CUL))
#define bFM4_MFS2_CSIO_STMCR_TC0               *((volatile unsigned char*)(0x42704580UL))
#define bFM4_MFS2_CSIO_STMCR_TC1               *((volatile unsigned char*)(0x42704584UL))
#define bFM4_MFS2_CSIO_STMCR_TC2               *((volatile unsigned char*)(0x42704588UL))
#define bFM4_MFS2_CSIO_STMCR_TC3               *((volatile unsigned char*)(0x4270458CUL))
#define bFM4_MFS2_CSIO_STMCR_TC4               *((volatile unsigned char*)(0x42704590UL))
#define bFM4_MFS2_CSIO_STMCR_TC5               *((volatile unsigned char*)(0x42704594UL))
#define bFM4_MFS2_CSIO_STMCR_TC6               *((volatile unsigned char*)(0x42704598UL))
#define bFM4_MFS2_CSIO_STMCR_TC7               *((volatile unsigned char*)(0x4270459CUL))
#define bFM4_MFS2_CSIO_STMCR_TC8               *((volatile unsigned char*)(0x427045A0UL))
#define bFM4_MFS2_CSIO_STMCR_TC9               *((volatile unsigned char*)(0x427045A4UL))
#define bFM4_MFS2_CSIO_STMCR_TC10              *((volatile unsigned char*)(0x427045A8UL))
#define bFM4_MFS2_CSIO_STMCR_TC11              *((volatile unsigned char*)(0x427045ACUL))
#define bFM4_MFS2_CSIO_STMCR_TC12              *((volatile unsigned char*)(0x427045B0UL))
#define bFM4_MFS2_CSIO_STMCR_TC13              *((volatile unsigned char*)(0x427045B4UL))
#define bFM4_MFS2_CSIO_STMCR_TC14              *((volatile unsigned char*)(0x427045B8UL))
#define bFM4_MFS2_CSIO_STMCR_TC15              *((volatile unsigned char*)(0x427045BCUL))
#define bFM4_MFS2_CSIO_SCSCR_CSOE              *((volatile unsigned char*)(0x42704600UL))
#define bFM4_MFS2_CSIO_SCSCR_CSEN0             *((volatile unsigned char*)(0x42704604UL))
#define bFM4_MFS2_CSIO_SCSCR_CSEN1             *((volatile unsigned char*)(0x42704608UL))
#define bFM4_MFS2_CSIO_SCSCR_CSEN2             *((volatile unsigned char*)(0x4270460CUL))
#define bFM4_MFS2_CSIO_SCSCR_CSEN3             *((volatile unsigned char*)(0x42704610UL))
#define bFM4_MFS2_CSIO_SCSCR_CSLVL             *((volatile unsigned char*)(0x42704614UL))
#define bFM4_MFS2_CSIO_SCSCR_CDIV0             *((volatile unsigned char*)(0x42704618UL))
#define bFM4_MFS2_CSIO_SCSCR_CDIV1             *((volatile unsigned char*)(0x4270461CUL))
#define bFM4_MFS2_CSIO_SCSCR_CDIV2             *((volatile unsigned char*)(0x42704620UL))
#define bFM4_MFS2_CSIO_SCSCR_SCAM              *((volatile unsigned char*)(0x42704624UL))
#define bFM4_MFS2_CSIO_SCSCR_SCD0              *((volatile unsigned char*)(0x42704628UL))
#define bFM4_MFS2_CSIO_SCSCR_SCD1              *((volatile unsigned char*)(0x4270462CUL))
#define bFM4_MFS2_CSIO_SCSCR_SED0              *((volatile unsigned char*)(0x42704630UL))
#define bFM4_MFS2_CSIO_SCSCR_SED1              *((volatile unsigned char*)(0x42704634UL))
#define bFM4_MFS2_CSIO_SCSCR_SST0              *((volatile unsigned char*)(0x42704638UL))
#define bFM4_MFS2_CSIO_SCSCR_SST1              *((volatile unsigned char*)(0x4270463CUL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1L0            *((volatile unsigned char*)(0x42704680UL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1L1            *((volatile unsigned char*)(0x42704684UL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1L2            *((volatile unsigned char*)(0x42704688UL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1L3            *((volatile unsigned char*)(0x4270468CUL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1L4            *((volatile unsigned char*)(0x42704690UL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1SPI           *((volatile unsigned char*)(0x42704694UL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1SCINV         *((volatile unsigned char*)(0x42704698UL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1CSLVL         *((volatile unsigned char*)(0x4270469CUL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2L0            *((volatile unsigned char*)(0x427046A0UL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2L1            *((volatile unsigned char*)(0x427046A4UL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2L2            *((volatile unsigned char*)(0x427046A8UL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2L3            *((volatile unsigned char*)(0x427046ACUL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2L4            *((volatile unsigned char*)(0x427046B0UL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2SPI           *((volatile unsigned char*)(0x427046B4UL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2SCINV         *((volatile unsigned char*)(0x427046B8UL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2CSLVL         *((volatile unsigned char*)(0x427046BCUL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3L0            *((volatile unsigned char*)(0x42704700UL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3L1            *((volatile unsigned char*)(0x42704704UL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3L2            *((volatile unsigned char*)(0x42704708UL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3L3            *((volatile unsigned char*)(0x4270470CUL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3L4            *((volatile unsigned char*)(0x42704710UL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3SPI           *((volatile unsigned char*)(0x42704714UL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3SCINV         *((volatile unsigned char*)(0x42704718UL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3CSLVL         *((volatile unsigned char*)(0x4270471CUL))


