MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
/* MFS CSIO channel 5 registers */
#define bFM4_MFS5_CSIO_SMR_SOE                 *((volatile unsigned char*)(0x4270A000UL))
#define bFM4_MFS5_CSIO_SMR_SCKE                *((volatile unsigned char*)(0x4270A004UL))
#define bFM4_MFS5_CSIO_SMR_BDS                 *((volatile unsigned char*)(0x4270A008UL))
#define bFM4_MFS5_CSIO_SMR_SCINV               *((volatile unsigned char*)(0x4270A00CUL))
#define bFM4_MFS5_CSIO_SMR_MD0                 *((volatile unsigned char*)(0x4270A014UL))
#define bFM4_MFS5_CSIO_SMR_MD1                 *((volatile unsigned char*)(0x4270A018UL))
#define bFM4_MFS5_CSIO_SMR_MD2                 *((volatile unsigned char*)(0x4270A01CUL))
#define bFM4_MFS5_CSIO_SCR_TXE                 *((volatile unsigned char*)(0x4270A020UL))
#define bFM4_MFS5_CSIO_SCR_RXE                 *((volatile unsigned char*)(0x4270A024UL))
#define bFM4_MFS5_CSIO_SCR_TBIE                *((volatile unsigned char*)(0x4270A028UL))
#define bFM4_MFS5_CSIO_SCR_TIE                 *((volatile unsigned char*)(0x4270A02CUL))
#define bFM4_MFS5_CSIO_SCR_RIE                 *((volatile unsigned char*)(0x4270A030UL))
#define bFM4_MFS5_CSIO_SCR_SPI                 *((volatile unsigned char*)(0x4270A034UL))
#define bFM4_MFS5_CSIO_SCR_MS                  *((volatile unsigned char*)(0x4270A038UL))
#define bFM4_MFS5_CSIO_SCR_UPCL                *((volatile unsigned char*)(0x4270A03CUL))
#define bFM4_MFS5_CSIO_ESCR_L0                 *((volatile unsigned char*)(0x4270A080UL))
#define bFM4_MFS5_CSIO_ESCR_L1                 *((volatile unsigned char*)(0x4270A084UL))
#define bFM4_MFS5_CSIO_ESCR_L2                 *((volatile unsigned char*)(0x4270A088UL))
#define bFM4_MFS5_CSIO_ESCR_WT0                *((volatile unsigned char*)(0x4270A08CUL))
#define bFM4_MFS5_CSIO_ESCR_WT1                *((volatile unsigned char*)(0x4270A090UL))
#define bFM4_MFS5_CSIO_ESCR_CSFE               *((volatile unsigned char*)(0x4270A094UL))
#define bFM4_MFS5_CSIO_ESCR_L3                 *((volatile unsigned char*)(0x4270A098UL))
#define bFM4_MFS5_CSIO_ESCR_SOP                *((volatile unsigned char*)(0x4270A09CUL))
#define bFM4_MFS5_CSIO_SSR_TBI                 *((volatile unsigned char*)(0x4270A0A0UL))
#define bFM4_MFS5_CSIO_SSR_TDRE                *((volatile unsigned char*)(0x4270A0A4UL))
#define bFM4_MFS5_CSIO_SSR_RDRF                *((volatile unsigned char*)(0x4270A0A8UL))
#define bFM4_MFS5_CSIO_SSR_ORE                 *((volatile unsigned char*)(0x4270A0ACUL))
#define bFM4_MFS5_CSIO_SSR_AWC                 *((volatile unsigned char*)(0x4270A0B0UL))
#define bFM4_MFS5_CSIO_SSR_REC                 *((volatile unsigned char*)(0x4270A0BCUL))
#define bFM4_MFS5_CSIO_FCR_FE1                 *((volatile unsigned char*)(0x4270A280UL))
#define bFM4_MFS5_CSIO_FCR_FE2                 *((volatile unsigned char*)(0x4270A284UL))
#define bFM4_MFS5_CSIO_FCR_FCL1                *((volatile unsigned char*)(0x4270A288UL))
#define bFM4_MFS5_CSIO_FCR_FCL2                *((volatile unsigned char*)(0x4270A28CUL))
#define bFM4_MFS5_CSIO_FCR_FSET                *((volatile unsigned char*)(0x4270A290UL))
#define bFM4_MFS5_CSIO_FCR_FLD                 *((volatile unsigned char*)(0x4270A294UL))
#define bFM4_MFS5_CSIO_FCR_FLST                *((volatile unsigned char*)(0x4270A298UL))
#define bFM4_MFS5_CSIO_FCR_FSEL                *((volatile unsigned char*)(0x4270A2A0UL))
#define bFM4_MFS5_CSIO_FCR_FTIE                *((volatile unsigned char*)(0x4270A2A4UL))
#define bFM4_MFS5_CSIO_FCR_FDRQ                *((volatile unsigned char*)(0x4270A2A8UL))
#define bFM4_MFS5_CSIO_FCR_FRIIE               *((volatile unsigned char*)(0x4270A2ACUL))
#define bFM4_MFS5_CSIO_FCR_FLSTE               *((volatile unsigned char*)(0x4270A2B0UL))
#define bFM4_MFS5_CSIO_FCR0_FE1                *((volatile unsigned char*)(0x4270A280UL))
#define bFM4_MFS5_CSIO_FCR0_FE2                *((volatile unsigned char*)(0x4270A284UL))
#define bFM4_MFS5_CSIO_FCR0_FCL1               *((volatile unsigned char*)(0x4270A288UL))
#define bFM4_MFS5_CSIO_FCR0_FCL2               *((volatile unsigned char*)(0x4270A28CUL))
#define bFM4_MFS5_CSIO_FCR0_FSET               *((volatile unsigned char*)(0x4270A290UL))
#define bFM4_MFS5_CSIO_FCR0_FLD                *((volatile unsigned char*)(0x4270A294UL))
#define bFM4_MFS5_CSIO_FCR0_FLST               *((volatile unsigned char*)(0x4270A298UL))
#define bFM4_MFS5_CSIO_FCR1_FSEL               *((volatile unsigned char*)(0x4270A2A0UL))
#define bFM4_MFS5_CSIO_FCR1_FTIE               *((volatile unsigned char*)(0x4270A2A4UL))
#define bFM4_MFS5_CSIO_FCR1_FDRQ               *((volatile unsigned char*)(0x4270A2A8UL))
#define bFM4_MFS5_CSIO_FCR1_FRIIE              *((volatile unsigned char*)(0x4270A2ACUL))
#define bFM4_MFS5_CSIO_FCR1_FLSTE              *((volatile unsigned char*)(0x4270A2B0UL))
#define bFM4_MFS5_CSIO_FBYTE_FD0               *((volatile unsigned char*)(0x4270A300UL))
#define bFM4_MFS5_CSIO_FBYTE_FD1               *((volatile unsigned char*)(0x4270A304UL))
#define bFM4_MFS5_CSIO_FBYTE_FD2               *((volatile unsigned char*)(0x4270A308UL))
#define bFM4_MFS5_CSIO_FBYTE_FD3               *((volatile unsigned char*)(0x4270A30CUL))
#define bFM4_MFS5_CSIO_FBYTE_FD4               *((volatile unsigned char*)(0x4270A310UL))
#define bFM4_MFS5_CSIO_FBYTE_FD5               *((volatile unsigned char*)(0x4270A314UL))
#define bFM4_MFS5_CSIO_FBYTE_FD6               *((volatile unsigned char*)(0x4270A318UL))
#define bFM4_MFS5_CSIO_FBYTE_FD7               *((volatile unsigned char*)(0x4270A31CUL))
#define bFM4_MFS5_CSIO_FBYTE_FD8               *((volatile unsigned char*)(0x4270A320UL))
#define bFM4_MFS5_CSIO_FBYTE_FD9               *((volatile unsigned char*)(0x4270A324UL))
#define bFM4_MFS5_CSIO_FBYTE_FD10              *((volatile unsigned char*)(0x4270A328UL))
#define bFM4_MFS5_CSIO_FBYTE_FD11              *((volatile unsigned char*)(0x4270A32CUL))
#define bFM4_MFS5_CSIO_FBYTE_FD12              *((volatile unsigned char*)(0x4270A330UL))
#define bFM4_MFS5_CSIO_FBYTE_FD13              *((volatile unsigned char*)(0x4270A334UL))
#define bFM4_MFS5_CSIO_FBYTE_FD14              *((volatile unsigned char*)(0x4270A338UL))
#define bFM4_MFS5_CSIO_FBYTE_FD15              *((volatile unsigned char*)(0x4270A33CUL))
#define bFM4_MFS5_CSIO_FBYTE1_FD0              *((volatile unsigned char*)(0x4270A300UL))
#define bFM4_MFS5_CSIO_FBYTE1_FD1              *((volatile unsigned char*)(0x4270A304UL))
#define bFM4_MFS5_CSIO_FBYTE1_FD2              *((volatile unsigned char*)(0x4270A308UL))
#define bFM4_MFS5_CSIO_FBYTE1_FD3              *((volatile unsigned char*)(0x4270A30CUL))
#define bFM4_MFS5_CSIO_FBYTE1_FD4              *((volatile unsigned char*)(0x4270A310UL))
#define bFM4_MFS5_CSIO_FBYTE1_FD5              *((volatile unsigned char*)(0x4270A314UL))
#define bFM4_MFS5_CSIO_FBYTE1_FD6              *((volatile unsigned char*)(0x4270A318UL))
#define bFM4_MFS5_CSIO_FBYTE1_FD7              *((volatile unsigned char*)(0x4270A31CUL))
#define bFM4_MFS5_CSIO_FBYTE2_FD8              *((volatile unsigned char*)(0x4270A320UL))
#define bFM4_MFS5_CSIO_FBYTE2_FD9              *((volatile unsigned char*)(0x4270A324UL))
#define bFM4_MFS5_CSIO_FBYTE2_FD10             *((volatile unsigned char*)(0x4270A328UL))
#define bFM4_MFS5_CSIO_FBYTE2_FD11             *((volatile unsigned char*)(0x4270A32CUL))
#define bFM4_MFS5_CSIO_FBYTE2_FD12             *((volatile unsigned char*)(0x4270A330UL))
#define bFM4_MFS5_CSIO_FBYTE2_FD13             *((volatile unsigned char*)(0x4270A334UL))
#define bFM4_MFS5_CSIO_FBYTE2_FD14             *((volatile unsigned char*)(0x4270A338UL))
#define bFM4_MFS5_CSIO_FBYTE2_FD15             *((volatile unsigned char*)(0x4270A33CUL))
#define bFM4_MFS5_CSIO_SCSTR10_CSHD0           *((volatile unsigned char*)(0x4270A380UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSHD1           *((volatile unsigned char*)(0x4270A384UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSHD2           *((volatile unsigned char*)(0x4270A388UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSHD3           *((volatile unsigned char*)(0x4270A38CUL))
#define bFM4_MFS5_CSIO_SCSTR10_CSHD4           *((volatile unsigned char*)(0x4270A390UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSHD5           *((volatile unsigned char*)(0x4270A394UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSHD6           *((volatile unsigned char*)(0x4270A398UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSHD7           *((volatile unsigned char*)(0x4270A39CUL))
#define bFM4_MFS5_CSIO_SCSTR10_CSSU0           *((volatile unsigned char*)(0x4270A3A0UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSSU1           *((volatile unsigned char*)(0x4270A3A4UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSSU2           *((volatile unsigned char*)(0x4270A3A8UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSSU3           *((volatile unsigned char*)(0x4270A3ACUL))
#define bFM4_MFS5_CSIO_SCSTR10_CSSU4           *((volatile unsigned char*)(0x4270A3B0UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSSU5           *((volatile unsigned char*)(0x4270A3B4UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSSU6           *((volatile unsigned char*)(0x4270A3B8UL))
#define bFM4_MFS5_CSIO_SCSTR10_CSSU7           *((volatile unsigned char*)(0x4270A3BCUL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS0           *((volatile unsigned char*)(0x4270A400UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS1           *((volatile unsigned char*)(0x4270A404UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS2           *((volatile unsigned char*)(0x4270A408UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS3           *((volatile unsigned char*)(0x4270A40CUL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS4           *((volatile unsigned char*)(0x4270A410UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS5           *((volatile unsigned char*)(0x4270A414UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS6           *((volatile unsigned char*)(0x4270A418UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS7           *((volatile unsigned char*)(0x4270A41CUL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS8           *((volatile unsigned char*)(0x4270A420UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS9           *((volatile unsigned char*)(0x4270A424UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS10          *((volatile unsigned char*)(0x4270A428UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS11          *((volatile unsigned char*)(0x4270A42CUL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS12          *((volatile unsigned char*)(0x4270A430UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS13          *((volatile unsigned char*)(0x4270A434UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS14          *((volatile unsigned char*)(0x4270A438UL))
#define bFM4_MFS5_CSIO_SCSTR32_CSDS15          *((volatile unsigned char*)(0x4270A43CUL))
#define bFM4_MFS5_CSIO_SACSR_TMRE              *((volatile unsigned char*)(0x4270A480UL))
#define bFM4_MFS5_CSIO_SACSR_TDIV0             *((volatile unsigned char*)(0x4270A484UL))
#define bFM4_MFS5_CSIO_SACSR_TDIV1             *((volatile unsigned char*)(0x4270A488UL))
#define bFM4_MFS5_CSIO_SACSR_TDIV2             *((volatile unsigned char*)(0x4270A48CUL))
#define bFM4_MFS5_CSIO_SACSR_TDIV3             *((volatile unsigned char*)(0x4270A490UL))
#define bFM4_MFS5_CSIO_SACSR_TSYNE             *((volatile unsigned char*)(0x4270A498UL))
#define bFM4_MFS5_CSIO_SACSR_TINTE             *((volatile unsigned char*)(0x4270A49CUL))
#define bFM4_MFS5_CSIO_SACSR_TINT              *((volatile unsigned char*)(0x4270A4A0UL))
#define bFM4_MFS5_CSIO_SACSR_CSE               *((volatile unsigned char*)(0x4270A4ACUL))
#define bFM4_MFS5_CSIO_SACSR_CSEIE             *((volatile unsigned char*)(0x4270A4B0UL))
#define bFM4_MFS5_CSIO_SACSR_TBEEN             *((volatile unsigned char*)(0x4270A4B4UL))
#define bFM4_MFS5_CSIO_STMR_TM0                *((volatile unsigned char*)(0x4270A500UL))
#define bFM4_MFS5_CSIO_STMR_TM1                *((volatile unsigned char*)(0x4270A504UL))
#define bFM4_MFS5_CSIO_STMR_TM2                *((volatile unsigned char*)(0x4270A508UL))
#define bFM4_MFS5_CSIO_STMR_TM3                *((volatile unsigned char*)(0x4270A50CUL))
#define bFM4_MFS5_CSIO_STMR_TM4                *((volatile unsigned char*)(0x4270A510UL))
#define bFM4_MFS5_CSIO_STMR_TM5                *((volatile unsigned char*)(0x4270A514UL))
#define bFM4_MFS5_CSIO_STMR_TM6                *((volatile unsigned char*)(0x4270A518UL))
#define bFM4_MFS5_CSIO_STMR_TM7                *((volatile unsigned char*)(0x4270A51CUL))
#define bFM4_MFS5_CSIO_STMR_TM8                *((volatile unsigned char*)(0x4270A520UL))
#define bFM4_MFS5_CSIO_STMR_TM9                *((volatile unsigned char*)(0x4270A524UL))
#define bFM4_MFS5_CSIO_STMR_TM10               *((volatile unsigned char*)(0x4270A528UL))
#define bFM4_MFS5_CSIO_STMR_TM11               *((volatile unsigned char*)(0x4270A52CUL))
#define bFM4_MFS5_CSIO_STMR_TM12               *((volatile unsigned char*)(0x4270A530UL))
#define bFM4_MFS5_CSIO_STMR_TM13               *((volatile unsigned char*)(0x4270A534UL))
#define bFM4_MFS5_CSIO_STMR_TM14               *((volatile unsigned char*)(0x4270A538UL))
#define bFM4_MFS5_CSIO_STMR_TM15               *((volatile unsigned char*)(0x4270A53CUL))
#define bFM4_MFS5_CSIO_STMCR_TC0               *((volatile unsigned char*)(0x4270A580UL))
#define bFM4_MFS5_CSIO_STMCR_TC1               *((volatile unsigned char*)(0x4270A584UL))
#define bFM4_MFS5_CSIO_STMCR_TC2               *((volatile unsigned char*)(0x4270A588UL))
#define bFM4_MFS5_CSIO_STMCR_TC3               *((volatile unsigned char*)(0x4270A58CUL))
#define bFM4_MFS5_CSIO_STMCR_TC4               *((volatile unsigned char*)(0x4270A590UL))
#define bFM4_MFS5_CSIO_STMCR_TC5               *((volatile unsigned char*)(0x4270A594UL))
#define bFM4_MFS5_CSIO_STMCR_TC6               *((volatile unsigned char*)(0x4270A598UL))
#define bFM4_MFS5_CSIO_STMCR_TC7               *((volatile unsigned char*)(0x4270A59CUL))
#define bFM4_MFS5_CSIO_STMCR_TC8               *((volatile unsigned char*)(0x4270A5A0UL))
#define bFM4_MFS5_CSIO_STMCR_TC9               *((volatile unsigned char*)(0x4270A5A4UL))
#define bFM4_MFS5_CSIO_STMCR_TC10              *((volatile unsigned char*)(0x4270A5A8UL))
#define bFM4_MFS5_CSIO_STMCR_TC11              *((volatile unsigned char*)(0x4270A5ACUL))
#define bFM4_MFS5_CSIO_STMCR_TC12              *((volatile unsigned char*)(0x4270A5B0UL))
#define bFM4_MFS5_CSIO_STMCR_TC13              *((volatile unsigned char*)(0x4270A5B4UL))
#define bFM4_MFS5_CSIO_STMCR_TC14              *((volatile unsigned char*)(0x4270A5B8UL))
#define bFM4_MFS5_CSIO_STMCR_TC15              *((volatile unsigned char*)(0x4270A5BCUL))
#define bFM4_MFS5_CSIO_SCSCR_CSOE              *((volatile unsigned char*)(0x4270A600UL))
#define bFM4_MFS5_CSIO_SCSCR_CSEN0             *((volatile unsigned char*)(0x4270A604UL))
#define bFM4_MFS5_CSIO_SCSCR_CSEN1             *((volatile unsigned char*)(0x4270A608UL))
#define bFM4_MFS5_CSIO_SCSCR_CSEN2             *((volatile unsigned char*)(0x4270A60CUL))
#define bFM4_MFS5_CSIO_SCSCR_CSEN3             *((volatile unsigned char*)(0x4270A610UL))
#define bFM4_MFS5_CSIO_SCSCR_CSLVL             *((volatile unsigned char*)(0x4270A614UL))
#define bFM4_MFS5_CSIO_SCSCR_CDIV0             *((volatile unsigned char*)(0x4270A618UL))
#define bFM4_MFS5_CSIO_SCSCR_CDIV1             *((volatile unsigned char*)(0x4270A61CUL))
#define bFM4_MFS5_CSIO_SCSCR_CDIV2             *((volatile unsigned char*)(0x4270A620UL))
#define bFM4_MFS5_CSIO_SCSCR_SCAM              *((volatile unsigned char*)(0x4270A624UL))
#define bFM4_MFS5_CSIO_SCSCR_SCD0              *((volatile unsigned char*)(0x4270A628UL))
#define bFM4_MFS5_CSIO_SCSCR_SCD1              *((volatile unsigned char*)(0x4270A62CUL))
#define bFM4_MFS5_CSIO_SCSCR_SED0              *((volatile unsigned char*)(0x4270A630UL))
#define bFM4_MFS5_CSIO_SCSCR_SED1              *((volatile unsigned char*)(0x4270A634UL))
#define bFM4_MFS5_CSIO_SCSCR_SST0              *((volatile unsigned char*)(0x4270A638UL))
#define bFM4_MFS5_CSIO_SCSCR_SST1              *((volatile unsigned char*)(0x4270A63CUL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1L0            *((volatile unsigned char*)(0x4270A680UL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1L1            *((volatile unsigned char*)(0x4270A684UL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1L2            *((volatile unsigned char*)(0x4270A688UL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1L3            *((volatile unsigned char*)(0x4270A68CUL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1L4            *((volatile unsigned char*)(0x4270A690UL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1SPI           *((volatile unsigned char*)(0x4270A694UL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1SCINV         *((volatile unsigned char*)(0x4270A698UL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1CSLVL         *((volatile unsigned char*)(0x4270A69CUL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2L0            *((volatile unsigned char*)(0x4270A6A0UL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2L1            *((volatile unsigned char*)(0x4270A6A4UL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2L2            *((volatile unsigned char*)(0x4270A6A8UL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2L3            *((volatile unsigned char*)(0x4270A6ACUL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2L4            *((volatile unsigned char*)(0x4270A6B0UL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2SPI           *((volatile unsigned char*)(0x4270A6B4UL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2SCINV         *((volatile unsigned char*)(0x4270A6B8UL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2CSLVL         *((volatile unsigned char*)(0x4270A6BCUL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3L0            *((volatile unsigned char*)(0x4270A700UL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3L1            *((volatile unsigned char*)(0x4270A704UL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3L2            *((volatile unsigned char*)(0x4270A708UL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3L3            *((volatile unsigned char*)(0x4270A70CUL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3L4            *((volatile unsigned char*)(0x4270A710UL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3SPI           *((volatile unsigned char*)(0x4270A714UL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3SCINV         *((volatile unsigned char*)(0x4270A718UL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3CSLVL         *((volatile unsigned char*)(0x4270A71CUL))

