MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
/* MFS UART channel 9 registers */
#define bFM4_MFS9_UART_SMR_SOE                 *((volatile unsigned char*)(0x42712000UL))
#define bFM4_MFS9_UART_SMR_BDS                 *((volatile unsigned char*)(0x42712008UL))
#define bFM4_MFS9_UART_SMR_SBL                 *((volatile unsigned char*)(0x4271200CUL))
#define bFM4_MFS9_UART_SMR_WUCR                *((volatile unsigned char*)(0x42712010UL))
#define bFM4_MFS9_UART_SMR_MD0                 *((volatile unsigned char*)(0x42712014UL))
#define bFM4_MFS9_UART_SMR_MD1                 *((volatile unsigned char*)(0x42712018UL))
#define bFM4_MFS9_UART_SMR_MD2                 *((volatile unsigned char*)(0x4271201CUL))
#define bFM4_MFS9_UART_SCR_TXE                 *((volatile unsigned char*)(0x42712020UL))
#define bFM4_MFS9_UART_SCR_RXE                 *((volatile unsigned char*)(0x42712024UL))
#define bFM4_MFS9_UART_SCR_TBIE                *((volatile unsigned char*)(0x42712028UL))
#define bFM4_MFS9_UART_SCR_TIE                 *((volatile unsigned char*)(0x4271202CUL))
#define bFM4_MFS9_UART_SCR_RIE                 *((volatile unsigned char*)(0x42712030UL))
#define bFM4_MFS9_UART_SCR_UPCL                *((volatile unsigned char*)(0x4271203CUL))
#define bFM4_MFS9_UART_ESCR_L0                 *((volatile unsigned char*)(0x42712080UL))
#define bFM4_MFS9_UART_ESCR_L1                 *((volatile unsigned char*)(0x42712084UL))
#define bFM4_MFS9_UART_ESCR_L2                 *((volatile unsigned char*)(0x42712088UL))
#define bFM4_MFS9_UART_ESCR_P                  *((volatile unsigned char*)(0x4271208CUL))
#define bFM4_MFS9_UART_ESCR_PEN                *((volatile unsigned char*)(0x42712090UL))
#define bFM4_MFS9_UART_ESCR_INV                *((volatile unsigned char*)(0x42712094UL))
#define bFM4_MFS9_UART_ESCR_ESBL               *((volatile unsigned char*)(0x42712098UL))
#define bFM4_MFS9_UART_ESCR_FLWEN              *((volatile unsigned char*)(0x4271209CUL))
#define bFM4_MFS9_UART_SSR_TBI                 *((volatile unsigned char*)(0x427120A0UL))
#define bFM4_MFS9_UART_SSR_TDRE                *((volatile unsigned char*)(0x427120A4UL))
#define bFM4_MFS9_UART_SSR_RDRF                *((volatile unsigned char*)(0x427120A8UL))
#define bFM4_MFS9_UART_SSR_ORE                 *((volatile unsigned char*)(0x427120ACUL))
#define bFM4_MFS9_UART_SSR_FRE                 *((volatile unsigned char*)(0x427120B0UL))
#define bFM4_MFS9_UART_SSR_PE                  *((volatile unsigned char*)(0x427120B4UL))
#define bFM4_MFS9_UART_SSR_REC                 *((volatile unsigned char*)(0x427120BCUL))
#define bFM4_MFS9_UART_BGR_EXT                 *((volatile unsigned char*)(0x427121BCUL))
#define bFM4_MFS9_UART_BGR1_EXT                *((volatile unsigned char*)(0x427121BCUL))
#define bFM4_MFS9_UART_FCR_FE1                 *((volatile unsigned char*)(0x42712280UL))
#define bFM4_MFS9_UART_FCR_FE2                 *((volatile unsigned char*)(0x42712284UL))
#define bFM4_MFS9_UART_FCR_FCL1                *((volatile unsigned char*)(0x42712288UL))
#define bFM4_MFS9_UART_FCR_FCL2                *((volatile unsigned char*)(0x4271228CUL))
#define bFM4_MFS9_UART_FCR_FSET                *((volatile unsigned char*)(0x42712290UL))
#define bFM4_MFS9_UART_FCR_FLD                 *((volatile unsigned char*)(0x42712294UL))
#define bFM4_MFS9_UART_FCR_FLST                *((volatile unsigned char*)(0x42712298UL))
#define bFM4_MFS9_UART_FCR_FSEL                *((volatile unsigned char*)(0x427122A0UL))
#define bFM4_MFS9_UART_FCR_FTIE                *((volatile unsigned char*)(0x427122A4UL))
#define bFM4_MFS9_UART_FCR_FDRQ                *((volatile unsigned char*)(0x427122A8UL))
#define bFM4_MFS9_UART_FCR_FRIIE               *((volatile unsigned char*)(0x427122ACUL))
#define bFM4_MFS9_UART_FCR_FLSTE               *((volatile unsigned char*)(0x427122B0UL))
#define bFM4_MFS9_UART_FCR0_FE1                *((volatile unsigned char*)(0x42712280UL))
#define bFM4_MFS9_UART_FCR0_FE2                *((volatile unsigned char*)(0x42712284UL))
#define bFM4_MFS9_UART_FCR0_FCL1               *((volatile unsigned char*)(0x42712288UL))
#define bFM4_MFS9_UART_FCR0_FCL2               *((volatile unsigned char*)(0x4271228CUL))
#define bFM4_MFS9_UART_FCR0_FSET               *((volatile unsigned char*)(0x42712290UL))
#define bFM4_MFS9_UART_FCR0_FLD                *((volatile unsigned char*)(0x42712294UL))
#define bFM4_MFS9_UART_FCR0_FLST               *((volatile unsigned char*)(0x42712298UL))
#define bFM4_MFS9_UART_FCR1_FSEL               *((volatile unsigned char*)(0x427122A0UL))
#define bFM4_MFS9_UART_FCR1_FTIE               *((volatile unsigned char*)(0x427122A4UL))
#define bFM4_MFS9_UART_FCR1_FDRQ               *((volatile unsigned char*)(0x427122A8UL))
#define bFM4_MFS9_UART_FCR1_FRIIE              *((volatile unsigned char*)(0x427122ACUL))
#define bFM4_MFS9_UART_FCR1_FLSTE              *((volatile unsigned char*)(0x427122B0UL))
#define bFM4_MFS9_UART_FBYTE_FD0               *((volatile unsigned char*)(0x42712300UL))
#define bFM4_MFS9_UART_FBYTE_FD1               *((volatile unsigned char*)(0x42712304UL))
#define bFM4_MFS9_UART_FBYTE_FD2               *((volatile unsigned char*)(0x42712308UL))
#define bFM4_MFS9_UART_FBYTE_FD3               *((volatile unsigned char*)(0x4271230CUL))
#define bFM4_MFS9_UART_FBYTE_FD4               *((volatile unsigned char*)(0x42712310UL))
#define bFM4_MFS9_UART_FBYTE_FD5               *((volatile unsigned char*)(0x42712314UL))
#define bFM4_MFS9_UART_FBYTE_FD6               *((volatile unsigned char*)(0x42712318UL))
#define bFM4_MFS9_UART_FBYTE_FD7               *((volatile unsigned char*)(0x4271231CUL))
#define bFM4_MFS9_UART_FBYTE_FD8               *((volatile unsigned char*)(0x42712320UL))
#define bFM4_MFS9_UART_FBYTE_FD9               *((volatile unsigned char*)(0x42712324UL))
#define bFM4_MFS9_UART_FBYTE_FD10              *((volatile unsigned char*)(0x42712328UL))
#define bFM4_MFS9_UART_FBYTE_FD11              *((volatile unsigned char*)(0x4271232CUL))
#define bFM4_MFS9_UART_FBYTE_FD12              *((volatile unsigned char*)(0x42712330UL))
#define bFM4_MFS9_UART_FBYTE_FD13              *((volatile unsigned char*)(0x42712334UL))
#define bFM4_MFS9_UART_FBYTE_FD14              *((volatile unsigned char*)(0x42712338UL))
#define bFM4_MFS9_UART_FBYTE_FD15              *((volatile unsigned char*)(0x4271233CUL))
#define bFM4_MFS9_UART_FBYTE1_FD0              *((volatile unsigned char*)(0x42712300UL))
#define bFM4_MFS9_UART_FBYTE1_FD1              *((volatile unsigned char*)(0x42712304UL))
#define bFM4_MFS9_UART_FBYTE1_FD2              *((volatile unsigned char*)(0x42712308UL))
#define bFM4_MFS9_UART_FBYTE1_FD3              *((volatile unsigned char*)(0x4271230CUL))
#define bFM4_MFS9_UART_FBYTE1_FD4              *((volatile unsigned char*)(0x42712310UL))
#define bFM4_MFS9_UART_FBYTE1_FD5              *((volatile unsigned char*)(0x42712314UL))
#define bFM4_MFS9_UART_FBYTE1_FD6              *((volatile unsigned char*)(0x42712318UL))
#define bFM4_MFS9_UART_FBYTE1_FD7              *((volatile unsigned char*)(0x4271231CUL))
#define bFM4_MFS9_UART_FBYTE2_FD8              *((volatile unsigned char*)(0x42712320UL))
#define bFM4_MFS9_UART_FBYTE2_FD9              *((volatile unsigned char*)(0x42712324UL))
#define bFM4_MFS9_UART_FBYTE2_FD10             *((volatile unsigned char*)(0x42712328UL))
#define bFM4_MFS9_UART_FBYTE2_FD11             *((volatile unsigned char*)(0x4271232CUL))
#define bFM4_MFS9_UART_FBYTE2_FD12             *((volatile unsigned char*)(0x42712330UL))
#define bFM4_MFS9_UART_FBYTE2_FD13             *((volatile unsigned char*)(0x42712334UL))
#define bFM4_MFS9_UART_FBYTE2_FD14             *((volatile unsigned char*)(0x42712338UL))
#define bFM4_MFS9_UART_FBYTE2_FD15             *((volatile unsigned char*)(0x4271233CUL))

