MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
/* MFS LIN channel 13 registers */
#define bFM4_MFS13_LIN_SMR_SOE                 *((volatile unsigned char*)(0x4271A000UL))
#define bFM4_MFS13_LIN_SMR_SBL                 *((volatile unsigned char*)(0x4271A00CUL))
#define bFM4_MFS13_LIN_SMR_WUCR                *((volatile unsigned char*)(0x4271A010UL))
#define bFM4_MFS13_LIN_SMR_MD0                 *((volatile unsigned char*)(0x4271A014UL))
#define bFM4_MFS13_LIN_SMR_MD1                 *((volatile unsigned char*)(0x4271A018UL))
#define bFM4_MFS13_LIN_SMR_MD2                 *((volatile unsigned char*)(0x4271A01CUL))
#define bFM4_MFS13_LIN_SCR_TXE                 *((volatile unsigned char*)(0x4271A020UL))
#define bFM4_MFS13_LIN_SCR_RXE                 *((volatile unsigned char*)(0x4271A024UL))
#define bFM4_MFS13_LIN_SCR_TBIE                *((volatile unsigned char*)(0x4271A028UL))
#define bFM4_MFS13_LIN_SCR_TIE                 *((volatile unsigned char*)(0x4271A02CUL))
#define bFM4_MFS13_LIN_SCR_RIE                 *((volatile unsigned char*)(0x4271A030UL))
#define bFM4_MFS13_LIN_SCR_LBR                 *((volatile unsigned char*)(0x4271A034UL))
#define bFM4_MFS13_LIN_SCR_MS                  *((volatile unsigned char*)(0x4271A038UL))
#define bFM4_MFS13_LIN_SCR_UPCL                *((volatile unsigned char*)(0x4271A03CUL))
#define bFM4_MFS13_LIN_ESCR_DEL0               *((volatile unsigned char*)(0x4271A080UL))
#define bFM4_MFS13_LIN_ESCR_DEL1               *((volatile unsigned char*)(0x4271A084UL))
#define bFM4_MFS13_LIN_ESCR_LBL0               *((volatile unsigned char*)(0x4271A088UL))
#define bFM4_MFS13_LIN_ESCR_LBL1               *((volatile unsigned char*)(0x4271A08CUL))
#define bFM4_MFS13_LIN_ESCR_LBIE               *((volatile unsigned char*)(0x4271A090UL))
#define bFM4_MFS13_LIN_ESCR_ESBL               *((volatile unsigned char*)(0x4271A098UL))
#define bFM4_MFS13_LIN_SSR_TBI                 *((volatile unsigned char*)(0x4271A0A0UL))
#define bFM4_MFS13_LIN_SSR_TDRE                *((volatile unsigned char*)(0x4271A0A4UL))
#define bFM4_MFS13_LIN_SSR_RDRF                *((volatile unsigned char*)(0x4271A0A8UL))
#define bFM4_MFS13_LIN_SSR_ORE                 *((volatile unsigned char*)(0x4271A0ACUL))
#define bFM4_MFS13_LIN_SSR_FRE                 *((volatile unsigned char*)(0x4271A0B0UL))
#define bFM4_MFS13_LIN_SSR_LBD                 *((volatile unsigned char*)(0x4271A0B4UL))
#define bFM4_MFS13_LIN_SSR_REC                 *((volatile unsigned char*)(0x4271A0BCUL))
#define bFM4_MFS13_LIN_BGR_EXT                 *((volatile unsigned char*)(0x4271A1BCUL))
#define bFM4_MFS13_LIN_BGR1_EXT                *((volatile unsigned char*)(0x4271A1BCUL))
#define bFM4_MFS13_LIN_FCR_FE1                 *((volatile unsigned char*)(0x4271A280UL))
#define bFM4_MFS13_LIN_FCR_FE2                 *((volatile unsigned char*)(0x4271A284UL))
#define bFM4_MFS13_LIN_FCR_FCL1                *((volatile unsigned char*)(0x4271A288UL))
#define bFM4_MFS13_LIN_FCR_FCL2                *((volatile unsigned char*)(0x4271A28CUL))
#define bFM4_MFS13_LIN_FCR_FSET                *((volatile unsigned char*)(0x4271A290UL))
#define bFM4_MFS13_LIN_FCR_FLD                 *((volatile unsigned char*)(0x4271A294UL))
#define bFM4_MFS13_LIN_FCR_FLST                *((volatile unsigned char*)(0x4271A298UL))
#define bFM4_MFS13_LIN_FCR_FSEL                *((volatile unsigned char*)(0x4271A2A0UL))
#define bFM4_MFS13_LIN_FCR_FTIE                *((volatile unsigned char*)(0x4271A2A4UL))
#define bFM4_MFS13_LIN_FCR_FDRQ                *((volatile unsigned char*)(0x4271A2A8UL))
#define bFM4_MFS13_LIN_FCR_FRIIE               *((volatile unsigned char*)(0x4271A2ACUL))
#define bFM4_MFS13_LIN_FCR_FLSTE               *((volatile unsigned char*)(0x4271A2B0UL))
#define bFM4_MFS13_LIN_FCR0_FE1                *((volatile unsigned char*)(0x4271A280UL))
#define bFM4_MFS13_LIN_FCR0_FE2                *((volatile unsigned char*)(0x4271A284UL))
#define bFM4_MFS13_LIN_FCR0_FCL1               *((volatile unsigned char*)(0x4271A288UL))
#define bFM4_MFS13_LIN_FCR0_FCL2               *((volatile unsigned char*)(0x4271A28CUL))
#define bFM4_MFS13_LIN_FCR0_FSET               *((volatile unsigned char*)(0x4271A290UL))
#define bFM4_MFS13_LIN_FCR0_FLD                *((volatile unsigned char*)(0x4271A294UL))
#define bFM4_MFS13_LIN_FCR0_FLST               *((volatile unsigned char*)(0x4271A298UL))
#define bFM4_MFS13_LIN_FCR1_FSEL               *((volatile unsigned char*)(0x4271A2A0UL))
#define bFM4_MFS13_LIN_FCR1_FTIE               *((volatile unsigned char*)(0x4271A2A4UL))
#define bFM4_MFS13_LIN_FCR1_FDRQ               *((volatile unsigned char*)(0x4271A2A8UL))
#define bFM4_MFS13_LIN_FCR1_FRIIE              *((volatile unsigned char*)(0x4271A2ACUL))
#define bFM4_MFS13_LIN_FCR1_FLSTE              *((volatile unsigned char*)(0x4271A2B0UL))
#define bFM4_MFS13_LIN_FBYTE_FD0               *((volatile unsigned char*)(0x4271A300UL))
#define bFM4_MFS13_LIN_FBYTE_FD1               *((volatile unsigned char*)(0x4271A304UL))
#define bFM4_MFS13_LIN_FBYTE_FD2               *((volatile unsigned char*)(0x4271A308UL))
#define bFM4_MFS13_LIN_FBYTE_FD3               *((volatile unsigned char*)(0x4271A30CUL))
#define bFM4_MFS13_LIN_FBYTE_FD4               *((volatile unsigned char*)(0x4271A310UL))
#define bFM4_MFS13_LIN_FBYTE_FD5               *((volatile unsigned char*)(0x4271A314UL))
#define bFM4_MFS13_LIN_FBYTE_FD6               *((volatile unsigned char*)(0x4271A318UL))
#define bFM4_MFS13_LIN_FBYTE_FD7               *((volatile unsigned char*)(0x4271A31CUL))
#define bFM4_MFS13_LIN_FBYTE_FD8               *((volatile unsigned char*)(0x4271A320UL))
#define bFM4_MFS13_LIN_FBYTE_FD9               *((volatile unsigned char*)(0x4271A324UL))
#define bFM4_MFS13_LIN_FBYTE_FD10              *((volatile unsigned char*)(0x4271A328UL))
#define bFM4_MFS13_LIN_FBYTE_FD11              *((volatile unsigned char*)(0x4271A32CUL))
#define bFM4_MFS13_LIN_FBYTE_FD12              *((volatile unsigned char*)(0x4271A330UL))
#define bFM4_MFS13_LIN_FBYTE_FD13              *((volatile unsigned char*)(0x4271A334UL))
#define bFM4_MFS13_LIN_FBYTE_FD14              *((volatile unsigned char*)(0x4271A338UL))
#define bFM4_MFS13_LIN_FBYTE_FD15              *((volatile unsigned char*)(0x4271A33CUL))
#define bFM4_MFS13_LIN_FBYTE1_FD0              *((volatile unsigned char*)(0x4271A300UL))
#define bFM4_MFS13_LIN_FBYTE1_FD1              *((volatile unsigned char*)(0x4271A304UL))
#define bFM4_MFS13_LIN_FBYTE1_FD2              *((volatile unsigned char*)(0x4271A308UL))
#define bFM4_MFS13_LIN_FBYTE1_FD3              *((volatile unsigned char*)(0x4271A30CUL))
#define bFM4_MFS13_LIN_FBYTE1_FD4              *((volatile unsigned char*)(0x4271A310UL))
#define bFM4_MFS13_LIN_FBYTE1_FD5              *((volatile unsigned char*)(0x4271A314UL))
#define bFM4_MFS13_LIN_FBYTE1_FD6              *((volatile unsigned char*)(0x4271A318UL))
#define bFM4_MFS13_LIN_FBYTE1_FD7              *((volatile unsigned char*)(0x4271A31CUL))
#define bFM4_MFS13_LIN_FBYTE2_FD8              *((volatile unsigned char*)(0x4271A320UL))
#define bFM4_MFS13_LIN_FBYTE2_FD9              *((volatile unsigned char*)(0x4271A324UL))
#define bFM4_MFS13_LIN_FBYTE2_FD10             *((volatile unsigned char*)(0x4271A328UL))
#define bFM4_MFS13_LIN_FBYTE2_FD11             *((volatile unsigned char*)(0x4271A32CUL))
#define bFM4_MFS13_LIN_FBYTE2_FD12             *((volatile unsigned char*)(0x4271A330UL))
#define bFM4_MFS13_LIN_FBYTE2_FD13             *((volatile unsigned char*)(0x4271A334UL))
#define bFM4_MFS13_LIN_FBYTE2_FD14             *((volatile unsigned char*)(0x4271A338UL))
#define bFM4_MFS13_LIN_FBYTE2_FD15             *((volatile unsigned char*)(0x4271A33CUL))

/* MFS I2C channel 13 registers */
#define bFM4_MFS13_I2C_SMR_TIE                 *((volatile unsigned char*)(0x4271A008UL))
#define bFM4_MFS13_I2C_SMR_RIE                 *((volatile unsigned char*)(0x4271A00CUL))
#define bFM4_MFS13_I2C_SMR_MD0                 *((volatile unsigned char*)(0x4271A014UL))
#define bFM4_MFS13_I2C_SMR_MD1                 *((volatile unsigned char*)(0x4271A018UL))
#define bFM4_MFS13_I2C_SMR_MD2                 *((volatile unsigned char*)(0x4271A01CUL))
#define bFM4_MFS13_I2C_IBCR_INT                *((volatile unsigned char*)(0x4271A020UL))
#define bFM4_MFS13_I2C_IBCR_BER                *((volatile unsigned char*)(0x4271A024UL))
#define bFM4_MFS13_I2C_IBCR_INTE               *((volatile unsigned char*)(0x4271A028UL))
#define bFM4_MFS13_I2C_IBCR_CNDE               *((volatile unsigned char*)(0x4271A02CUL))
#define bFM4_MFS13_I2C_IBCR_WSEL               *((volatile unsigned char*)(0x4271A030UL))
#define bFM4_MFS13_I2C_IBCR_ACKE               *((volatile unsigned char*)(0x4271A034UL))
#define bFM4_MFS13_I2C_IBCR_ACT                *((volatile unsigned char*)(0x4271A038UL))
#define bFM4_MFS13_I2C_IBCR_SCC                *((volatile unsigned char*)(0x4271A038UL))
#define bFM4_MFS13_I2C_IBCR_MSS                *((volatile unsigned char*)(0x4271A03CUL))
#define bFM4_MFS13_I2C_IBSR_BB                 *((volatile unsigned char*)(0x4271A080UL))
#define bFM4_MFS13_I2C_IBSR_SPC                *((volatile unsigned char*)(0x4271A084UL))
#define bFM4_MFS13_I2C_IBSR_RSC                *((volatile unsigned char*)(0x4271A088UL))
#define bFM4_MFS13_I2C_IBSR_AL                 *((volatile unsigned char*)(0x4271A08CUL))
#define bFM4_MFS13_I2C_IBSR_TRX                *((volatile unsigned char*)(0x4271A090UL))
#define bFM4_MFS13_I2C_IBSR_RSA                *((volatile unsigned char*)(0x4271A094UL))
#define bFM4_MFS13_I2C_IBSR_RACK               *((volatile unsigned char*)(0x4271A098UL))
#define bFM4_MFS13_I2C_IBSR_FBT                *((volatile unsigned char*)(0x4271A09CUL))
#define bFM4_MFS13_I2C_SSR_TBI                 *((volatile unsigned char*)(0x4271A0A0UL))
#define bFM4_MFS13_I2C_SSR_TDRE                *((volatile unsigned char*)(0x4271A0A4UL))
#define bFM4_MFS13_I2C_SSR_RDRF                *((volatile unsigned char*)(0x4271A0A8UL))
#define bFM4_MFS13_I2C_SSR_ORE                 *((volatile unsigned char*)(0x4271A0ACUL))
#define bFM4_MFS13_I2C_SSR_TBIE                *((volatile unsigned char*)(0x4271A0B0UL))
#define bFM4_MFS13_I2C_SSR_DMA                 *((volatile unsigned char*)(0x4271A0B4UL))
#define bFM4_MFS13_I2C_SSR_TSET                *((volatile unsigned char*)(0x4271A0B8UL))
#define bFM4_MFS13_I2C_SSR_REC                 *((volatile unsigned char*)(0x4271A0BCUL))
#define bFM4_MFS13_I2C_ISBA_SA0                *((volatile unsigned char*)(0x4271A200UL))
#define bFM4_MFS13_I2C_ISBA_SA1                *((volatile unsigned char*)(0x4271A204UL))
#define bFM4_MFS13_I2C_ISBA_SA2                *((volatile unsigned char*)(0x4271A208UL))
#define bFM4_MFS13_I2C_ISBA_SA3                *((volatile unsigned char*)(0x4271A20CUL))
#define bFM4_MFS13_I2C_ISBA_SA4                *((volatile unsigned char*)(0x4271A210UL))
#define bFM4_MFS13_I2C_ISBA_SA5                *((volatile unsigned char*)(0x4271A214UL))
#define bFM4_MFS13_I2C_ISBA_SA6                *((volatile unsigned char*)(0x4271A218UL))
#define bFM4_MFS13_I2C_ISBA_SAEN               *((volatile unsigned char*)(0x4271A21CUL))
#define bFM4_MFS13_I2C_ISMK_SM0                *((volatile unsigned char*)(0x4271A220UL))
#define bFM4_MFS13_I2C_ISMK_SM1                *((volatile unsigned char*)(0x4271A224UL))
#define bFM4_MFS13_I2C_ISMK_SM2                *((volatile unsigned char*)(0x4271A228UL))
#define bFM4_MFS13_I2C_ISMK_SM3                *((volatile unsigned char*)(0x4271A22CUL))
#define bFM4_MFS13_I2C_ISMK_SM4                *((volatile unsigned char*)(0x4271A230UL))
#define bFM4_MFS13_I2C_ISMK_SM5                *((volatile unsigned char*)(0x4271A234UL))
#define bFM4_MFS13_I2C_ISMK_SM6                *((volatile unsigned char*)(0x4271A238UL))
#define bFM4_MFS13_I2C_ISMK_EN                 *((volatile unsigned char*)(0x4271A23CUL))
#define bFM4_MFS13_I2C_FCR_FE1                 *((volatile unsigned char*)(0x4271A280UL))
#define bFM4_MFS13_I2C_FCR_FE2                 *((volatile unsigned char*)(0x4271A284UL))
#define bFM4_MFS13_I2C_FCR_FCL1                *((volatile unsigned char*)(0x4271A288UL))
#define bFM4_MFS13_I2C_FCR_FCL2                *((volatile unsigned char*)(0x4271A28CUL))
#define bFM4_MFS13_I2C_FCR_FSET                *((volatile unsigned char*)(0x4271A290UL))
#define bFM4_MFS13_I2C_FCR_FLD                 *((volatile unsigned char*)(0x4271A294UL))
#define bFM4_MFS13_I2C_FCR_FLST                *((volatile unsigned char*)(0x4271A298UL))
#define bFM4_MFS13_I2C_FCR_FSEL                *((volatile unsigned char*)(0x4271A2A0UL))
#define bFM4_MFS13_I2C_FCR_FTIE                *((volatile unsigned char*)(0x4271A2A4UL))
#define bFM4_MFS13_I2C_FCR_FDRQ                *((volatile unsigned char*)(0x4271A2A8UL))
#define bFM4_MFS13_I2C_FCR_FRIIE               *((volatile unsigned char*)(0x4271A2ACUL))
#define bFM4_MFS13_I2C_FCR_FLSTE               *((volatile unsigned char*)(0x4271A2B0UL))
#define bFM4_MFS13_I2C_FCR0_FE1                *((volatile unsigned char*)(0x4271A280UL))
#define bFM4_MFS13_I2C_FCR0_FE2                *((volatile unsigned char*)(0x4271A284UL))
#define bFM4_MFS13_I2C_FCR0_FCL1               *((volatile unsigned char*)(0x4271A288UL))
#define bFM4_MFS13_I2C_FCR0_FCL2               *((volatile unsigned char*)(0x4271A28CUL))
#define bFM4_MFS13_I2C_FCR0_FSET               *((volatile unsigned char*)(0x4271A290UL))
#define bFM4_MFS13_I2C_FCR0_FLD                *((volatile unsigned char*)(0x4271A294UL))
#define bFM4_MFS13_I2C_FCR0_FLST               *((volatile unsigned char*)(0x4271A298UL))
#define bFM4_MFS13_I2C_FCR1_FSEL               *((volatile unsigned char*)(0x4271A2A0UL))
#define bFM4_MFS13_I2C_FCR1_FTIE               *((volatile unsigned char*)(0x4271A2A4UL))
#define bFM4_MFS13_I2C_FCR1_FDRQ               *((volatile unsigned char*)(0x4271A2A8UL))
#define bFM4_MFS13_I2C_FCR1_FRIIE              *((volatile unsigned char*)(0x4271A2ACUL))
#define bFM4_MFS13_I2C_FCR1_FLSTE              *((volatile unsigned char*)(0x4271A2B0UL))
#define bFM4_MFS13_I2C_FBYTE_FD0               *((volatile unsigned char*)(0x4271A300UL))
#define bFM4_MFS13_I2C_FBYTE_FD1               *((volatile unsigned char*)(0x4271A304UL))
#define bFM4_MFS13_I2C_FBYTE_FD2               *((volatile unsigned char*)(0x4271A308UL))
#define bFM4_MFS13_I2C_FBYTE_FD3               *((volatile unsigned char*)(0x4271A30CUL))
#define bFM4_MFS13_I2C_FBYTE_FD4               *((volatile unsigned char*)(0x4271A310UL))
#define bFM4_MFS13_I2C_FBYTE_FD5               *((volatile unsigned char*)(0x4271A314UL))
#define bFM4_MFS13_I2C_FBYTE_FD6               *((volatile unsigned char*)(0x4271A318UL))
#define bFM4_MFS13_I2C_FBYTE_FD7               *((volatile unsigned char*)(0x4271A31CUL))
#define bFM4_MFS13_I2C_FBYTE_FD8               *((volatile unsigned char*)(0x4271A320UL))
#define bFM4_MFS13_I2C_FBYTE_FD9               *((volatile unsigned char*)(0x4271A324UL))
#define bFM4_MFS13_I2C_FBYTE_FD10              *((volatile unsigned char*)(0x4271A328UL))
#define bFM4_MFS13_I2C_FBYTE_FD11              *((volatile unsigned char*)(0x4271A32CUL))
#define bFM4_MFS13_I2C_FBYTE_FD12              *((volatile unsigned char*)(0x4271A330UL))
#define bFM4_MFS13_I2C_FBYTE_FD13              *((volatile unsigned char*)(0x4271A334UL))
#define bFM4_MFS13_I2C_FBYTE_FD14              *((volatile unsigned char*)(0x4271A338UL))
#define bFM4_MFS13_I2C_FBYTE_FD15              *((volatile unsigned char*)(0x4271A33CUL))
#define bFM4_MFS13_I2C_FBYTE1_FD0              *((volatile unsigned char*)(0x4271A300UL))
#define bFM4_MFS13_I2C_FBYTE1_FD1              *((volatile unsigned char*)(0x4271A304UL))
#define bFM4_MFS13_I2C_FBYTE1_FD2              *((volatile unsigned char*)(0x4271A308UL))
#define bFM4_MFS13_I2C_FBYTE1_FD3              *((volatile unsigned char*)(0x4271A30CUL))
#define bFM4_MFS13_I2C_FBYTE1_FD4              *((volatile unsigned char*)(0x4271A310UL))
#define bFM4_MFS13_I2C_FBYTE1_FD5              *((volatile unsigned char*)(0x4271A314UL))
#define bFM4_MFS13_I2C_FBYTE1_FD6              *((volatile unsigned char*)(0x4271A318UL))
#define bFM4_MFS13_I2C_FBYTE1_FD7              *((volatile unsigned char*)(0x4271A31CUL))
#define bFM4_MFS13_I2C_FBYTE2_FD8              *((volatile unsigned char*)(0x4271A320UL))
#define bFM4_MFS13_I2C_FBYTE2_FD9              *((volatile unsigned char*)(0x4271A324UL))
#define bFM4_MFS13_I2C_FBYTE2_FD10             *((volatile unsigned char*)(0x4271A328UL))
#define bFM4_MFS13_I2C_FBYTE2_FD11             *((volatile unsigned char*)(0x4271A32CUL))
#define bFM4_MFS13_I2C_FBYTE2_FD12             *((volatile unsigned char*)(0x4271A330UL))
#define bFM4_MFS13_I2C_FBYTE2_FD13             *((volatile unsigned char*)(0x4271A334UL))
#define bFM4_MFS13_I2C_FBYTE2_FD14             *((volatile unsigned char*)(0x4271A338UL))
#define bFM4_MFS13_I2C_FBYTE2_FD15             *((volatile unsigned char*)(0x4271A33CUL))

