MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C1AJ0AGB1000A/mcu.h
#define bFM4_EXBUS_ATIM4_ALEW2                 *((volatile unsigned int*)(0x427E0E28UL))
#define bFM4_EXBUS_ATIM4_ALEW3                 *((volatile unsigned int*)(0x427E0E2CUL))
#define bFM4_EXBUS_ATIM5_ALC0                  *((volatile unsigned int*)(0x427E0E80UL))
#define bFM4_EXBUS_ATIM5_ALC1                  *((volatile unsigned int*)(0x427E0E84UL))
#define bFM4_EXBUS_ATIM5_ALC2                  *((volatile unsigned int*)(0x427E0E88UL))
#define bFM4_EXBUS_ATIM5_ALC3                  *((volatile unsigned int*)(0x427E0E8CUL))
#define bFM4_EXBUS_ATIM5_ALES0                 *((volatile unsigned int*)(0x427E0E90UL))
#define bFM4_EXBUS_ATIM5_ALES1                 *((volatile unsigned int*)(0x427E0E94UL))
#define bFM4_EXBUS_ATIM5_ALES2                 *((volatile unsigned int*)(0x427E0E98UL))
#define bFM4_EXBUS_ATIM5_ALES3                 *((volatile unsigned int*)(0x427E0E9CUL))
#define bFM4_EXBUS_ATIM5_ALEW0                 *((volatile unsigned int*)(0x427E0EA0UL))
#define bFM4_EXBUS_ATIM5_ALEW1                 *((volatile unsigned int*)(0x427E0EA4UL))
#define bFM4_EXBUS_ATIM5_ALEW2                 *((volatile unsigned int*)(0x427E0EA8UL))
#define bFM4_EXBUS_ATIM5_ALEW3                 *((volatile unsigned int*)(0x427E0EACUL))
#define bFM4_EXBUS_ATIM6_ALC0                  *((volatile unsigned int*)(0x427E0F00UL))
#define bFM4_EXBUS_ATIM6_ALC1                  *((volatile unsigned int*)(0x427E0F04UL))
#define bFM4_EXBUS_ATIM6_ALC2                  *((volatile unsigned int*)(0x427E0F08UL))
#define bFM4_EXBUS_ATIM6_ALC3                  *((volatile unsigned int*)(0x427E0F0CUL))
#define bFM4_EXBUS_ATIM6_ALES0                 *((volatile unsigned int*)(0x427E0F10UL))
#define bFM4_EXBUS_ATIM6_ALES1                 *((volatile unsigned int*)(0x427E0F14UL))
#define bFM4_EXBUS_ATIM6_ALES2                 *((volatile unsigned int*)(0x427E0F18UL))
#define bFM4_EXBUS_ATIM6_ALES3                 *((volatile unsigned int*)(0x427E0F1CUL))
#define bFM4_EXBUS_ATIM6_ALEW0                 *((volatile unsigned int*)(0x427E0F20UL))
#define bFM4_EXBUS_ATIM6_ALEW1                 *((volatile unsigned int*)(0x427E0F24UL))
#define bFM4_EXBUS_ATIM6_ALEW2                 *((volatile unsigned int*)(0x427E0F28UL))
#define bFM4_EXBUS_ATIM6_ALEW3                 *((volatile unsigned int*)(0x427E0F2CUL))
#define bFM4_EXBUS_ATIM7_ALC0                  *((volatile unsigned int*)(0x427E0F80UL))
#define bFM4_EXBUS_ATIM7_ALC1                  *((volatile unsigned int*)(0x427E0F84UL))
#define bFM4_EXBUS_ATIM7_ALC2                  *((volatile unsigned int*)(0x427E0F88UL))
#define bFM4_EXBUS_ATIM7_ALC3                  *((volatile unsigned int*)(0x427E0F8CUL))
#define bFM4_EXBUS_ATIM7_ALES0                 *((volatile unsigned int*)(0x427E0F90UL))
#define bFM4_EXBUS_ATIM7_ALES1                 *((volatile unsigned int*)(0x427E0F94UL))
#define bFM4_EXBUS_ATIM7_ALES2                 *((volatile unsigned int*)(0x427E0F98UL))
#define bFM4_EXBUS_ATIM7_ALES3                 *((volatile unsigned int*)(0x427E0F9CUL))
#define bFM4_EXBUS_ATIM7_ALEW0                 *((volatile unsigned int*)(0x427E0FA0UL))
#define bFM4_EXBUS_ATIM7_ALEW1                 *((volatile unsigned int*)(0x427E0FA4UL))
#define bFM4_EXBUS_ATIM7_ALEW2                 *((volatile unsigned int*)(0x427E0FA8UL))
#define bFM4_EXBUS_ATIM7_ALEW3                 *((volatile unsigned int*)(0x427E0FACUL))
#define bFM4_EXBUS_SDMODE_SDON                 *((volatile unsigned int*)(0x427E2000UL))
#define bFM4_EXBUS_SDMODE_PDON                 *((volatile unsigned int*)(0x427E2004UL))
#define bFM4_EXBUS_SDMODE_ROFF                 *((volatile unsigned int*)(0x427E2008UL))
#define bFM4_EXBUS_SDMODE_CASEL0               *((volatile unsigned int*)(0x427E2010UL))
#define bFM4_EXBUS_SDMODE_CASEL1               *((volatile unsigned int*)(0x427E2014UL))
#define bFM4_EXBUS_SDMODE_RASEL0               *((volatile unsigned int*)(0x427E2020UL))
#define bFM4_EXBUS_SDMODE_RASEL1               *((volatile unsigned int*)(0x427E2024UL))
#define bFM4_EXBUS_SDMODE_RASEL2               *((volatile unsigned int*)(0x427E2028UL))
#define bFM4_EXBUS_SDMODE_RASEL3               *((volatile unsigned int*)(0x427E202CUL))
#define bFM4_EXBUS_SDMODE_BASEL0               *((volatile unsigned int*)(0x427E2030UL))
#define bFM4_EXBUS_SDMODE_BASEL1               *((volatile unsigned int*)(0x427E2034UL))
#define bFM4_EXBUS_SDMODE_BASEL2               *((volatile unsigned int*)(0x427E2038UL))
#define bFM4_EXBUS_SDMODE_BASEL3               *((volatile unsigned int*)(0x427E203CUL))
#define bFM4_EXBUS_SDMODE_MSDCLKOFF            *((volatile unsigned int*)(0x427E2040UL))
#define bFM4_EXBUS_REFTIM_REFC0                *((volatile unsigned int*)(0x427E2080UL))
#define bFM4_EXBUS_REFTIM_REFC1                *((volatile unsigned int*)(0x427E2084UL))
#define bFM4_EXBUS_REFTIM_REFC2                *((volatile unsigned int*)(0x427E2088UL))
#define bFM4_EXBUS_REFTIM_REFC3                *((volatile unsigned int*)(0x427E208CUL))
#define bFM4_EXBUS_REFTIM_REFC4                *((volatile unsigned int*)(0x427E2090UL))
#define bFM4_EXBUS_REFTIM_REFC5                *((volatile unsigned int*)(0x427E2094UL))
#define bFM4_EXBUS_REFTIM_REFC6                *((volatile unsigned int*)(0x427E2098UL))
#define bFM4_EXBUS_REFTIM_REFC7                *((volatile unsigned int*)(0x427E209CUL))
#define bFM4_EXBUS_REFTIM_REFC8                *((volatile unsigned int*)(0x427E20A0UL))
#define bFM4_EXBUS_REFTIM_REFC9                *((volatile unsigned int*)(0x427E20A4UL))
#define bFM4_EXBUS_REFTIM_REFC10               *((volatile unsigned int*)(0x427E20A8UL))
#define bFM4_EXBUS_REFTIM_REFC11               *((volatile unsigned int*)(0x427E20ACUL))
#define bFM4_EXBUS_REFTIM_REFC12               *((volatile unsigned int*)(0x427E20B0UL))
#define bFM4_EXBUS_REFTIM_REFC13               *((volatile unsigned int*)(0x427E20B4UL))
#define bFM4_EXBUS_REFTIM_REFC14               *((volatile unsigned int*)(0x427E20B8UL))
#define bFM4_EXBUS_REFTIM_REFC15               *((volatile unsigned int*)(0x427E20BCUL))
#define bFM4_EXBUS_REFTIM_NREF0                *((volatile unsigned int*)(0x427E20C0UL))
#define bFM4_EXBUS_REFTIM_NREF1                *((volatile unsigned int*)(0x427E20C4UL))
#define bFM4_EXBUS_REFTIM_NREF2                *((volatile unsigned int*)(0x427E20C8UL))
#define bFM4_EXBUS_REFTIM_NREF3                *((volatile unsigned int*)(0x427E20CCUL))
#define bFM4_EXBUS_REFTIM_NREF4                *((volatile unsigned int*)(0x427E20D0UL))
#define bFM4_EXBUS_REFTIM_NREF5                *((volatile unsigned int*)(0x427E20D4UL))
#define bFM4_EXBUS_REFTIM_NREF6                *((volatile unsigned int*)(0x427E20D8UL))
#define bFM4_EXBUS_REFTIM_NREF7                *((volatile unsigned int*)(0x427E20DCUL))
#define bFM4_EXBUS_REFTIM_PREF                 *((volatile unsigned int*)(0x427E20E0UL))
#define bFM4_EXBUS_PWRDWN_PDC0                 *((volatile unsigned int*)(0x427E2100UL))
#define bFM4_EXBUS_PWRDWN_PDC1                 *((volatile unsigned int*)(0x427E2104UL))
#define bFM4_EXBUS_PWRDWN_PDC2                 *((volatile unsigned int*)(0x427E2108UL))
#define bFM4_EXBUS_PWRDWN_PDC3                 *((volatile unsigned int*)(0x427E210CUL))
#define bFM4_EXBUS_PWRDWN_PDC4                 *((volatile unsigned int*)(0x427E2110UL))
#define bFM4_EXBUS_PWRDWN_PDC5                 *((volatile unsigned int*)(0x427E2114UL))
#define bFM4_EXBUS_PWRDWN_PDC6                 *((volatile unsigned int*)(0x427E2118UL))
#define bFM4_EXBUS_PWRDWN_PDC7                 *((volatile unsigned int*)(0x427E211CUL))
#define bFM4_EXBUS_PWRDWN_PDC8                 *((volatile unsigned int*)(0x427E2120UL))
#define bFM4_EXBUS_PWRDWN_PDC9                 *((volatile unsigned int*)(0x427E2124UL))
#define bFM4_EXBUS_PWRDWN_PDC10                *((volatile unsigned int*)(0x427E2128UL))
#define bFM4_EXBUS_PWRDWN_PDC11                *((volatile unsigned int*)(0x427E212CUL))
#define bFM4_EXBUS_PWRDWN_PDC12                *((volatile unsigned int*)(0x427E2130UL))
#define bFM4_EXBUS_PWRDWN_PDC13                *((volatile unsigned int*)(0x427E2134UL))
#define bFM4_EXBUS_PWRDWN_PDC14                *((volatile unsigned int*)(0x427E2138UL))
#define bFM4_EXBUS_PWRDWN_PDC15                *((volatile unsigned int*)(0x427E213CUL))
#define bFM4_EXBUS_SDTIM_CL0                   *((volatile unsigned int*)(0x427E2180UL))
#define bFM4_EXBUS_SDTIM_CL1                   *((volatile unsigned int*)(0x427E2184UL))
#define bFM4_EXBUS_SDTIM_TRC0                  *((volatile unsigned int*)(0x427E2190UL))
#define bFM4_EXBUS_SDTIM_TRC1                  *((volatile unsigned int*)(0x427E2194UL))
#define bFM4_EXBUS_SDTIM_TRC2                  *((volatile unsigned int*)(0x427E2198UL))
#define bFM4_EXBUS_SDTIM_TRC3                  *((volatile unsigned int*)(0x427E219CUL))
#define bFM4_EXBUS_SDTIM_TRP0                  *((volatile unsigned int*)(0x427E21A0UL))
#define bFM4_EXBUS_SDTIM_TRP1                  *((volatile unsigned int*)(0x427E21A4UL))
#define bFM4_EXBUS_SDTIM_TRP2                  *((volatile unsigned int*)(0x427E21A8UL))
#define bFM4_EXBUS_SDTIM_TRP3                  *((volatile unsigned int*)(0x427E21ACUL))
#define bFM4_EXBUS_SDTIM_TRCD0                 *((volatile unsigned int*)(0x427E21B0UL))
#define bFM4_EXBUS_SDTIM_TRCD1                 *((volatile unsigned int*)(0x427E21B4UL))
#define bFM4_EXBUS_SDTIM_TRCD2                 *((volatile unsigned int*)(0x427E21B8UL))
#define bFM4_EXBUS_SDTIM_TRCD3                 *((volatile unsigned int*)(0x427E21BCUL))
#define bFM4_EXBUS_SDTIM_TRAS0                 *((volatile unsigned int*)(0x427E21C0UL))
#define bFM4_EXBUS_SDTIM_TRAS1                 *((volatile unsigned int*)(0x427E21C4UL))
#define bFM4_EXBUS_SDTIM_TRAS2                 *((volatile unsigned int*)(0x427E21C8UL))
#define bFM4_EXBUS_SDTIM_TRAS3                 *((volatile unsigned int*)(0x427E21CCUL))
#define bFM4_EXBUS_SDTIM_TREFC0                *((volatile unsigned int*)(0x427E21D0UL))
#define bFM4_EXBUS_SDTIM_TREFC1                *((volatile unsigned int*)(0x427E21D4UL))
#define bFM4_EXBUS_SDTIM_TREFC2                *((volatile unsigned int*)(0x427E21D8UL))
#define bFM4_EXBUS_SDTIM_TREFC3                *((volatile unsigned int*)(0x427E21DCUL))
#define bFM4_EXBUS_SDTIM_TDPL0                 *((volatile unsigned int*)(0x427E21E0UL))
#define bFM4_EXBUS_SDTIM_TDPL1                 *((volatile unsigned int*)(0x427E21E4UL))
#define bFM4_EXBUS_SDTIM_BOFF                  *((volatile unsigned int*)(0x427E21FCUL))
#define bFM4_EXBUS_SDCMD_SDAD0                 *((volatile unsigned int*)(0x427E2200UL))
#define bFM4_EXBUS_SDCMD_SDAD1                 *((volatile unsigned int*)(0x427E2204UL))
#define bFM4_EXBUS_SDCMD_SDAD2                 *((volatile unsigned int*)(0x427E2208UL))
#define bFM4_EXBUS_SDCMD_SDAD3                 *((volatile unsigned int*)(0x427E220CUL))
#define bFM4_EXBUS_SDCMD_SDAD4                 *((volatile unsigned int*)(0x427E2210UL))
#define bFM4_EXBUS_SDCMD_SDAD5                 *((volatile unsigned int*)(0x427E2214UL))
#define bFM4_EXBUS_SDCMD_SDAD6                 *((volatile unsigned int*)(0x427E2218UL))
#define bFM4_EXBUS_SDCMD_SDAD7                 *((volatile unsigned int*)(0x427E221CUL))
#define bFM4_EXBUS_SDCMD_SDAD8                 *((volatile unsigned int*)(0x427E2220UL))
#define bFM4_EXBUS_SDCMD_SDAD9                 *((volatile unsigned int*)(0x427E2224UL))
#define bFM4_EXBUS_SDCMD_SDAD10                *((volatile unsigned int*)(0x427E2228UL))
#define bFM4_EXBUS_SDCMD_SDAD11                *((volatile unsigned int*)(0x427E222CUL))
#define bFM4_EXBUS_SDCMD_SDAD12                *((volatile unsigned int*)(0x427E2230UL))
#define bFM4_EXBUS_SDCMD_SDAD13                *((volatile unsigned int*)(0x427E2234UL))
#define bFM4_EXBUS_SDCMD_SDAD14                *((volatile unsigned int*)(0x427E2238UL))
#define bFM4_EXBUS_SDCMD_SDAD15                *((volatile unsigned int*)(0x427E223CUL))
#define bFM4_EXBUS_SDCMD_SDWE                  *((volatile unsigned int*)(0x427E2240UL))
#define bFM4_EXBUS_SDCMD_SDCAS                 *((volatile unsigned int*)(0x427E2244UL))
#define bFM4_EXBUS_SDCMD_SDRAS                 *((volatile unsigned int*)(0x427E2248UL))
#define bFM4_EXBUS_SDCMD_SDCS                  *((volatile unsigned int*)(0x427E224CUL))
#define bFM4_EXBUS_SDCMD_SDCKE                 *((volatile unsigned int*)(0x427E2250UL))
#define bFM4_EXBUS_SDCMD_PEND                  *((volatile unsigned int*)(0x427E227CUL))
#define bFM4_EXBUS_MEMCERR_SFER                *((volatile unsigned int*)(0x427E4000UL))
#define bFM4_EXBUS_MEMCERR_SDER                *((volatile unsigned int*)(0x427E4004UL))
#define bFM4_EXBUS_MEMCERR_SFION               *((volatile unsigned int*)(0x427E4008UL))
#define bFM4_EXBUS_MEMCERR_SDION               *((volatile unsigned int*)(0x427E400CUL))
#define bFM4_EXBUS_DCLKR_MDIV0                 *((volatile unsigned int*)(0x427E6000UL))
#define bFM4_EXBUS_DCLKR_MDIV1                 *((volatile unsigned int*)(0x427E6004UL))
#define bFM4_EXBUS_DCLKR_MDIV2                 *((volatile unsigned int*)(0x427E6008UL))
#define bFM4_EXBUS_DCLKR_MDIV3                 *((volatile unsigned int*)(0x427E600CUL))
#define bFM4_EXBUS_DCLKR_MCLKON                *((volatile unsigned int*)(0x427E6010UL))
#define bFM4_EXBUS_EST_WERR                    *((volatile unsigned int*)(0x427E6080UL))
#define bFM4_EXBUS_WEAD_ADDR0                  *((volatile unsigned int*)(0x427E6100UL))
#define bFM4_EXBUS_WEAD_ADDR1                  *((volatile unsigned int*)(0x427E6104UL))
#define bFM4_EXBUS_WEAD_ADDR2                  *((volatile unsigned int*)(0x427E6108UL))
#define bFM4_EXBUS_WEAD_ADDR3                  *((volatile unsigned int*)(0x427E610CUL))
#define bFM4_EXBUS_WEAD_ADDR4                  *((volatile unsigned int*)(0x427E6110UL))
#define bFM4_EXBUS_WEAD_ADDR5                  *((volatile unsigned int*)(0x427E6114UL))
#define bFM4_EXBUS_WEAD_ADDR6                  *((volatile unsigned int*)(0x427E6118UL))
#define bFM4_EXBUS_WEAD_ADDR7                  *((volatile unsigned int*)(0x427E611CUL))
#define bFM4_EXBUS_WEAD_ADDR8                  *((volatile unsigned int*)(0x427E6120UL))
#define bFM4_EXBUS_WEAD_ADDR9                  *((volatile unsigned int*)(0x427E6124UL))
#define bFM4_EXBUS_WEAD_ADDR10                 *((volatile unsigned int*)(0x427E6128UL))
#define bFM4_EXBUS_WEAD_ADDR11                 *((volatile unsigned int*)(0x427E612CUL))
#define bFM4_EXBUS_WEAD_ADDR12                 *((volatile unsigned int*)(0x427E6130UL))
#define bFM4_EXBUS_WEAD_ADDR13                 *((volatile unsigned int*)(0x427E6134UL))
#define bFM4_EXBUS_WEAD_ADDR14                 *((volatile unsigned int*)(0x427E6138UL))
#define bFM4_EXBUS_WEAD_ADDR15                 *((volatile unsigned int*)(0x427E613CUL))
#define bFM4_EXBUS_WEAD_ADDR16                 *((volatile unsigned int*)(0x427E6140UL))
#define bFM4_EXBUS_WEAD_ADDR17                 *((volatile unsigned int*)(0x427E6144UL))
#define bFM4_EXBUS_WEAD_ADDR18                 *((volatile unsigned int*)(0x427E6148UL))
#define bFM4_EXBUS_WEAD_ADDR19                 *((volatile unsigned int*)(0x427E614CUL))
#define bFM4_EXBUS_WEAD_ADDR20                 *((volatile unsigned int*)(0x427E6150UL))
#define bFM4_EXBUS_WEAD_ADDR21                 *((volatile unsigned int*)(0x427E6154UL))
#define bFM4_EXBUS_WEAD_ADDR22                 *((volatile unsigned int*)(0x427E6158UL))
#define bFM4_EXBUS_WEAD_ADDR23                 *((volatile unsigned int*)(0x427E615CUL))
#define bFM4_EXBUS_WEAD_ADDR24                 *((volatile unsigned int*)(0x427E6160UL))
#define bFM4_EXBUS_WEAD_ADDR25                 *((volatile unsigned int*)(0x427E6164UL))
#define bFM4_EXBUS_WEAD_ADDR26                 *((volatile unsigned int*)(0x427E6168UL))
#define bFM4_EXBUS_WEAD_ADDR27                 *((volatile unsigned int*)(0x427E616CUL))
#define bFM4_EXBUS_WEAD_ADDR28                 *((volatile unsigned int*)(0x427E6170UL))
#define bFM4_EXBUS_WEAD_ADDR29                 *((volatile unsigned int*)(0x427E6174UL))
#define bFM4_EXBUS_WEAD_ADDR30                 *((volatile unsigned int*)(0x427E6178UL))
#define bFM4_EXBUS_WEAD_ADDR31                 *((volatile unsigned int*)(0x427E617CUL))
#define bFM4_EXBUS_ESCLR_WERRCLR               *((volatile unsigned int*)(0x427E6180UL))
#define bFM4_EXBUS_AMODE_WAEN                  *((volatile unsigned int*)(0x427E6200UL))



